/* automatically generated by rust-bindgen 0.72.0 */

#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 0;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;

pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub type __gnuc_va_list = __BindgenOpaqueArray<u64, 4usize>;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 32usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 16usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 24usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
    -> *mut FILE;
}
unsafe extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: __BindgenOpaqueArray<u64, 4usize>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_int,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __pad1: ::std::os::raw::c_ulong,
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 8usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 8usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 64usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 64usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 48usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 8usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGBA_8888: _Rga_SURF_FORMAT = 0;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGBX_8888: _Rga_SURF_FORMAT = 256;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGB_888: _Rga_SURF_FORMAT = 512;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BGRA_8888: _Rga_SURF_FORMAT = 768;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGB_565: _Rga_SURF_FORMAT = 1024;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGBA_5551: _Rga_SURF_FORMAT = 1280;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGBA_4444: _Rga_SURF_FORMAT = 1536;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BGR_888: _Rga_SURF_FORMAT = 1792;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_422_SP: _Rga_SURF_FORMAT = 2048;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_422_P: _Rga_SURF_FORMAT = 2304;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_420_SP: _Rga_SURF_FORMAT = 2560;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_420_P: _Rga_SURF_FORMAT = 2816;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_422_SP: _Rga_SURF_FORMAT = 3072;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_422_P: _Rga_SURF_FORMAT = 3328;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_420_SP: _Rga_SURF_FORMAT = 3584;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_420_P: _Rga_SURF_FORMAT = 3840;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BPP1: _Rga_SURF_FORMAT = 4096;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BPP2: _Rga_SURF_FORMAT = 4352;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BPP4: _Rga_SURF_FORMAT = 4608;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BPP8: _Rga_SURF_FORMAT = 4864;
pub const _Rga_SURF_FORMAT_RK_FORMAT_Y4: _Rga_SURF_FORMAT = 5120;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_400: _Rga_SURF_FORMAT = 5376;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BGRX_8888: _Rga_SURF_FORMAT = 5632;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YVYU_422: _Rga_SURF_FORMAT = 6144;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YVYU_420: _Rga_SURF_FORMAT = 6400;
pub const _Rga_SURF_FORMAT_RK_FORMAT_VYUY_422: _Rga_SURF_FORMAT = 6656;
pub const _Rga_SURF_FORMAT_RK_FORMAT_VYUY_420: _Rga_SURF_FORMAT = 6912;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YUYV_422: _Rga_SURF_FORMAT = 7168;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YUYV_420: _Rga_SURF_FORMAT = 7424;
pub const _Rga_SURF_FORMAT_RK_FORMAT_UYVY_422: _Rga_SURF_FORMAT = 7680;
pub const _Rga_SURF_FORMAT_RK_FORMAT_UYVY_420: _Rga_SURF_FORMAT = 7936;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_420_SP_10B: _Rga_SURF_FORMAT = 8192;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_420_SP_10B: _Rga_SURF_FORMAT = 8448;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_422_SP_10B: _Rga_SURF_FORMAT = 8704;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_422_SP_10B: _Rga_SURF_FORMAT = 8960;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_422_10b_SP: _Rga_SURF_FORMAT = 2228224;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_422_10b_SP: _Rga_SURF_FORMAT = 2293760;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BGR_565: _Rga_SURF_FORMAT = 9216;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BGRA_5551: _Rga_SURF_FORMAT = 9472;
pub const _Rga_SURF_FORMAT_RK_FORMAT_BGRA_4444: _Rga_SURF_FORMAT = 9728;
pub const _Rga_SURF_FORMAT_RK_FORMAT_ARGB_8888: _Rga_SURF_FORMAT = 10240;
pub const _Rga_SURF_FORMAT_RK_FORMAT_XRGB_8888: _Rga_SURF_FORMAT = 10496;
pub const _Rga_SURF_FORMAT_RK_FORMAT_ARGB_5551: _Rga_SURF_FORMAT = 10752;
pub const _Rga_SURF_FORMAT_RK_FORMAT_ARGB_4444: _Rga_SURF_FORMAT = 11008;
pub const _Rga_SURF_FORMAT_RK_FORMAT_ABGR_8888: _Rga_SURF_FORMAT = 11264;
pub const _Rga_SURF_FORMAT_RK_FORMAT_XBGR_8888: _Rga_SURF_FORMAT = 11520;
pub const _Rga_SURF_FORMAT_RK_FORMAT_ABGR_5551: _Rga_SURF_FORMAT = 11776;
pub const _Rga_SURF_FORMAT_RK_FORMAT_ABGR_4444: _Rga_SURF_FORMAT = 12032;
pub const _Rga_SURF_FORMAT_RK_FORMAT_RGBA2BPP: _Rga_SURF_FORMAT = 12288;
pub const _Rga_SURF_FORMAT_RK_FORMAT_A8: _Rga_SURF_FORMAT = 12544;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCbCr_444_SP: _Rga_SURF_FORMAT = 12800;
pub const _Rga_SURF_FORMAT_RK_FORMAT_YCrCb_444_SP: _Rga_SURF_FORMAT = 13056;
pub const _Rga_SURF_FORMAT_RK_FORMAT_Y8: _Rga_SURF_FORMAT = 13312;
pub const _Rga_SURF_FORMAT_RK_FORMAT_UNKNOWN: _Rga_SURF_FORMAT = 65536;
pub type _Rga_SURF_FORMAT = ::std::os::raw::c_uint;
pub use self::_Rga_SURF_FORMAT as RgaSURF_FORMAT;
pub const yuv2rgb_mode0: _bindgen_ty_1 = 0;
pub const yuv2rgb_mode1: _bindgen_ty_1 = 1;
pub const yuv2rgb_mode2: _bindgen_ty_1 = 2;
pub const rgb2yuv_601_full: _bindgen_ty_1 = 256;
pub const rgb2yuv_709_full: _bindgen_ty_1 = 512;
pub const yuv2yuv_601_limit_2_709_limit: _bindgen_ty_1 = 768;
pub const yuv2yuv_601_limit_2_709_full: _bindgen_ty_1 = 1024;
pub const yuv2yuv_709_limit_2_601_limit: _bindgen_ty_1 = 1280;
pub const yuv2yuv_709_limit_2_601_full: _bindgen_ty_1 = 1536;
pub const yuv2yuv_601_full_2_709_limit: _bindgen_ty_1 = 1792;
pub const yuv2yuv_601_full_2_709_full: _bindgen_ty_1 = 2048;
pub const yuv2yuv_709_full_2_601_limit: _bindgen_ty_1 = 2304;
pub const yuv2yuv_709_full_2_601_full: _bindgen_ty_1 = 2560;
pub const rgb2yuv_709_limit: _bindgen_ty_1 = 2816;
pub const yuv2rgb_709_full: _bindgen_ty_1 = 3072;
pub const yuv2yuv_601_limit_2_601_full: _bindgen_ty_1 = 3328;
pub const yuv2yuv_601_full_2_601_limit: _bindgen_ty_1 = 3584;
pub const yuv2yuv_709_limit_2_709_full: _bindgen_ty_1 = 3840;
pub const yuv2yuv_709_full_2_709_limit: _bindgen_ty_1 = 4096;
pub const full_csc_mask: _bindgen_ty_1 = 3840;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const RGA3_SCHEDULER_CORE0: _bindgen_ty_2 = 1;
pub const RGA3_SCHEDULER_CORE1: _bindgen_ty_2 = 2;
pub const RGA2_SCHEDULER_CORE0: _bindgen_ty_2 = 4;
pub const RGA2_SCHEDULER_CORE1: _bindgen_ty_2 = 8;
pub const RGA_CORE_MASK: _bindgen_ty_2 = 15;
pub const RGA_NONE_CORE: _bindgen_ty_2 = 0;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const raster_mode: _bindgen_ty_3 = 1;
pub const fbc_mode: _bindgen_ty_3 = 2;
pub const tile_mode: _bindgen_ty_3 = 4;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub type im_api_version_t = u32;
pub type im_job_handle_t = u32;
pub type im_ctx_id_t = u32;
pub type rga_buffer_handle_t = u32;
pub const IM_USAGE_IM_HAL_TRANSFORM_ROT_90: IM_USAGE = 1;
pub const IM_USAGE_IM_HAL_TRANSFORM_ROT_180: IM_USAGE = 2;
pub const IM_USAGE_IM_HAL_TRANSFORM_ROT_270: IM_USAGE = 4;
pub const IM_USAGE_IM_HAL_TRANSFORM_FLIP_H: IM_USAGE = 8;
pub const IM_USAGE_IM_HAL_TRANSFORM_FLIP_V: IM_USAGE = 16;
pub const IM_USAGE_IM_HAL_TRANSFORM_FLIP_H_V: IM_USAGE = 32;
pub const IM_USAGE_IM_HAL_TRANSFORM_MASK: IM_USAGE = 63;
pub const IM_USAGE_IM_ALPHA_BLEND_SRC_OVER: IM_USAGE = 64;
pub const IM_USAGE_IM_ALPHA_BLEND_SRC: IM_USAGE = 128;
pub const IM_USAGE_IM_ALPHA_BLEND_DST: IM_USAGE = 256;
pub const IM_USAGE_IM_ALPHA_BLEND_SRC_IN: IM_USAGE = 512;
pub const IM_USAGE_IM_ALPHA_BLEND_DST_IN: IM_USAGE = 1024;
pub const IM_USAGE_IM_ALPHA_BLEND_SRC_OUT: IM_USAGE = 2048;
pub const IM_USAGE_IM_ALPHA_BLEND_DST_OUT: IM_USAGE = 4096;
pub const IM_USAGE_IM_ALPHA_BLEND_DST_OVER: IM_USAGE = 8192;
pub const IM_USAGE_IM_ALPHA_BLEND_SRC_ATOP: IM_USAGE = 16384;
pub const IM_USAGE_IM_ALPHA_BLEND_DST_ATOP: IM_USAGE = 32768;
pub const IM_USAGE_IM_ALPHA_BLEND_XOR: IM_USAGE = 65536;
pub const IM_USAGE_IM_ALPHA_BLEND_MASK: IM_USAGE = 131008;
pub const IM_USAGE_IM_ALPHA_COLORKEY_NORMAL: IM_USAGE = 131072;
pub const IM_USAGE_IM_ALPHA_COLORKEY_INVERTED: IM_USAGE = 262144;
pub const IM_USAGE_IM_ALPHA_COLORKEY_MASK: IM_USAGE = 393216;
pub const IM_USAGE_IM_SYNC: IM_USAGE = 524288;
pub const IM_USAGE_IM_CROP: IM_USAGE = 1048576;
pub const IM_USAGE_IM_COLOR_FILL: IM_USAGE = 2097152;
pub const IM_USAGE_IM_COLOR_PALETTE: IM_USAGE = 4194304;
pub const IM_USAGE_IM_NN_QUANTIZE: IM_USAGE = 8388608;
pub const IM_USAGE_IM_ROP: IM_USAGE = 16777216;
pub const IM_USAGE_IM_ALPHA_BLEND_PRE_MUL: IM_USAGE = 33554432;
pub const IM_USAGE_IM_ASYNC: IM_USAGE = 67108864;
pub const IM_USAGE_IM_MOSAIC: IM_USAGE = 134217728;
pub const IM_USAGE_IM_OSD: IM_USAGE = 268435456;
pub const IM_USAGE_IM_PRE_INTR: IM_USAGE = 536870912;
pub const IM_USAGE_IM_ALPHA_BIT_MAP: IM_USAGE = 1073741824;
pub type IM_USAGE = ::std::os::raw::c_uint;
pub const IM_RD_MODE_IM_RASTER_MODE: IM_RD_MODE = 1;
pub const IM_RD_MODE_IM_AFBC16x16_MODE: IM_RD_MODE = 2;
pub const IM_RD_MODE_IM_TILE8x8_MODE: IM_RD_MODE = 4;
pub const IM_RD_MODE_IM_TILE4x4_MODE: IM_RD_MODE = 8;
pub const IM_RD_MODE_IM_RKFBC64x4_MODE: IM_RD_MODE = 16;
pub const IM_RD_MODE_IM_AFBC32x8_MODE: IM_RD_MODE = 32;
pub const IM_RD_MODE_IM_FBC_MODE: IM_RD_MODE = 2;
pub const IM_RD_MODE_IM_TILE_MODE: IM_RD_MODE = 4;
pub type IM_RD_MODE = ::std::os::raw::c_uint;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_RGA3_CORE0: IM_SCHEDULER_CORE = 1;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_RGA3_CORE1: IM_SCHEDULER_CORE = 2;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_RGA2_CORE0: IM_SCHEDULER_CORE = 4;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_RGA2_CORE1: IM_SCHEDULER_CORE = 8;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_RGA3_DEFAULT: IM_SCHEDULER_CORE = 1;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_RGA2_DEFAULT: IM_SCHEDULER_CORE = 4;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_MASK: IM_SCHEDULER_CORE = 15;
pub const IM_SCHEDULER_CORE_IM_SCHEDULER_DEFAULT: IM_SCHEDULER_CORE = 0;
pub type IM_SCHEDULER_CORE = ::std::os::raw::c_uint;
pub const IM_ROP_CODE_IM_ROP_AND: IM_ROP_CODE = 136;
pub const IM_ROP_CODE_IM_ROP_OR: IM_ROP_CODE = 238;
pub const IM_ROP_CODE_IM_ROP_NOT_DST: IM_ROP_CODE = 85;
pub const IM_ROP_CODE_IM_ROP_NOT_SRC: IM_ROP_CODE = 51;
pub const IM_ROP_CODE_IM_ROP_XOR: IM_ROP_CODE = 246;
pub const IM_ROP_CODE_IM_ROP_NOT_XOR: IM_ROP_CODE = 249;
pub type IM_ROP_CODE = ::std::os::raw::c_uint;
pub const IM_MOSAIC_MODE_IM_MOSAIC_8: IM_MOSAIC_MODE = 0;
pub const IM_MOSAIC_MODE_IM_MOSAIC_16: IM_MOSAIC_MODE = 1;
pub const IM_MOSAIC_MODE_IM_MOSAIC_32: IM_MOSAIC_MODE = 2;
pub const IM_MOSAIC_MODE_IM_MOSAIC_64: IM_MOSAIC_MODE = 3;
pub const IM_MOSAIC_MODE_IM_MOSAIC_128: IM_MOSAIC_MODE = 4;
pub type IM_MOSAIC_MODE = ::std::os::raw::c_uint;
pub const IM_BORDER_TYPE_IM_BORDER_CONSTANT: IM_BORDER_TYPE = 0;
pub const IM_BORDER_TYPE_IM_BORDER_REFLECT: IM_BORDER_TYPE = 2;
pub const IM_BORDER_TYPE_IM_BORDER_WRAP: IM_BORDER_TYPE = 3;
pub type IM_BORDER_TYPE = ::std::os::raw::c_uint;
pub const IM_COLOR_SPACE_MODE_IM_YUV_TO_RGB_BT601_LIMIT: IM_COLOR_SPACE_MODE = 1;
pub const IM_COLOR_SPACE_MODE_IM_YUV_TO_RGB_BT601_FULL: IM_COLOR_SPACE_MODE = 2;
pub const IM_COLOR_SPACE_MODE_IM_YUV_TO_RGB_BT709_LIMIT: IM_COLOR_SPACE_MODE = 3;
pub const IM_COLOR_SPACE_MODE_IM_YUV_TO_RGB_MASK: IM_COLOR_SPACE_MODE = 3;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_YUV_BT601_FULL: IM_COLOR_SPACE_MODE = 4;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_YUV_BT601_LIMIT: IM_COLOR_SPACE_MODE = 8;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_YUV_BT709_LIMIT: IM_COLOR_SPACE_MODE = 12;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_YUV_MASK: IM_COLOR_SPACE_MODE = 12;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_Y4: IM_COLOR_SPACE_MODE = 16;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_Y4_DITHER: IM_COLOR_SPACE_MODE = 32;
pub const IM_COLOR_SPACE_MODE_IM_RGB_TO_Y1_DITHER: IM_COLOR_SPACE_MODE = 48;
pub const IM_COLOR_SPACE_MODE_IM_Y4_MASK: IM_COLOR_SPACE_MODE = 48;
pub const IM_COLOR_SPACE_MODE_IM_RGB_FULL: IM_COLOR_SPACE_MODE = 256;
pub const IM_COLOR_SPACE_MODE_IM_RGB_CLIP: IM_COLOR_SPACE_MODE = 512;
pub const IM_COLOR_SPACE_MODE_IM_YUV_BT601_LIMIT_RANGE: IM_COLOR_SPACE_MODE = 768;
pub const IM_COLOR_SPACE_MODE_IM_YUV_BT601_FULL_RANGE: IM_COLOR_SPACE_MODE = 1024;
pub const IM_COLOR_SPACE_MODE_IM_YUV_BT709_LIMIT_RANGE: IM_COLOR_SPACE_MODE = 1280;
pub const IM_COLOR_SPACE_MODE_IM_YUV_BT709_FULL_RANGE: IM_COLOR_SPACE_MODE = 1536;
pub const IM_COLOR_SPACE_MODE_IM_FULL_CSC_MASK: IM_COLOR_SPACE_MODE = 3840;
pub const IM_COLOR_SPACE_MODE_IM_COLOR_SPACE_DEFAULT: IM_COLOR_SPACE_MODE = 0;
pub type IM_COLOR_SPACE_MODE = ::std::os::raw::c_uint;
pub const IM_SCALE_IM_UP_SCALE: IM_SCALE = 0;
pub const IM_SCALE_IM_DOWN_SCALE: IM_SCALE = 1;
pub type IM_SCALE = ::std::os::raw::c_uint;
pub const IM_SCALE_MODE_INTER_NEAREST: IM_SCALE_MODE = 0;
pub const IM_SCALE_MODE_INTER_LINEAR: IM_SCALE_MODE = 1;
pub const IM_SCALE_MODE_INTER_CUBIC: IM_SCALE_MODE = 2;
pub type IM_SCALE_MODE = ::std::os::raw::c_uint;
pub const IM_INTER_MODE_IM_INTERP_DEFAULT: IM_INTER_MODE = 0;
pub const IM_INTER_MODE_IM_INTERP_LINEAR: IM_INTER_MODE = 1;
pub const IM_INTER_MODE_IM_INTERP_CUBIC: IM_INTER_MODE = 2;
pub const IM_INTER_MODE_IM_INTERP_AVERAGE: IM_INTER_MODE = 3;
pub const IM_INTER_MODE_IM_INTERP_MASK: IM_INTER_MODE = 15;
pub const IM_INTER_MODE_IM_INTERP_HORIZ_SHIFT: IM_INTER_MODE = 0;
pub const IM_INTER_MODE_IM_INTERP_VERTI_SHIFT: IM_INTER_MODE = 4;
pub const IM_INTER_MODE_IM_INTERP_HORIZ_FLAG: IM_INTER_MODE = 256;
pub const IM_INTER_MODE_IM_INTERP_VERTI_FLAG: IM_INTER_MODE = 512;
pub type IM_INTER_MODE = ::std::os::raw::c_uint;
pub const IM_CONFIG_NAME_IM_CONFIG_SCHEDULER_CORE: IM_CONFIG_NAME = 0;
pub const IM_CONFIG_NAME_IM_CONFIG_PRIORITY: IM_CONFIG_NAME = 1;
pub const IM_CONFIG_NAME_IM_CONFIG_CHECK: IM_CONFIG_NAME = 2;
pub type IM_CONFIG_NAME = ::std::os::raw::c_uint;
pub const IM_OSD_MODE_IM_OSD_MODE_STATISTICS: IM_OSD_MODE = 1;
pub const IM_OSD_MODE_IM_OSD_MODE_AUTO_INVERT: IM_OSD_MODE = 2;
pub type IM_OSD_MODE = ::std::os::raw::c_uint;
pub const IM_OSD_INVERT_CHANNEL_IM_OSD_INVERT_CHANNEL_NONE: IM_OSD_INVERT_CHANNEL = 0;
pub const IM_OSD_INVERT_CHANNEL_IM_OSD_INVERT_CHANNEL_Y_G: IM_OSD_INVERT_CHANNEL = 1;
pub const IM_OSD_INVERT_CHANNEL_IM_OSD_INVERT_CHANNEL_C_RB: IM_OSD_INVERT_CHANNEL = 2;
pub const IM_OSD_INVERT_CHANNEL_IM_OSD_INVERT_CHANNEL_ALPHA: IM_OSD_INVERT_CHANNEL = 4;
pub const IM_OSD_INVERT_CHANNEL_IM_OSD_INVERT_CHANNEL_COLOR: IM_OSD_INVERT_CHANNEL = 3;
pub const IM_OSD_INVERT_CHANNEL_IM_OSD_INVERT_CHANNEL_BOTH: IM_OSD_INVERT_CHANNEL = 7;
pub type IM_OSD_INVERT_CHANNEL = ::std::os::raw::c_uint;
pub const IM_OSD_FLAGS_MODE_IM_OSD_FLAGS_INTERNAL: IM_OSD_FLAGS_MODE = 0;
pub const IM_OSD_FLAGS_MODE_IM_OSD_FLAGS_EXTERNAL: IM_OSD_FLAGS_MODE = 1;
pub type IM_OSD_FLAGS_MODE = ::std::os::raw::c_uint;
pub const IM_OSD_INVERT_MODE_IM_OSD_INVERT_USE_FACTOR: IM_OSD_INVERT_MODE = 0;
pub const IM_OSD_INVERT_MODE_IM_OSD_INVERT_USE_SWAP: IM_OSD_INVERT_MODE = 1;
pub type IM_OSD_INVERT_MODE = ::std::os::raw::c_uint;
pub const IM_OSD_BACKGROUND_DEFAULT_IM_OSD_BACKGROUND_DEFAULT_BRIGHT: IM_OSD_BACKGROUND_DEFAULT = 0;
pub const IM_OSD_BACKGROUND_DEFAULT_IM_OSD_BACKGROUND_DEFAULT_DARK: IM_OSD_BACKGROUND_DEFAULT = 1;
pub type IM_OSD_BACKGROUND_DEFAULT = ::std::os::raw::c_uint;
pub const IM_OSD_BLOCK_WIDTH_MODE_IM_OSD_BLOCK_MODE_NORMAL: IM_OSD_BLOCK_WIDTH_MODE = 0;
pub const IM_OSD_BLOCK_WIDTH_MODE_IM_OSD_BLOCK_MODE_DIFFERENT: IM_OSD_BLOCK_WIDTH_MODE = 1;
pub type IM_OSD_BLOCK_WIDTH_MODE = ::std::os::raw::c_uint;
pub const IM_OSD_DIRECTION_IM_OSD_MODE_HORIZONTAL: IM_OSD_DIRECTION = 0;
pub const IM_OSD_DIRECTION_IM_OSD_MODE_VERTICAL: IM_OSD_DIRECTION = 1;
pub type IM_OSD_DIRECTION = ::std::os::raw::c_uint;
pub const IM_OSD_COLOR_MODE_IM_OSD_COLOR_PIXEL: IM_OSD_COLOR_MODE = 0;
pub const IM_OSD_COLOR_MODE_IM_OSD_COLOR_EXTERNAL: IM_OSD_COLOR_MODE = 1;
pub type IM_OSD_COLOR_MODE = ::std::os::raw::c_uint;
pub const IM_PRE_INTR_FLAGS_IM_INTR_READ_INTR: IM_PRE_INTR_FLAGS = 1;
pub const IM_PRE_INTR_FLAGS_IM_INTR_READ_HOLD: IM_PRE_INTR_FLAGS = 2;
pub const IM_PRE_INTR_FLAGS_IM_INTR_WRITE_INTR: IM_PRE_INTR_FLAGS = 4;
pub type IM_PRE_INTR_FLAGS = ::std::os::raw::c_uint;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_NONE: IM_CONTEXT_FLAGS = 0;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_SRC_FIX_ENABLE: IM_CONTEXT_FLAGS = 1;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_SRC_CACHE_INFO: IM_CONTEXT_FLAGS = 2;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_SRC1_FIX_ENABLE: IM_CONTEXT_FLAGS = 4;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_SRC1_CACHE_INFO: IM_CONTEXT_FLAGS = 8;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_DST_FIX_ENABLE: IM_CONTEXT_FLAGS = 16;
pub const IM_CONTEXT_FLAGS_IM_CONTEXT_DST_CACHE_INFO: IM_CONTEXT_FLAGS = 32;
pub type IM_CONTEXT_FLAGS = ::std::os::raw::c_uint;
pub const IM_INFORMATION_RGA_VENDOR: IM_INFORMATION = 0;
pub const IM_INFORMATION_RGA_VERSION: IM_INFORMATION = 1;
pub const IM_INFORMATION_RGA_MAX_INPUT: IM_INFORMATION = 2;
pub const IM_INFORMATION_RGA_MAX_OUTPUT: IM_INFORMATION = 3;
pub const IM_INFORMATION_RGA_BYTE_STRIDE: IM_INFORMATION = 4;
pub const IM_INFORMATION_RGA_SCALE_LIMIT: IM_INFORMATION = 5;
pub const IM_INFORMATION_RGA_INPUT_FORMAT: IM_INFORMATION = 6;
pub const IM_INFORMATION_RGA_OUTPUT_FORMAT: IM_INFORMATION = 7;
pub const IM_INFORMATION_RGA_FEATURE: IM_INFORMATION = 8;
pub const IM_INFORMATION_RGA_EXPECTED: IM_INFORMATION = 9;
pub const IM_INFORMATION_RGA_ALL: IM_INFORMATION = 10;
pub type IM_INFORMATION = ::std::os::raw::c_uint;
pub const IM_STATUS_IM_STATUS_NOERROR: IM_STATUS = 2;
pub const IM_STATUS_IM_STATUS_SUCCESS: IM_STATUS = 1;
pub const IM_STATUS_IM_STATUS_NOT_SUPPORTED: IM_STATUS = -1;
pub const IM_STATUS_IM_STATUS_OUT_OF_MEMORY: IM_STATUS = -2;
pub const IM_STATUS_IM_STATUS_INVALID_PARAM: IM_STATUS = -3;
pub const IM_STATUS_IM_STATUS_ILLEGAL_PARAM: IM_STATUS = -4;
pub const IM_STATUS_IM_STATUS_ERROR_VERSION: IM_STATUS = -5;
pub const IM_STATUS_IM_STATUS_FAILED: IM_STATUS = 0;
pub type IM_STATUS = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_rect {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_rect"][::std::mem::size_of::<im_rect>() - 16usize];
    ["Alignment of im_rect"][::std::mem::align_of::<im_rect>() - 4usize];
    ["Offset of field: im_rect::x"][::std::mem::offset_of!(im_rect, x) - 0usize];
    ["Offset of field: im_rect::y"][::std::mem::offset_of!(im_rect, y) - 4usize];
    ["Offset of field: im_rect::width"][::std::mem::offset_of!(im_rect, width) - 8usize];
    ["Offset of field: im_rect::height"][::std::mem::offset_of!(im_rect, height) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_colorkey_range {
    pub max: ::std::os::raw::c_int,
    pub min: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_colorkey_range"][::std::mem::size_of::<im_colorkey_range>() - 8usize];
    ["Alignment of im_colorkey_range"][::std::mem::align_of::<im_colorkey_range>() - 4usize];
    ["Offset of field: im_colorkey_range::max"]
        [::std::mem::offset_of!(im_colorkey_range, max) - 0usize];
    ["Offset of field: im_colorkey_range::min"]
        [::std::mem::offset_of!(im_colorkey_range, min) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_nn {
    pub scale_r: ::std::os::raw::c_int,
    pub scale_g: ::std::os::raw::c_int,
    pub scale_b: ::std::os::raw::c_int,
    pub offset_r: ::std::os::raw::c_int,
    pub offset_g: ::std::os::raw::c_int,
    pub offset_b: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_nn"][::std::mem::size_of::<im_nn>() - 24usize];
    ["Alignment of im_nn"][::std::mem::align_of::<im_nn>() - 4usize];
    ["Offset of field: im_nn::scale_r"][::std::mem::offset_of!(im_nn, scale_r) - 0usize];
    ["Offset of field: im_nn::scale_g"][::std::mem::offset_of!(im_nn, scale_g) - 4usize];
    ["Offset of field: im_nn::scale_b"][::std::mem::offset_of!(im_nn, scale_b) - 8usize];
    ["Offset of field: im_nn::offset_r"][::std::mem::offset_of!(im_nn, offset_r) - 12usize];
    ["Offset of field: im_nn::offset_g"][::std::mem::offset_of!(im_nn, offset_g) - 16usize];
    ["Offset of field: im_nn::offset_b"][::std::mem::offset_of!(im_nn, offset_b) - 20usize];
};
pub type im_nn_t = im_nn;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rga_buffer_t {
    pub vir_addr: *mut ::std::os::raw::c_void,
    pub phy_addr: *mut ::std::os::raw::c_void,
    pub fd: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub wstride: ::std::os::raw::c_int,
    pub hstride: ::std::os::raw::c_int,
    pub format: ::std::os::raw::c_int,
    pub color_space_mode: ::std::os::raw::c_int,
    pub __bindgen_anon_1: rga_buffer_t__bindgen_ty_1,
    pub rd_mode: ::std::os::raw::c_int,
    pub color: ::std::os::raw::c_int,
    pub colorkey_range: im_colorkey_range,
    pub nn: im_nn_t,
    pub rop_code: ::std::os::raw::c_int,
    pub handle: rga_buffer_handle_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rga_buffer_t__bindgen_ty_1 {
    pub global_alpha: ::std::os::raw::c_int,
    pub alpha_bit: rga_buffer_t__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rga_buffer_t__bindgen_ty_1__bindgen_ty_1 {
    pub alpha0: u16,
    pub alpha1: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rga_buffer_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<rga_buffer_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of rga_buffer_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<rga_buffer_t__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: rga_buffer_t__bindgen_ty_1__bindgen_ty_1::alpha0"]
        [::std::mem::offset_of!(rga_buffer_t__bindgen_ty_1__bindgen_ty_1, alpha0) - 0usize];
    ["Offset of field: rga_buffer_t__bindgen_ty_1__bindgen_ty_1::alpha1"]
        [::std::mem::offset_of!(rga_buffer_t__bindgen_ty_1__bindgen_ty_1, alpha1) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rga_buffer_t__bindgen_ty_1"]
        [::std::mem::size_of::<rga_buffer_t__bindgen_ty_1>() - 4usize];
    ["Alignment of rga_buffer_t__bindgen_ty_1"]
        [::std::mem::align_of::<rga_buffer_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: rga_buffer_t__bindgen_ty_1::global_alpha"]
        [::std::mem::offset_of!(rga_buffer_t__bindgen_ty_1, global_alpha) - 0usize];
    ["Offset of field: rga_buffer_t__bindgen_ty_1::alpha_bit"]
        [::std::mem::offset_of!(rga_buffer_t__bindgen_ty_1, alpha_bit) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rga_buffer_t"][::std::mem::size_of::<rga_buffer_t>() - 96usize];
    ["Alignment of rga_buffer_t"][::std::mem::align_of::<rga_buffer_t>() - 8usize];
    ["Offset of field: rga_buffer_t::vir_addr"]
        [::std::mem::offset_of!(rga_buffer_t, vir_addr) - 0usize];
    ["Offset of field: rga_buffer_t::phy_addr"]
        [::std::mem::offset_of!(rga_buffer_t, phy_addr) - 8usize];
    ["Offset of field: rga_buffer_t::fd"][::std::mem::offset_of!(rga_buffer_t, fd) - 16usize];
    ["Offset of field: rga_buffer_t::width"][::std::mem::offset_of!(rga_buffer_t, width) - 20usize];
    ["Offset of field: rga_buffer_t::height"]
        [::std::mem::offset_of!(rga_buffer_t, height) - 24usize];
    ["Offset of field: rga_buffer_t::wstride"]
        [::std::mem::offset_of!(rga_buffer_t, wstride) - 28usize];
    ["Offset of field: rga_buffer_t::hstride"]
        [::std::mem::offset_of!(rga_buffer_t, hstride) - 32usize];
    ["Offset of field: rga_buffer_t::format"]
        [::std::mem::offset_of!(rga_buffer_t, format) - 36usize];
    ["Offset of field: rga_buffer_t::color_space_mode"]
        [::std::mem::offset_of!(rga_buffer_t, color_space_mode) - 40usize];
    ["Offset of field: rga_buffer_t::rd_mode"]
        [::std::mem::offset_of!(rga_buffer_t, rd_mode) - 48usize];
    ["Offset of field: rga_buffer_t::color"][::std::mem::offset_of!(rga_buffer_t, color) - 52usize];
    ["Offset of field: rga_buffer_t::colorkey_range"]
        [::std::mem::offset_of!(rga_buffer_t, colorkey_range) - 56usize];
    ["Offset of field: rga_buffer_t::nn"][::std::mem::offset_of!(rga_buffer_t, nn) - 64usize];
    ["Offset of field: rga_buffer_t::rop_code"]
        [::std::mem::offset_of!(rga_buffer_t, rop_code) - 88usize];
    ["Offset of field: rga_buffer_t::handle"]
        [::std::mem::offset_of!(rga_buffer_t, handle) - 92usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct im_color {
    pub __bindgen_anon_1: im_color__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union im_color__bindgen_ty_1 {
    pub __bindgen_anon_1: im_color__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_color__bindgen_ty_1__bindgen_ty_1 {
    pub red: u8,
    pub green: u8,
    pub blue: u8,
    pub alpha: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_color__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<im_color__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of im_color__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<im_color__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: im_color__bindgen_ty_1__bindgen_ty_1::red"]
        [::std::mem::offset_of!(im_color__bindgen_ty_1__bindgen_ty_1, red) - 0usize];
    ["Offset of field: im_color__bindgen_ty_1__bindgen_ty_1::green"]
        [::std::mem::offset_of!(im_color__bindgen_ty_1__bindgen_ty_1, green) - 1usize];
    ["Offset of field: im_color__bindgen_ty_1__bindgen_ty_1::blue"]
        [::std::mem::offset_of!(im_color__bindgen_ty_1__bindgen_ty_1, blue) - 2usize];
    ["Offset of field: im_color__bindgen_ty_1__bindgen_ty_1::alpha"]
        [::std::mem::offset_of!(im_color__bindgen_ty_1__bindgen_ty_1, alpha) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_color__bindgen_ty_1"][::std::mem::size_of::<im_color__bindgen_ty_1>() - 4usize];
    ["Alignment of im_color__bindgen_ty_1"]
        [::std::mem::align_of::<im_color__bindgen_ty_1>() - 4usize];
    ["Offset of field: im_color__bindgen_ty_1::value"]
        [::std::mem::offset_of!(im_color__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_color"][::std::mem::size_of::<im_color>() - 4usize];
    ["Alignment of im_color"][::std::mem::align_of::<im_color>() - 4usize];
};
pub type im_color_t = im_color;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_osd_invert_factor {
    pub alpha_max: u8,
    pub alpha_min: u8,
    pub yg_max: u8,
    pub yg_min: u8,
    pub crb_max: u8,
    pub crb_min: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_osd_invert_factor"][::std::mem::size_of::<im_osd_invert_factor>() - 6usize];
    ["Alignment of im_osd_invert_factor"][::std::mem::align_of::<im_osd_invert_factor>() - 1usize];
    ["Offset of field: im_osd_invert_factor::alpha_max"]
        [::std::mem::offset_of!(im_osd_invert_factor, alpha_max) - 0usize];
    ["Offset of field: im_osd_invert_factor::alpha_min"]
        [::std::mem::offset_of!(im_osd_invert_factor, alpha_min) - 1usize];
    ["Offset of field: im_osd_invert_factor::yg_max"]
        [::std::mem::offset_of!(im_osd_invert_factor, yg_max) - 2usize];
    ["Offset of field: im_osd_invert_factor::yg_min"]
        [::std::mem::offset_of!(im_osd_invert_factor, yg_min) - 3usize];
    ["Offset of field: im_osd_invert_factor::crb_max"]
        [::std::mem::offset_of!(im_osd_invert_factor, crb_max) - 4usize];
    ["Offset of field: im_osd_invert_factor::crb_min"]
        [::std::mem::offset_of!(im_osd_invert_factor, crb_min) - 5usize];
};
pub type im_osd_invert_factor_t = im_osd_invert_factor;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct im_osd_bpp2 {
    pub ac_swap: u8,
    pub endian_swap: u8,
    pub color0: im_color_t,
    pub color1: im_color_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_osd_bpp2"][::std::mem::size_of::<im_osd_bpp2>() - 12usize];
    ["Alignment of im_osd_bpp2"][::std::mem::align_of::<im_osd_bpp2>() - 4usize];
    ["Offset of field: im_osd_bpp2::ac_swap"]
        [::std::mem::offset_of!(im_osd_bpp2, ac_swap) - 0usize];
    ["Offset of field: im_osd_bpp2::endian_swap"]
        [::std::mem::offset_of!(im_osd_bpp2, endian_swap) - 1usize];
    ["Offset of field: im_osd_bpp2::color0"][::std::mem::offset_of!(im_osd_bpp2, color0) - 4usize];
    ["Offset of field: im_osd_bpp2::color1"][::std::mem::offset_of!(im_osd_bpp2, color1) - 8usize];
};
pub type im_osd_bpp2_t = im_osd_bpp2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct im_osd_block {
    pub width_mode: ::std::os::raw::c_int,
    pub __bindgen_anon_1: im_osd_block__bindgen_ty_1,
    pub block_count: ::std::os::raw::c_int,
    pub background_config: ::std::os::raw::c_int,
    pub direction: ::std::os::raw::c_int,
    pub color_mode: ::std::os::raw::c_int,
    pub normal_color: im_color_t,
    pub invert_color: im_color_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union im_osd_block__bindgen_ty_1 {
    pub width: ::std::os::raw::c_int,
    pub width_index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_osd_block__bindgen_ty_1"]
        [::std::mem::size_of::<im_osd_block__bindgen_ty_1>() - 4usize];
    ["Alignment of im_osd_block__bindgen_ty_1"]
        [::std::mem::align_of::<im_osd_block__bindgen_ty_1>() - 4usize];
    ["Offset of field: im_osd_block__bindgen_ty_1::width"]
        [::std::mem::offset_of!(im_osd_block__bindgen_ty_1, width) - 0usize];
    ["Offset of field: im_osd_block__bindgen_ty_1::width_index"]
        [::std::mem::offset_of!(im_osd_block__bindgen_ty_1, width_index) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_osd_block"][::std::mem::size_of::<im_osd_block>() - 32usize];
    ["Alignment of im_osd_block"][::std::mem::align_of::<im_osd_block>() - 4usize];
    ["Offset of field: im_osd_block::width_mode"]
        [::std::mem::offset_of!(im_osd_block, width_mode) - 0usize];
    ["Offset of field: im_osd_block::block_count"]
        [::std::mem::offset_of!(im_osd_block, block_count) - 8usize];
    ["Offset of field: im_osd_block::background_config"]
        [::std::mem::offset_of!(im_osd_block, background_config) - 12usize];
    ["Offset of field: im_osd_block::direction"]
        [::std::mem::offset_of!(im_osd_block, direction) - 16usize];
    ["Offset of field: im_osd_block::color_mode"]
        [::std::mem::offset_of!(im_osd_block, color_mode) - 20usize];
    ["Offset of field: im_osd_block::normal_color"]
        [::std::mem::offset_of!(im_osd_block, normal_color) - 24usize];
    ["Offset of field: im_osd_block::invert_color"]
        [::std::mem::offset_of!(im_osd_block, invert_color) - 28usize];
};
pub type im_osd_block_t = im_osd_block;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_osd_invert {
    pub invert_channel: ::std::os::raw::c_int,
    pub flags_mode: ::std::os::raw::c_int,
    pub flags_index: ::std::os::raw::c_int,
    pub invert_flags: u64,
    pub current_flags: u64,
    pub invert_mode: ::std::os::raw::c_int,
    pub factor: im_osd_invert_factor_t,
    pub threash: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_osd_invert"][::std::mem::size_of::<im_osd_invert>() - 48usize];
    ["Alignment of im_osd_invert"][::std::mem::align_of::<im_osd_invert>() - 8usize];
    ["Offset of field: im_osd_invert::invert_channel"]
        [::std::mem::offset_of!(im_osd_invert, invert_channel) - 0usize];
    ["Offset of field: im_osd_invert::flags_mode"]
        [::std::mem::offset_of!(im_osd_invert, flags_mode) - 4usize];
    ["Offset of field: im_osd_invert::flags_index"]
        [::std::mem::offset_of!(im_osd_invert, flags_index) - 8usize];
    ["Offset of field: im_osd_invert::invert_flags"]
        [::std::mem::offset_of!(im_osd_invert, invert_flags) - 16usize];
    ["Offset of field: im_osd_invert::current_flags"]
        [::std::mem::offset_of!(im_osd_invert, current_flags) - 24usize];
    ["Offset of field: im_osd_invert::invert_mode"]
        [::std::mem::offset_of!(im_osd_invert, invert_mode) - 32usize];
    ["Offset of field: im_osd_invert::factor"]
        [::std::mem::offset_of!(im_osd_invert, factor) - 36usize];
    ["Offset of field: im_osd_invert::threash"]
        [::std::mem::offset_of!(im_osd_invert, threash) - 44usize];
};
pub type im_osd_invert_t = im_osd_invert;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct im_osd {
    pub osd_mode: ::std::os::raw::c_int,
    pub block_parm: im_osd_block_t,
    pub invert_config: im_osd_invert_t,
    pub bpp2_info: im_osd_bpp2_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_osd"][::std::mem::size_of::<im_osd>() - 104usize];
    ["Alignment of im_osd"][::std::mem::align_of::<im_osd>() - 8usize];
    ["Offset of field: im_osd::osd_mode"][::std::mem::offset_of!(im_osd, osd_mode) - 0usize];
    ["Offset of field: im_osd::block_parm"][::std::mem::offset_of!(im_osd, block_parm) - 4usize];
    ["Offset of field: im_osd::invert_config"]
        [::std::mem::offset_of!(im_osd, invert_config) - 40usize];
    ["Offset of field: im_osd::bpp2_info"][::std::mem::offset_of!(im_osd, bpp2_info) - 88usize];
};
pub type im_osd_t = im_osd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_intr_config {
    pub flags: u32,
    pub read_threshold: ::std::os::raw::c_int,
    pub write_start: ::std::os::raw::c_int,
    pub write_step: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_intr_config"][::std::mem::size_of::<im_intr_config>() - 16usize];
    ["Alignment of im_intr_config"][::std::mem::align_of::<im_intr_config>() - 4usize];
    ["Offset of field: im_intr_config::flags"]
        [::std::mem::offset_of!(im_intr_config, flags) - 0usize];
    ["Offset of field: im_intr_config::read_threshold"]
        [::std::mem::offset_of!(im_intr_config, read_threshold) - 4usize];
    ["Offset of field: im_intr_config::write_start"]
        [::std::mem::offset_of!(im_intr_config, write_start) - 8usize];
    ["Offset of field: im_intr_config::write_step"]
        [::std::mem::offset_of!(im_intr_config, write_step) - 12usize];
};
pub type im_intr_config_t = im_intr_config;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct im_opt {
    pub version: im_api_version_t,
    pub color: ::std::os::raw::c_int,
    pub colorkey_range: im_colorkey_range,
    pub nn: im_nn_t,
    pub rop_code: ::std::os::raw::c_int,
    pub priority: ::std::os::raw::c_int,
    pub core: ::std::os::raw::c_int,
    pub mosaic_mode: ::std::os::raw::c_int,
    pub osd_config: im_osd_t,
    pub intr_config: im_intr_config_t,
    pub interp: ::std::os::raw::c_int,
    pub reserve: [::std::os::raw::c_char; 124usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_opt"][::std::mem::size_of::<im_opt>() - 304usize];
    ["Alignment of im_opt"][::std::mem::align_of::<im_opt>() - 8usize];
    ["Offset of field: im_opt::version"][::std::mem::offset_of!(im_opt, version) - 0usize];
    ["Offset of field: im_opt::color"][::std::mem::offset_of!(im_opt, color) - 4usize];
    ["Offset of field: im_opt::colorkey_range"]
        [::std::mem::offset_of!(im_opt, colorkey_range) - 8usize];
    ["Offset of field: im_opt::nn"][::std::mem::offset_of!(im_opt, nn) - 16usize];
    ["Offset of field: im_opt::rop_code"][::std::mem::offset_of!(im_opt, rop_code) - 40usize];
    ["Offset of field: im_opt::priority"][::std::mem::offset_of!(im_opt, priority) - 44usize];
    ["Offset of field: im_opt::core"][::std::mem::offset_of!(im_opt, core) - 48usize];
    ["Offset of field: im_opt::mosaic_mode"][::std::mem::offset_of!(im_opt, mosaic_mode) - 52usize];
    ["Offset of field: im_opt::osd_config"][::std::mem::offset_of!(im_opt, osd_config) - 56usize];
    ["Offset of field: im_opt::intr_config"]
        [::std::mem::offset_of!(im_opt, intr_config) - 160usize];
    ["Offset of field: im_opt::interp"][::std::mem::offset_of!(im_opt, interp) - 176usize];
    ["Offset of field: im_opt::reserve"][::std::mem::offset_of!(im_opt, reserve) - 180usize];
};
pub type im_opt_t = im_opt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct im_handle_param {
    pub width: u32,
    pub height: u32,
    pub format: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of im_handle_param"][::std::mem::size_of::<im_handle_param>() - 12usize];
    ["Alignment of im_handle_param"][::std::mem::align_of::<im_handle_param>() - 4usize];
    ["Offset of field: im_handle_param::width"]
        [::std::mem::offset_of!(im_handle_param, width) - 0usize];
    ["Offset of field: im_handle_param::height"]
        [::std::mem::offset_of!(im_handle_param, height) - 4usize];
    ["Offset of field: im_handle_param::format"]
        [::std::mem::offset_of!(im_handle_param, format) - 8usize];
};
pub type im_handle_param_t = im_handle_param;
unsafe extern "C" {
    #[doc = " Query RGA basic information, supported resolution, supported format, etc.\n\n @param name\n      RGA_VENDOR\n      RGA_VERSION\n      RGA_MAX_INPUT\n      RGA_MAX_OUTPUT\n      RGA_INPUT_FORMAT\n      RGA_OUTPUT_FORMAT\n      RGA_EXPECTED\n      RGA_ALL\n\n @returns a string describing properties of RGA."]
    pub fn querystring(name: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn imStrError_t(status: IM_STATUS) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn imcheck_t(
        src: rga_buffer_t,
        dst: rga_buffer_t,
        pat: rga_buffer_t,
        src_rect: im_rect,
        dst_rect: im_rect,
        pat_rect: im_rect,
        mode_usage: ::std::os::raw::c_int,
    ) -> IM_STATUS;
}
unsafe extern "C" {
