/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type __f32x4_t = [f32; 4usize];
pub type __f64x2_t = [f64; 2usize];
pub type __sv_f32_t = __BindgenOpaqueArray<u128, 0usize>;
pub type __sv_f64_t = __BindgenOpaqueArray<u128, 0usize>;
pub type __sv_bool_t = __BindgenOpaqueArray<u16, 0usize>;
unsafe extern "C" {
    pub fn _ZGVsMxvv_atan2f(arg1: __sv_f32_t, arg2: __sv_f32_t, arg3: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_acosf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_asinf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_atanf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_cosf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_expf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_exp10f(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_exp2f(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_expm1f(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_logf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log10f(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log1pf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log2f(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_sinf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_tanf(arg1: __sv_f32_t, arg2: __sv_bool_t) -> __sv_f32_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxvv_atan2(arg1: __sv_f64_t, arg2: __sv_f64_t, arg3: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_acos(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_asin(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_atan(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_cos(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_exp(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_exp10(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_exp2(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_expm1(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log10(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log1p(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_log2(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_sin(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
unsafe extern "C" {
    pub fn _ZGVsMxv_tan(arg1: __sv_f64_t, arg2: __sv_bool_t) -> __sv_f64_t;
}
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn log(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn logb(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn floor(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn significand(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(__x: f64, __y: u128) -> f64;
}
unsafe extern "C" {
    pub fn __nexttoward(__x: f64, __y: u128) -> f64;
}
unsafe extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn round(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __round(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn expf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn logf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardf(__x: f32, __y: u128) -> f32;
}
unsafe extern "C" {
    pub fn __nexttowardf(__x: f32, __y: u128) -> f32;
}
unsafe extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
unsafe extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fpclassifyl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinfl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitel(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigl(__x: u128, __y: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __acosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn asinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __asinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn atanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __atanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn atan2l(__y: u128, __x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __atan2l(__y: u128, __x: u128) -> u128;
}
unsafe extern "C" {
    pub fn cosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __cosl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn sinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __sinl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn tanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __tanl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn coshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __coshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn sinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __sinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn tanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __tanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn acoshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __acoshl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn asinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __asinhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn atanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __atanhl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn expl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __expl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn logl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __logl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn log10l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __log10l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn modfl(__x: u128, __iptr: *mut u128) -> u128;
}
unsafe extern "C" {
    pub fn __modfl(__x: u128, __iptr: *mut u128) -> u128;
}
unsafe extern "C" {
    pub fn expm1l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __expm1l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn log1pl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __log1pl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn logbl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __logbl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn exp2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __exp2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn log2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __log2l(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn powl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __powl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn sqrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __sqrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn hypotl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __hypotl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn cbrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __cbrtl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn ceill(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __ceill(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn fabsl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fabsl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn floorl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __floorl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn fmodl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fmodl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn isinfl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finitel(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dreml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __dreml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn significandl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __significandl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn copysignl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __copysignl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
unsafe extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
unsafe extern "C" {
    pub fn isnanl(__value: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __j0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn j1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __j1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn y0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __y0l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn y1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __y1l(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
unsafe extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __erfl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __erfcl(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __lgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __tgammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn gammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn __gammal(arg1: u128) -> u128;
}
unsafe extern "C" {
    pub fn lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn rintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __rintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn nextafterl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __nextafterl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn nexttowardl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __nexttowardl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn remainderl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __remainderl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
unsafe extern "C" {
    pub fn __scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
unsafe extern "C" {
    pub fn nearbyintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __nearbyintl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn roundl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __roundl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn truncl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn __truncl(__x: u128) -> u128;
}
unsafe extern "C" {
    pub fn remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn __remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
unsafe extern "C" {
    pub fn lrintl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrintl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lroundl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lroundl(__x: u128) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdiml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fdiml(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn fmaxl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fmaxl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn fminl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fminl(__x: u128, __y: u128) -> u128;
}
unsafe extern "C" {
    pub fn fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
unsafe extern "C" {
    pub fn __fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
unsafe extern "C" {
    pub fn scalbl(__x: u128, __n: u128) -> u128;
}
unsafe extern "C" {
    pub fn __scalbl(__x: u128, __n: u128) -> u128;
}
unsafe extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub const FP_NAN: _bindgen_ty_1 = 0;
pub const FP_INFINITE: _bindgen_ty_1 = 1;
pub const FP_ZERO: _bindgen_ty_1 = 2;
pub const FP_SUBNORMAL: _bindgen_ty_1 = 3;
pub const FP_NORMAL: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const MpiCmd_MPP_OSAL_CMD_BASE: MpiCmd = 1048576;
pub const MpiCmd_MPP_OSAL_CMD_END: MpiCmd = 1048577;
pub const MpiCmd_MPP_CMD_BASE: MpiCmd = 2097152;
pub const MpiCmd_MPP_ENABLE_DEINTERLACE: MpiCmd = 2097153;
pub const MpiCmd_MPP_SET_INPUT_BLOCK: MpiCmd = 2097154;
pub const MpiCmd_MPP_SET_INTPUT_BLOCK_TIMEOUT: MpiCmd = 2097155;
pub const MpiCmd_MPP_SET_OUTPUT_BLOCK: MpiCmd = 2097156;
pub const MpiCmd_MPP_SET_OUTPUT_BLOCK_TIMEOUT: MpiCmd = 2097157;
pub const MpiCmd_MPP_SET_INPUT_TIMEOUT: MpiCmd = 2097158;
pub const MpiCmd_MPP_SET_OUTPUT_TIMEOUT: MpiCmd = 2097159;
pub const MpiCmd_MPP_SET_DISABLE_THREAD: MpiCmd = 2097160;
pub const MpiCmd_MPP_SET_SELECT_TIMEOUT: MpiCmd = 2097161;
pub const MpiCmd_MPP_SET_VENC_INIT_KCFG: MpiCmd = 2097162;
pub const MpiCmd_MPP_STATE_CMD_BASE: MpiCmd = 2097408;
pub const MpiCmd_MPP_START: MpiCmd = 2097409;
pub const MpiCmd_MPP_STOP: MpiCmd = 2097410;
pub const MpiCmd_MPP_PAUSE: MpiCmd = 2097411;
pub const MpiCmd_MPP_RESUME: MpiCmd = 2097412;
pub const MpiCmd_MPP_CMD_END: MpiCmd = 2097413;
pub const MpiCmd_MPP_CODEC_CMD_BASE: MpiCmd = 3145728;
pub const MpiCmd_MPP_CODEC_GET_FRAME_INFO: MpiCmd = 3145729;
pub const MpiCmd_MPP_CODEC_CMD_END: MpiCmd = 3145730;
pub const MpiCmd_MPP_DEC_CMD_BASE: MpiCmd = 3211264;
pub const MpiCmd_MPP_DEC_SET_FRAME_INFO: MpiCmd = 3211265;
pub const MpiCmd_MPP_DEC_SET_EXT_BUF_GROUP: MpiCmd = 3211266;
pub const MpiCmd_MPP_DEC_SET_INFO_CHANGE_READY: MpiCmd = 3211267;
pub const MpiCmd_MPP_DEC_SET_PRESENT_TIME_ORDER: MpiCmd = 3211268;
pub const MpiCmd_MPP_DEC_SET_PARSER_SPLIT_MODE: MpiCmd = 3211269;
pub const MpiCmd_MPP_DEC_SET_PARSER_FAST_MODE: MpiCmd = 3211270;
pub const MpiCmd_MPP_DEC_GET_STREAM_COUNT: MpiCmd = 3211271;
pub const MpiCmd_MPP_DEC_GET_VPUMEM_USED_COUNT: MpiCmd = 3211272;
pub const MpiCmd_MPP_DEC_SET_VC1_EXTRA_DATA: MpiCmd = 3211273;
pub const MpiCmd_MPP_DEC_SET_OUTPUT_FORMAT: MpiCmd = 3211274;
pub const MpiCmd_MPP_DEC_SET_DISABLE_ERROR: MpiCmd = 3211275;
pub const MpiCmd_MPP_DEC_SET_IMMEDIATE_OUT: MpiCmd = 3211276;
pub const MpiCmd_MPP_DEC_SET_ENABLE_DEINTERLACE: MpiCmd = 3211277;
pub const MpiCmd_MPP_DEC_SET_ENABLE_FAST_PLAY: MpiCmd = 3211278;
pub const MpiCmd_MPP_DEC_SET_DISABLE_THREAD: MpiCmd = 3211279;
pub const MpiCmd_MPP_DEC_SET_MAX_USE_BUFFER_SIZE: MpiCmd = 3211280;
pub const MpiCmd_MPP_DEC_SET_ENABLE_MVC: MpiCmd = 3211281;
pub const MpiCmd_MPP_DEC_GET_THUMBNAIL_FRAME_INFO: MpiCmd = 3211282;
pub const MpiCmd_MPP_DEC_SET_DISABLE_DPB_CHECK: MpiCmd = 3211283;
pub const MpiCmd_MPP_DEC_SET_CODEC_MODE: MpiCmd = 3211284;
pub const MpiCmd_MPP_DEC_SET_DIS_ERR_CLR_MARK: MpiCmd = 3211285;
pub const MpiCmd_MPP_DEC_CMD_QUERY: MpiCmd = 3211520;
pub const MpiCmd_MPP_DEC_QUERY: MpiCmd = 3211521;
pub const MpiCmd_CMD_DEC_CMD_CFG: MpiCmd = 3211776;
pub const MpiCmd_MPP_DEC_SET_CFG: MpiCmd = 3211777;
pub const MpiCmd_MPP_DEC_GET_CFG: MpiCmd = 3211778;
pub const MpiCmd_MPP_DEC_CMD_END: MpiCmd = 3211779;
pub const MpiCmd_MPP_ENC_CMD_BASE: MpiCmd = 3276800;
pub const MpiCmd_MPP_ENC_SET_CFG: MpiCmd = 3276801;
pub const MpiCmd_MPP_ENC_GET_CFG: MpiCmd = 3276802;
pub const MpiCmd_MPP_ENC_SET_PREP_CFG: MpiCmd = 3276803;
pub const MpiCmd_MPP_ENC_GET_PREP_CFG: MpiCmd = 3276804;
pub const MpiCmd_MPP_ENC_SET_RC_CFG: MpiCmd = 3276805;
pub const MpiCmd_MPP_ENC_GET_RC_CFG: MpiCmd = 3276806;
pub const MpiCmd_MPP_ENC_SET_CODEC_CFG: MpiCmd = 3276807;
pub const MpiCmd_MPP_ENC_GET_CODEC_CFG: MpiCmd = 3276808;
pub const MpiCmd_MPP_ENC_SET_IDR_FRAME: MpiCmd = 3276809;
pub const MpiCmd_MPP_ENC_SET_OSD_LEGACY_0: MpiCmd = 3276810;
pub const MpiCmd_MPP_ENC_SET_OSD_LEGACY_1: MpiCmd = 3276811;
pub const MpiCmd_MPP_ENC_SET_OSD_LEGACY_2: MpiCmd = 3276812;
pub const MpiCmd_MPP_ENC_GET_HDR_SYNC: MpiCmd = 3276813;
pub const MpiCmd_MPP_ENC_GET_EXTRA_INFO: MpiCmd = 3276814;
pub const MpiCmd_MPP_ENC_SET_SEI_CFG: MpiCmd = 3276815;
pub const MpiCmd_MPP_ENC_GET_SEI_DATA: MpiCmd = 3276816;
pub const MpiCmd_MPP_ENC_PRE_ALLOC_BUFF: MpiCmd = 3276817;
pub const MpiCmd_MPP_ENC_SET_QP_RANGE: MpiCmd = 3276818;
pub const MpiCmd_MPP_ENC_SET_ROI_CFG: MpiCmd = 3276819;
pub const MpiCmd_MPP_ENC_SET_CTU_QP: MpiCmd = 3276820;
pub const MpiCmd_MPP_ENC_GET_ROI_CFG: MpiCmd = 3276821;
pub const MpiCmd_MPP_ENC_CMD_QUERY: MpiCmd = 3277056;
pub const MpiCmd_MPP_ENC_QUERY: MpiCmd = 3277057;
pub const MpiCmd_MPP_ENC_CFG_RC_API: MpiCmd = 3277312;
pub const MpiCmd_MPP_ENC_GET_RC_API_ALL: MpiCmd = 3277313;
pub const MpiCmd_MPP_ENC_GET_RC_API_BY_TYPE: MpiCmd = 3277314;
pub const MpiCmd_MPP_ENC_SET_RC_API_CFG: MpiCmd = 3277315;
pub const MpiCmd_MPP_ENC_GET_RC_API_CURRENT: MpiCmd = 3277316;
pub const MpiCmd_MPP_ENC_SET_RC_API_CURRENT: MpiCmd = 3277317;
pub const MpiCmd_MPP_ENC_CFG_MISC: MpiCmd = 3309568;
pub const MpiCmd_MPP_ENC_SET_HEADER_MODE: MpiCmd = 3309569;
pub const MpiCmd_MPP_ENC_GET_HEADER_MODE: MpiCmd = 3309570;
pub const MpiCmd_MPP_ENC_CFG_SPLIT: MpiCmd = 3309824;
pub const MpiCmd_MPP_ENC_SET_SPLIT: MpiCmd = 3309825;
pub const MpiCmd_MPP_ENC_GET_SPLIT: MpiCmd = 3309826;
pub const MpiCmd_MPP_ENC_CFG_REF: MpiCmd = 3310080;
pub const MpiCmd_MPP_ENC_SET_REF_CFG: MpiCmd = 3310081;
pub const MpiCmd_MPP_ENC_GET_REF_CFG: MpiCmd = 3310082;
pub const MpiCmd_MPP_ENC_CFG_OSD: MpiCmd = 3310592;
pub const MpiCmd_MPP_ENC_SET_OSD_PLT_CFG: MpiCmd = 3310593;
pub const MpiCmd_MPP_ENC_GET_OSD_PLT_CFG: MpiCmd = 3310594;
pub const MpiCmd_MPP_ENC_SET_OSD_DATA_CFG: MpiCmd = 3310595;
pub const MpiCmd_MPP_ENC_CFG_USERDATA: MpiCmd = 3310848;
pub const MpiCmd_MPP_ENC_SET_USERDATA: MpiCmd = 3310849;
pub const MpiCmd_MPP_ENC_GET_USERDATA: MpiCmd = 3310850;
pub const MpiCmd_MPP_ENC_CMD_END: MpiCmd = 3310851;
pub const MpiCmd_MPP_ISP_CMD_BASE: MpiCmd = 3342336;
pub const MpiCmd_MPP_ISP_CMD_END: MpiCmd = 3342337;
pub const MpiCmd_MPP_HAL_CMD_BASE: MpiCmd = 4194304;
pub const MpiCmd_MPP_HAL_CMD_END: MpiCmd = 4194305;
pub const MpiCmd_MPI_CMD_BUTT: MpiCmd = 4194306;
pub type MpiCmd = ::std::os::raw::c_uint;
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type RK_U8 = ::std::os::raw::c_uchar;
pub type RK_U16 = ::std::os::raw::c_ushort;
pub type RK_U32 = ::std::os::raw::c_uint;
pub type RK_ULONG = ::std::os::raw::c_ulong;
pub type RK_UL = RK_ULONG;
pub type RK_U64 = ::std::os::raw::c_ulonglong;
pub type RK_S8 = ::std::os::raw::c_schar;
pub type RK_S16 = ::std::os::raw::c_short;
pub type RK_S32 = ::std::os::raw::c_int;
pub type RK_LONG = ::std::os::raw::c_long;
pub type RK_SL = RK_LONG;
pub type RK_S64 = ::std::os::raw::c_longlong;
pub type RK_FLOAT = f32;
pub type RK_DOUBLE = f64;
pub type RK_SIZE_T = ::std::os::raw::c_ulong;
pub type RK_HANDLE = ::std::os::raw::c_uint;
pub type rk_u8 = ::std::os::raw::c_uchar;
pub type rk_u16 = ::std::os::raw::c_ushort;
pub type rk_u32 = ::std::os::raw::c_uint;
pub type rk_ulong = ::std::os::raw::c_ulong;
pub type rk_ul = rk_ulong;
pub type rk_u64 = ::std::os::raw::c_ulonglong;
pub type rk_s8 = ::std::os::raw::c_schar;
pub type rk_s16 = ::std::os::raw::c_short;
pub type rk_s32 = ::std::os::raw::c_int;
pub type rk_long = ::std::os::raw::c_long;
pub type rk_sl = rk_long;
pub type rk_s64 = ::std::os::raw::c_longlong;
pub type rk_float = f32;
pub type rk_double = f64;
pub type rk_size_t = ::std::os::raw::c_ulong;
pub type rk_handle = ::std::os::raw::c_uint;
pub const RK_BOOL_RK_FALSE: RK_BOOL = 0;
pub const RK_BOOL_RK_TRUE: RK_BOOL = 1;
pub type RK_BOOL = ::std::os::raw::c_uint;
pub const rk_bool_rk_false: rk_bool = 0;
pub const rk_bool_rk_true: rk_bool = 1;
pub type rk_bool = ::std::os::raw::c_uint;
#[doc = "< decoder"]
pub const MppCtxType_MPP_CTX_DEC: MppCtxType = 0;
#[doc = "< encoder"]
pub const MppCtxType_MPP_CTX_ENC: MppCtxType = 1;
#[doc = "< isp"]
pub const MppCtxType_MPP_CTX_ISP: MppCtxType = 2;
#[doc = "< undefined"]
pub const MppCtxType_MPP_CTX_BUTT: MppCtxType = 3;
#[doc = " @ingroup rk_mpi\n @brief The type of mpp context\n @details This type is used when calling mpp_init(), which including decoder,\n          encoder and Image Signal Process(ISP). So far decoder and encoder\n          are supported perfectly, and ISP will be supported in the future."]
pub type MppCtxType = ::std::os::raw::c_uint;
#[doc = "< Value when coding is N/A"]
pub const MppCodingType_MPP_VIDEO_CodingUnused: MppCodingType = 0;
#[doc = "< Autodetection of coding type"]
pub const MppCodingType_MPP_VIDEO_CodingAutoDetect: MppCodingType = 1;
#[doc = "< AKA: H.262"]
pub const MppCodingType_MPP_VIDEO_CodingMPEG2: MppCodingType = 2;
#[doc = "< H.263"]
pub const MppCodingType_MPP_VIDEO_CodingH263: MppCodingType = 3;
#[doc = "< MPEG-4"]
pub const MppCodingType_MPP_VIDEO_CodingMPEG4: MppCodingType = 4;
#[doc = "< Windows Media Video (WMV1,WMV2,WMV3)"]
pub const MppCodingType_MPP_VIDEO_CodingWMV: MppCodingType = 5;
#[doc = "< all versions of Real Video"]
pub const MppCodingType_MPP_VIDEO_CodingRV: MppCodingType = 6;
#[doc = "< H.264/AVC"]
pub const MppCodingType_MPP_VIDEO_CodingAVC: MppCodingType = 7;
#[doc = "< Motion JPEG"]
pub const MppCodingType_MPP_VIDEO_CodingMJPEG: MppCodingType = 8;
#[doc = "< VP8"]
pub const MppCodingType_MPP_VIDEO_CodingVP8: MppCodingType = 9;
#[doc = "< VP9"]
pub const MppCodingType_MPP_VIDEO_CodingVP9: MppCodingType = 10;
#[doc = "< Windows Media Video (WMV1,WMV2,WMV3)"]
pub const MppCodingType_MPP_VIDEO_CodingVC1: MppCodingType = 16777216;
#[doc = "< Sorenson H.263"]
pub const MppCodingType_MPP_VIDEO_CodingFLV1: MppCodingType = 16777217;
#[doc = "< DIVX3"]
pub const MppCodingType_MPP_VIDEO_CodingDIVX3: MppCodingType = 16777218;
pub const MppCodingType_MPP_VIDEO_CodingVP6: MppCodingType = 16777219;
#[doc = "< H.265/HEVC"]
pub const MppCodingType_MPP_VIDEO_CodingHEVC: MppCodingType = 16777220;
#[doc = "< AVS+"]
pub const MppCodingType_MPP_VIDEO_CodingAVSPLUS: MppCodingType = 16777221;
#[doc = "< AVS profile=0x20"]
pub const MppCodingType_MPP_VIDEO_CodingAVS: MppCodingType = 16777222;
#[doc = "< AVS2"]
pub const MppCodingType_MPP_VIDEO_CodingAVS2: MppCodingType = 16777223;
#[doc = "< av1"]
pub const MppCodingType_MPP_VIDEO_CodingAV1: MppCodingType = 16777224;
#[doc = "< Reserved region for introducing Khronos Standard Extensions"]
pub const MppCodingType_MPP_VIDEO_CodingKhronosExtensions: MppCodingType = 1862270976;
#[doc = "< Reserved region for introducing Vendor Extensions"]
pub const MppCodingType_MPP_VIDEO_CodingVendorStartUnused: MppCodingType = 2130706432;
pub const MppCodingType_MPP_VIDEO_CodingMax: MppCodingType = 2147483647;
#[doc = " @ingroup rk_mpi\n @brief Enumeration used to define the possible video compression codings.\n        sync with the omx_video.h\n\n @note  This essentially refers to file extensions. If the coding is\n        being used to specify the ENCODE type, then additional work\n        must be done to configure the exact flavor of the compression\n        to be used.  For decode cases where the user application can\n        not differentiate between MPEG-4 and H.264 bit streams, it is\n        up to the codec to handle this."]
pub type MppCodingType = ::std::os::raw::c_uint;
pub type MppCtx = *mut ::std::os::raw::c_void;
pub type MppParam = *mut ::std::os::raw::c_void;
pub type MppFrame = *mut ::std::os::raw::c_void;
pub type MppPacket = *mut ::std::os::raw::c_void;
pub type MppBuffer = *mut ::std::os::raw::c_void;
pub type MppBufferGroup = *mut ::std::os::raw::c_void;
pub type MppTask = *mut ::std::os::raw::c_void;
pub type MppMeta = *mut ::std::os::raw::c_void;
pub type KmppObjDef = *mut ::std::os::raw::c_void;
pub type KmppObj = *mut ::std::os::raw::c_void;
pub type KmppMeta = *mut ::std::os::raw::c_void;
pub type KmppFrame = *mut ::std::os::raw::c_void;
pub type KmppPacket = *mut ::std::os::raw::c_void;
pub type KmppBuffer = *mut ::std::os::raw::c_void;
pub type KmppBufGrp = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct KmppShmPtr_t {
    pub __bindgen_anon_1: KmppShmPtr_t__bindgen_ty_1,
    pub __bindgen_anon_2: KmppShmPtr_t__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union KmppShmPtr_t__bindgen_ty_1 {
    pub uaddr: rk_u64,
    pub uptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KmppShmPtr_t__bindgen_ty_1"]
        [::std::mem::size_of::<KmppShmPtr_t__bindgen_ty_1>() - 8usize];
    ["Alignment of KmppShmPtr_t__bindgen_ty_1"]
        [::std::mem::align_of::<KmppShmPtr_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: KmppShmPtr_t__bindgen_ty_1::uaddr"]
        [::std::mem::offset_of!(KmppShmPtr_t__bindgen_ty_1, uaddr) - 0usize];
    ["Offset of field: KmppShmPtr_t__bindgen_ty_1::uptr"]
        [::std::mem::offset_of!(KmppShmPtr_t__bindgen_ty_1, uptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union KmppShmPtr_t__bindgen_ty_2 {
    pub kaddr: rk_u64,
    pub kptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KmppShmPtr_t__bindgen_ty_2"]
        [::std::mem::size_of::<KmppShmPtr_t__bindgen_ty_2>() - 8usize];
    ["Alignment of KmppShmPtr_t__bindgen_ty_2"]
        [::std::mem::align_of::<KmppShmPtr_t__bindgen_ty_2>() - 8usize];
    ["Offset of field: KmppShmPtr_t__bindgen_ty_2::kaddr"]
        [::std::mem::offset_of!(KmppShmPtr_t__bindgen_ty_2, kaddr) - 0usize];
    ["Offset of field: KmppShmPtr_t__bindgen_ty_2::kptr"]
        [::std::mem::offset_of!(KmppShmPtr_t__bindgen_ty_2, kptr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KmppShmPtr_t"][::std::mem::size_of::<KmppShmPtr_t>() - 16usize];
    ["Alignment of KmppShmPtr_t"][::std::mem::align_of::<KmppShmPtr_t>() - 8usize];
};
pub type KmppShmPtr = KmppShmPtr_t;
pub const MPP_RET_MPP_SUCCESS: MPP_RET = 0;
pub const MPP_RET_MPP_OK: MPP_RET = 0;
pub const MPP_RET_MPP_NOK: MPP_RET = -1;
pub const MPP_RET_MPP_ERR_UNKNOW: MPP_RET = -2;
pub const MPP_RET_MPP_ERR_NULL_PTR: MPP_RET = -3;
pub const MPP_RET_MPP_ERR_MALLOC: MPP_RET = -4;
pub const MPP_RET_MPP_ERR_OPEN_FILE: MPP_RET = -5;
pub const MPP_RET_MPP_ERR_VALUE: MPP_RET = -6;
pub const MPP_RET_MPP_ERR_READ_BIT: MPP_RET = -7;
pub const MPP_RET_MPP_ERR_TIMEOUT: MPP_RET = -8;
pub const MPP_RET_MPP_ERR_PERM: MPP_RET = -9;
pub const MPP_RET_MPP_ERR_BASE: MPP_RET = -1000;
pub const MPP_RET_MPP_ERR_LIST_STREAM: MPP_RET = -1001;
pub const MPP_RET_MPP_ERR_INIT: MPP_RET = -1002;
pub const MPP_RET_MPP_ERR_VPU_CODEC_INIT: MPP_RET = -1003;
pub const MPP_RET_MPP_ERR_STREAM: MPP_RET = -1004;
pub const MPP_RET_MPP_ERR_FATAL_THREAD: MPP_RET = -1005;
pub const MPP_RET_MPP_ERR_NOMEM: MPP_RET = -1006;
pub const MPP_RET_MPP_ERR_PROTOL: MPP_RET = -1007;
pub const MPP_RET_MPP_FAIL_SPLIT_FRAME: MPP_RET = -1008;
pub const MPP_RET_MPP_ERR_VPUHW: MPP_RET = -1009;
pub const MPP_RET_MPP_EOS_STREAM_REACHED: MPP_RET = -1011;
pub const MPP_RET_MPP_ERR_BUFFER_FULL: MPP_RET = -1012;
pub const MPP_RET_MPP_ERR_DISPLAY_FULL: MPP_RET = -1013;
pub type MPP_RET = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppDecQueryCfg_t {
    pub query_flag: RK_U32,
    pub rt_status: RK_U32,
    pub rt_wait: RK_U32,
    pub rt_fps: RK_U32,
    pub rt_bps: RK_U32,
    pub dec_in_pkt_cnt: RK_U32,
    pub dec_hw_run_cnt: RK_U32,
    pub dec_out_frm_cnt: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppDecQueryCfg_t"][::std::mem::size_of::<MppDecQueryCfg_t>() - 32usize];
    ["Alignment of MppDecQueryCfg_t"][::std::mem::align_of::<MppDecQueryCfg_t>() - 4usize];
    ["Offset of field: MppDecQueryCfg_t::query_flag"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, query_flag) - 0usize];
    ["Offset of field: MppDecQueryCfg_t::rt_status"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, rt_status) - 4usize];
    ["Offset of field: MppDecQueryCfg_t::rt_wait"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, rt_wait) - 8usize];
    ["Offset of field: MppDecQueryCfg_t::rt_fps"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, rt_fps) - 12usize];
    ["Offset of field: MppDecQueryCfg_t::rt_bps"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, rt_bps) - 16usize];
    ["Offset of field: MppDecQueryCfg_t::dec_in_pkt_cnt"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, dec_in_pkt_cnt) - 20usize];
    ["Offset of field: MppDecQueryCfg_t::dec_hw_run_cnt"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, dec_hw_run_cnt) - 24usize];
    ["Offset of field: MppDecQueryCfg_t::dec_out_frm_cnt"]
        [::std::mem::offset_of!(MppDecQueryCfg_t, dec_out_frm_cnt) - 28usize];
};
pub type MppDecQueryCfg = MppDecQueryCfg_t;
pub type MppExtCbCtx = *mut ::std::os::raw::c_void;
pub type MppExtCbFunc = ::std::option::Option<
    unsafe extern "C" fn(
        cb_ctx: MppExtCbCtx,
        mpp: MppCtx,
        cmd: RK_S32,
        arg: *mut ::std::os::raw::c_void,
    ) -> MPP_RET,
>;
pub type MppDecCfg = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn mpp_dec_cfg_init(cfg: *mut MppDecCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_deinit(cfg: MppDecCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_set_s32(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_set_u32(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_U32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_set_s64(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_S64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_set_u64(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_U64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_set_ptr(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_get_s32(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_get_u32(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_U32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_get_s64(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_S64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_get_u64(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_U64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_get_ptr(
        cfg: MppDecCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_dec_cfg_show();
}
pub const MppBufferMode_MPP_BUFFER_INTERNAL: MppBufferMode = 0;
pub const MppBufferMode_MPP_BUFFER_EXTERNAL: MppBufferMode = 1;
pub const MppBufferMode_MPP_BUFFER_MODE_BUTT: MppBufferMode = 2;
pub type MppBufferMode = ::std::os::raw::c_uint;
pub const MppBufferType_MPP_BUFFER_TYPE_NORMAL: MppBufferType = 0;
pub const MppBufferType_MPP_BUFFER_TYPE_ION: MppBufferType = 1;
pub const MppBufferType_MPP_BUFFER_TYPE_EXT_DMA: MppBufferType = 2;
pub const MppBufferType_MPP_BUFFER_TYPE_DRM: MppBufferType = 3;
pub const MppBufferType_MPP_BUFFER_TYPE_DMA_HEAP: MppBufferType = 4;
pub const MppBufferType_MPP_BUFFER_TYPE_BUTT: MppBufferType = 5;
pub type MppBufferType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppBufferInfo_t {
    pub type_: MppBufferType,
    pub size: usize,
    pub ptr: *mut ::std::os::raw::c_void,
    pub hnd: *mut ::std::os::raw::c_void,
    pub fd: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppBufferInfo_t"][::std::mem::size_of::<MppBufferInfo_t>() - 40usize];
    ["Alignment of MppBufferInfo_t"][::std::mem::align_of::<MppBufferInfo_t>() - 8usize];
    ["Offset of field: MppBufferInfo_t::type_"]
        [::std::mem::offset_of!(MppBufferInfo_t, type_) - 0usize];
    ["Offset of field: MppBufferInfo_t::size"]
        [::std::mem::offset_of!(MppBufferInfo_t, size) - 8usize];
    ["Offset of field: MppBufferInfo_t::ptr"]
        [::std::mem::offset_of!(MppBufferInfo_t, ptr) - 16usize];
    ["Offset of field: MppBufferInfo_t::hnd"]
        [::std::mem::offset_of!(MppBufferInfo_t, hnd) - 24usize];
    ["Offset of field: MppBufferInfo_t::fd"][::std::mem::offset_of!(MppBufferInfo_t, fd) - 32usize];
    ["Offset of field: MppBufferInfo_t::index"]
        [::std::mem::offset_of!(MppBufferInfo_t, index) - 36usize];
};
pub type MppBufferInfo = MppBufferInfo_t;
unsafe extern "C" {
    pub fn mpp_buffer_import_with_tag(
        group: MppBufferGroup,
        info: *mut MppBufferInfo,
        buffer: *mut MppBuffer,
        tag: *const ::std::os::raw::c_char,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_get_with_tag(
        group: MppBufferGroup,
        buffer: *mut MppBuffer,
        size: usize,
        tag: *const ::std::os::raw::c_char,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_put_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_inc_ref_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_discard_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_info_get_with_caller(
        buffer: MppBuffer,
        info: *mut MppBufferInfo,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_read_with_caller(
        buffer: MppBuffer,
        offset: usize,
        data: *mut ::std::os::raw::c_void,
        size: usize,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_write_with_caller(
        buffer: MppBuffer,
        offset: usize,
        data: *mut ::std::os::raw::c_void,
        size: usize,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_get_ptr_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mpp_buffer_get_fd_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mpp_buffer_get_size_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mpp_buffer_get_index_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mpp_buffer_set_index_with_caller(
        buffer: MppBuffer,
        index: ::std::os::raw::c_int,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_get_offset_with_caller(
        buffer: MppBuffer,
        caller: *const ::std::os::raw::c_char,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mpp_buffer_set_offset_with_caller(
        buffer: MppBuffer,
        offset: usize,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    #[doc = " @brief MppBuffer cache operation function\n @param buffer The MppBuffer to run the cache operation\n @param ro for readonly option\n @param offset partial sync data start offset\n @param length partial sync data length"]
    pub fn mpp_buffer_sync_begin_f(
        buffer: MppBuffer,
        ro: RK_S32,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_sync_end_f(
        buffer: MppBuffer,
        ro: RK_S32,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_sync_partial_begin_f(
        buffer: MppBuffer,
        ro: RK_S32,
        offset: RK_U32,
        length: RK_U32,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_sync_partial_end_f(
        buffer: MppBuffer,
        ro: RK_S32,
        offset: RK_U32,
        length: RK_U32,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_get(
        group: *mut MppBufferGroup,
        type_: MppBufferType,
        mode: MppBufferMode,
        tag: *const ::std::os::raw::c_char,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_put(group: MppBufferGroup) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_clear(group: MppBufferGroup) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_unused(group: MppBufferGroup) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_usage(group: MppBufferGroup) -> usize;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_mode(group: MppBufferGroup) -> MppBufferMode;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_type(group: MppBufferGroup) -> MppBufferType;
}
unsafe extern "C" {
    pub fn mpp_buffer_group_limit_config(
        group: MppBufferGroup,
        size: usize,
        count: RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_buffer_total_now() -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_buffer_total_max() -> RK_U32;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const MppMetaKey_e_KEY_INPUT_FRAME: MppMetaKey_e = 1768321645;
pub const MppMetaKey_e_KEY_INPUT_PACKET: MppMetaKey_e = 1768975220;
pub const MppMetaKey_e_KEY_OUTPUT_FRAME: MppMetaKey_e = 1868984941;
pub const MppMetaKey_e_KEY_OUTPUT_PACKET: MppMetaKey_e = 1869638516;
pub const MppMetaKey_e_KEY_MOTION_INFO: MppMetaKey_e = 1836476774;
pub const MppMetaKey_e_KEY_HDR_INFO: MppMetaKey_e = 1751413280;
pub const MppMetaKey_e_KEY_HDR_META_OFFSET: MppMetaKey_e = 1751413359;
pub const MppMetaKey_e_KEY_HDR_META_SIZE: MppMetaKey_e = 1751413356;
pub const MppMetaKey_e_KEY_INPUT_BLOCK: MppMetaKey_e = 1768057963;
pub const MppMetaKey_e_KEY_OUTPUT_BLOCK: MppMetaKey_e = 1868721259;
pub const MppMetaKey_e_KEY_INPUT_IDR_REQ: MppMetaKey_e = 1768514674;
pub const MppMetaKey_e_KEY_OUTPUT_INTRA: MppMetaKey_e = 1869177970;
pub const MppMetaKey_e_KEY_TEMPORAL_ID: MppMetaKey_e = 1953261924;
pub const MppMetaKey_e_KEY_LONG_REF_IDX: MppMetaKey_e = 1819568484;
pub const MppMetaKey_e_KEY_ENC_AVERAGE_QP: MppMetaKey_e = 1635149681;
pub const MppMetaKey_e_KEY_ENC_START_QP: MppMetaKey_e = 1937011313;
pub const MppMetaKey_e_KEY_ENC_BPS_RT: MppMetaKey_e = 1920230002;
pub const MppMetaKey_e_KEY_ROI_DATA: MppMetaKey_e = 1919904032;
pub const MppMetaKey_e_KEY_OSD_DATA: MppMetaKey_e = 1869833248;
pub const MppMetaKey_e_KEY_OSD_DATA2: MppMetaKey_e = 1869833266;
pub const MppMetaKey_e_KEY_OSD_DATA3: MppMetaKey_e = 1869833267;
pub const MppMetaKey_e_KEY_USER_DATA: MppMetaKey_e = 1970500196;
pub const MppMetaKey_e_KEY_USER_DATAS: MppMetaKey_e = 1970431091;
pub const MppMetaKey_e_KEY_LVL64_INTER_NUM: MppMetaKey_e = 1815491696;
pub const MppMetaKey_e_KEY_LVL32_INTER_NUM: MppMetaKey_e = 1815294576;
pub const MppMetaKey_e_KEY_LVL16_INTER_NUM: MppMetaKey_e = 1815164528;
pub const MppMetaKey_e_KEY_LVL8_INTER_NUM: MppMetaKey_e = 1815638048;
pub const MppMetaKey_e_KEY_LVL32_INTRA_NUM: MppMetaKey_e = 1815294569;
pub const MppMetaKey_e_KEY_LVL16_INTRA_NUM: MppMetaKey_e = 1815164521;
pub const MppMetaKey_e_KEY_LVL8_INTRA_NUM: MppMetaKey_e = 1815636256;
pub const MppMetaKey_e_KEY_LVL4_INTRA_NUM: MppMetaKey_e = 1815374112;
pub const MppMetaKey_e_KEY_OUTPUT_PSKIP: MppMetaKey_e = 1869640560;
pub const MppMetaKey_e_KEY_INPUT_PSKIP: MppMetaKey_e = 1768977264;
pub const MppMetaKey_e_KEY_INPUT_PSKIP_NON_REF: MppMetaKey_e = 1768975986;
pub const MppMetaKey_e_KEY_ENC_SSE: MppMetaKey_e = 1702064997;
pub const MppMetaKey_e_KEY_ROI_DATA2: MppMetaKey_e = 1919904050;
pub const MppMetaKey_e_KEY_QPMAP0: MppMetaKey_e = 1701932336;
pub const MppMetaKey_e_KEY_NPU_OBJ_FLAG: MppMetaKey_e = 1852863846;
pub const MppMetaKey_e_KEY_ENC_MARK_LTR: MppMetaKey_e = 1835824242;
pub const MppMetaKey_e_KEY_ENC_USE_LTR: MppMetaKey_e = 1970041970;
pub const MppMetaKey_e_KEY_ENC_FRAME_QP: MppMetaKey_e = 1718775153;
pub const MppMetaKey_e_KEY_ENC_BASE_LAYER_PID: MppMetaKey_e = 1651534180;
pub const MppMetaKey_e_KEY_DEC_TBN_EN: MppMetaKey_e = 1952605550;
pub const MppMetaKey_e_KEY_DEC_TBN_Y_OFFSET: MppMetaKey_e = 1952610671;
pub const MppMetaKey_e_KEY_DEC_TBN_UV_OFFSET: MppMetaKey_e = 1952605039;
pub const MppMetaKey_e_KEY_COMBO_FRAME: MppMetaKey_e = 1667658349;
pub const MppMetaKey_e_KEY_CHANNEL_ID: MppMetaKey_e = 1667785070;
pub const MppMetaKey_e_KEY_PP_MD_BUF: MppMetaKey_e = 1835295334;
pub const MppMetaKey_e_KEY_PP_OD_BUF: MppMetaKey_e = 1868849766;
pub const MppMetaKey_e_KEY_PP_OUT: MppMetaKey_e = 1869639712;
pub type MppMetaKey_e = ::std::os::raw::c_uint;
pub use self::MppMetaKey_e as MppMetaKey;
unsafe extern "C" {
    pub fn mpp_packet_new(packet: *mut MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_init(
        packet: *mut MppPacket,
        data: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_init_with_buffer(packet: *mut MppPacket, buffer: MppBuffer) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_copy_init(packet: *mut MppPacket, src: MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_deinit(packet: *mut MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_set_data(packet: MppPacket, data: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn mpp_packet_set_size(packet: MppPacket, size: usize);
}
unsafe extern "C" {
    pub fn mpp_packet_set_pos(packet: MppPacket, pos: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn mpp_packet_set_length(packet: MppPacket, size: usize);
}
unsafe extern "C" {
    pub fn mpp_packet_get_data(packet: MppPacket) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mpp_packet_get_pos(packet: MppPacket) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mpp_packet_get_size(packet: MppPacket) -> usize;
}
unsafe extern "C" {
    pub fn mpp_packet_get_length(packet: MppPacket) -> usize;
}
unsafe extern "C" {
    pub fn mpp_packet_set_pts(packet: MppPacket, pts: RK_S64);
}
unsafe extern "C" {
    pub fn mpp_packet_get_pts(packet: MppPacket) -> RK_S64;
}
unsafe extern "C" {
    pub fn mpp_packet_set_dts(packet: MppPacket, dts: RK_S64);
}
unsafe extern "C" {
    pub fn mpp_packet_get_dts(packet: MppPacket) -> RK_S64;
}
unsafe extern "C" {
    pub fn mpp_packet_set_flag(packet: MppPacket, flag: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_packet_get_flag(packet: MppPacket) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_packet_set_eos(packet: MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_clr_eos(packet: MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_get_eos(packet: MppPacket) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_packet_set_extra_data(packet: MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_set_buffer(packet: MppPacket, buffer: MppBuffer);
}
unsafe extern "C" {
    pub fn mpp_packet_get_buffer(packet: MppPacket) -> MppBuffer;
}
unsafe extern "C" {
    pub fn mpp_packet_read(
        packet: MppPacket,
        offset: usize,
        data: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_write(
        packet: MppPacket,
        offset: usize,
        data: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_packet_has_meta(packet: MppPacket) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_packet_get_meta(packet: MppPacket) -> MppMeta;
}
unsafe extern "C" {
    pub fn mpp_packet_is_partition(packet: MppPacket) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_packet_is_soi(packet: MppPacket) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_packet_is_eoi(packet: MppPacket) -> RK_U32;
}
pub type MppPktSeg = MppPktSeg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppPktSeg_t {
    pub index: RK_S32,
    pub type_: RK_S32,
    pub offset: RK_U32,
    pub len: RK_U32,
    pub next: *const MppPktSeg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppPktSeg_t"][::std::mem::size_of::<MppPktSeg_t>() - 24usize];
    ["Alignment of MppPktSeg_t"][::std::mem::align_of::<MppPktSeg_t>() - 8usize];
    ["Offset of field: MppPktSeg_t::index"][::std::mem::offset_of!(MppPktSeg_t, index) - 0usize];
    ["Offset of field: MppPktSeg_t::type_"][::std::mem::offset_of!(MppPktSeg_t, type_) - 4usize];
    ["Offset of field: MppPktSeg_t::offset"][::std::mem::offset_of!(MppPktSeg_t, offset) - 8usize];
    ["Offset of field: MppPktSeg_t::len"][::std::mem::offset_of!(MppPktSeg_t, len) - 12usize];
    ["Offset of field: MppPktSeg_t::next"][::std::mem::offset_of!(MppPktSeg_t, next) - 16usize];
};
unsafe extern "C" {
    pub fn mpp_packet_get_segment_nb(packet: MppPacket) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_packet_get_segment_info(packet: MppPacket) -> *const MppPktSeg;
}
unsafe extern "C" {
    pub fn mpp_meta_get_with_tag(
        meta: *mut MppMeta,
        tag: *const ::std::os::raw::c_char,
        caller: *const ::std::os::raw::c_char,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_put(meta: MppMeta) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_size(meta: MppMeta) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_meta_set_s32(meta: MppMeta, key: MppMetaKey, val: RK_S32) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_set_s64(meta: MppMeta, key: MppMetaKey, val: RK_S64) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_set_ptr(
        meta: MppMeta,
        key: MppMetaKey,
        val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_s32(meta: MppMeta, key: MppMetaKey, val: *mut RK_S32) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_s64(meta: MppMeta, key: MppMetaKey, val: *mut RK_S64) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_ptr(
        meta: MppMeta,
        key: MppMetaKey,
        val: *mut *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_set_frame(meta: MppMeta, key: MppMetaKey, frame: MppFrame) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_set_packet(meta: MppMeta, key: MppMetaKey, packet: MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_set_buffer(meta: MppMeta, key: MppMetaKey, buffer: MppBuffer) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_frame(meta: MppMeta, key: MppMetaKey, frame: *mut MppFrame) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_packet(meta: MppMeta, key: MppMetaKey, packet: *mut MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_buffer(meta: MppMeta, key: MppMetaKey, buffer: *mut MppBuffer) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_s32_d(
        meta: MppMeta,
        key: MppMetaKey,
        val: *mut RK_S32,
        def: RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_s64_d(
        meta: MppMeta,
        key: MppMetaKey,
        val: *mut RK_S64,
        def: RK_S64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_ptr_d(
        meta: MppMeta,
        key: MppMetaKey,
        val: *mut *mut ::std::os::raw::c_void,
        def: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_frame_d(
        meta: MppMeta,
        key: MppMetaKey,
        frame: *mut MppFrame,
        def: MppFrame,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_packet_d(
        meta: MppMeta,
        key: MppMetaKey,
        packet: *mut MppPacket,
        def: MppPacket,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_meta_get_buffer_d(
        meta: MppMeta,
        key: MppMetaKey,
        buffer: *mut MppBuffer,
        def: MppBuffer,
    ) -> MPP_RET;
}
pub const MppFrameColorRange_MPP_FRAME_RANGE_UNSPECIFIED: MppFrameColorRange = 0;
#[doc = "< the normal 219*2^(n-8) \"MPEG\" YUV ranges"]
pub const MppFrameColorRange_MPP_FRAME_RANGE_MPEG: MppFrameColorRange = 1;
#[doc = "< the normal     2^n-1   \"JPEG\" YUV ranges"]
pub const MppFrameColorRange_MPP_FRAME_RANGE_JPEG: MppFrameColorRange = 2;
#[doc = "< Not part of ABI"]
pub const MppFrameColorRange_MPP_FRAME_RANGE_NB: MppFrameColorRange = 3;
pub type MppFrameColorRange = ::std::os::raw::c_uint;
pub const MppFrameChromaDownSampleMode_MPP_FRAME_CHROMA_DOWN_SAMPLE_MODE_NONE:
    MppFrameChromaDownSampleMode = 0;
pub const MppFrameChromaDownSampleMode_MPP_FRAME_CHORMA_DOWN_SAMPLE_MODE_AVERAGE:
    MppFrameChromaDownSampleMode = 1;
pub const MppFrameChromaDownSampleMode_MPP_FRAME_CHORMA_DOWN_SAMPLE_MODE_DISCARD:
    MppFrameChromaDownSampleMode = 2;
pub type MppFrameChromaDownSampleMode = ::std::os::raw::c_uint;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_COMPONEMT: MppFrameVideoFormat = 0;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_PAL: MppFrameVideoFormat = 1;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_NTSC: MppFrameVideoFormat = 2;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_SECAM: MppFrameVideoFormat = 3;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_MAC: MppFrameVideoFormat = 4;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_UNSPECIFIED: MppFrameVideoFormat = 5;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_RESERVED0: MppFrameVideoFormat = 6;
pub const MppFrameVideoFormat_MPP_FRAME_VIDEO_FMT_RESERVED1: MppFrameVideoFormat = 7;
pub type MppFrameVideoFormat = ::std::os::raw::c_uint;
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_RESERVED0: MppFrameColorPrimaries = 0;
#[doc = "< also ITU-R BT1361 / IEC 61966-2-4 / SMPTE RP177 Annex B"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_BT709: MppFrameColorPrimaries = 1;
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_UNSPECIFIED: MppFrameColorPrimaries = 2;
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_RESERVED: MppFrameColorPrimaries = 3;
#[doc = "< also FCC Title 47 Code of Federal Regulations 73.682 (a)(20)"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_BT470M: MppFrameColorPrimaries = 4;
#[doc = "< also ITU-R BT601-6 625 / ITU-R BT1358 625 / ITU-R BT1700 625 PAL & SECAM"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_BT470BG: MppFrameColorPrimaries = 5;
#[doc = "< also ITU-R BT601-6 525 / ITU-R BT1358 525 / ITU-R BT1700 NTSC/SMPTE ST 170 (2004)"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_SMPTE170M: MppFrameColorPrimaries = 6;
#[doc = "< functionally identical to above/SMPTE ST 240"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_SMPTE240M: MppFrameColorPrimaries = 7;
#[doc = "< colour filters using Illuminant C"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_FILM: MppFrameColorPrimaries = 8;
#[doc = "< ITU-R BT2020 / ITU-R BT.2100-2"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_BT2020: MppFrameColorPrimaries = 9;
#[doc = "< SMPTE ST 428-1 (CIE 1931 XYZ)"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_SMPTEST428_1: MppFrameColorPrimaries = 10;
#[doc = "< SMPTE ST 431-2 (2011) / DCI P3"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_SMPTE431: MppFrameColorPrimaries = 11;
#[doc = "< SMPTE ST 432-1 (2010) / P3 D65 / Display P3"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_SMPTE432: MppFrameColorPrimaries = 12;
#[doc = "< JEDEC P22 phosphors"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_JEDEC_P22: MppFrameColorPrimaries = 22;
#[doc = "< Not part of ABI"]
pub const MppFrameColorPrimaries_MPP_FRAME_PRI_NB: MppFrameColorPrimaries = 23;
pub type MppFrameColorPrimaries = ::std::os::raw::c_uint;
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_RESERVED0:
    MppFrameColorTransferCharacteristic = 0;
#[doc = "< also ITU-R BT1361"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_BT709:
    MppFrameColorTransferCharacteristic = 1;
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_UNSPECIFIED:
    MppFrameColorTransferCharacteristic = 2;
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_RESERVED:
    MppFrameColorTransferCharacteristic = 3;
#[doc = "< also ITU-R BT470M / ITU-R BT1700 625 PAL & SECAM"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_GAMMA22:
    MppFrameColorTransferCharacteristic = 4;
#[doc = "< also ITU-R BT470BG"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_GAMMA28:
    MppFrameColorTransferCharacteristic = 5;
#[doc = "< also ITU-R BT601-6 525 or 625 / ITU-R BT1358 525 or 625 / ITU-R BT1700 NTSC"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_SMPTE170M:
    MppFrameColorTransferCharacteristic = 6;
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_SMPTE240M:
    MppFrameColorTransferCharacteristic = 7;
#[doc = "< \"Linear transfer characteristics\""]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_LINEAR:
    MppFrameColorTransferCharacteristic = 8;
#[doc = "< \"Logarithmic transfer characteristic (100:1 range)\""]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_LOG:
    MppFrameColorTransferCharacteristic = 9;
#[doc = "< \"Logarithmic transfer characteristic (100 * Sqrt(10) : 1 range)\""]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_LOG_SQRT:
    MppFrameColorTransferCharacteristic = 10;
#[doc = "< IEC 61966-2-4"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_IEC61966_2_4:
    MppFrameColorTransferCharacteristic = 11;
#[doc = "< ITU-R BT1361 Extended Colour Gamut"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_BT1361_ECG:
    MppFrameColorTransferCharacteristic = 12;
#[doc = "< IEC 61966-2-1 (sRGB or sYCC)"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_IEC61966_2_1:
    MppFrameColorTransferCharacteristic = 13;
#[doc = "< ITU-R BT2020 for 10 bit system"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_BT2020_10:
    MppFrameColorTransferCharacteristic = 14;
#[doc = "< ITU-R BT2020 for 12 bit system"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_BT2020_12:
    MppFrameColorTransferCharacteristic = 15;
#[doc = "< SMPTE ST 2084 for 10-, 12-, 14- and 16-bit systems"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_SMPTEST2084:
    MppFrameColorTransferCharacteristic = 16;
#[doc = "< SMPTE ST 428-1"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_SMPTEST428_1:
    MppFrameColorTransferCharacteristic = 17;
#[doc = "< ARIB STD-B67, known as \"Hybrid log-gamma\""]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_ARIB_STD_B67:
    MppFrameColorTransferCharacteristic = 18;
#[doc = "< Not part of ABI"]
pub const MppFrameColorTransferCharacteristic_MPP_FRAME_TRC_NB:
    MppFrameColorTransferCharacteristic = 19;
pub type MppFrameColorTransferCharacteristic = ::std::os::raw::c_uint;
#[doc = "< order of coefficients is actually GBR, also IEC 61966-2-1 (sRGB)"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_RGB: MppFrameColorSpace = 0;
#[doc = "< also ITU-R BT1361 / IEC 61966-2-4 xvYCC709 / SMPTE RP177 Annex B"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_BT709: MppFrameColorSpace = 1;
pub const MppFrameColorSpace_MPP_FRAME_SPC_UNSPECIFIED: MppFrameColorSpace = 2;
pub const MppFrameColorSpace_MPP_FRAME_SPC_RESERVED: MppFrameColorSpace = 3;
#[doc = "< FCC Title 47 Code of Federal Regulations 73.682 (a)(20)"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_FCC: MppFrameColorSpace = 4;
#[doc = "< also ITU-R BT601-6 625 / ITU-R BT1358 625 / ITU-R BT1700 625 PAL & SECAM / IEC 61966-2-4 xvYCC601"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_BT470BG: MppFrameColorSpace = 5;
#[doc = "< also ITU-R BT601-6 525 / ITU-R BT1358 525 / ITU-R BT1700 NTSC / functionally identical to above"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_SMPTE170M: MppFrameColorSpace = 6;
pub const MppFrameColorSpace_MPP_FRAME_SPC_SMPTE240M: MppFrameColorSpace = 7;
#[doc = "< Used by Dirac / VC-2 and H.264 FRext, see ITU-T SG16"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_YCOCG: MppFrameColorSpace = 8;
#[doc = "< ITU-R BT2020 non-constant luminance system"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_BT2020_NCL: MppFrameColorSpace = 9;
#[doc = "< ITU-R BT2020 constant luminance system"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_BT2020_CL: MppFrameColorSpace = 10;
#[doc = "< SMPTE 2085, Y'D'zD'x"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_SMPTE2085: MppFrameColorSpace = 11;
#[doc = "< Chromaticity-derived non-constant luminance system"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_CHROMA_DERIVED_NCL: MppFrameColorSpace = 12;
#[doc = "< Chromaticity-derived constant luminance system"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_CHROMA_DERIVED_CL: MppFrameColorSpace = 13;
#[doc = "< ITU-R BT.2100-0, ICtCp"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_ICTCP: MppFrameColorSpace = 14;
#[doc = "< Not part of ABI"]
pub const MppFrameColorSpace_MPP_FRAME_SPC_NB: MppFrameColorSpace = 15;
pub type MppFrameColorSpace = ::std::os::raw::c_uint;
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_UNSPECIFIED: MppFrameChromaLocation = 0;
#[doc = "< mpeg2/4 4:2:0, h264 default for 4:2:0"]
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_LEFT: MppFrameChromaLocation = 1;
#[doc = "< mpeg1 4:2:0, jpeg 4:2:0, h263 4:2:0"]
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_CENTER: MppFrameChromaLocation = 2;
#[doc = "< ITU-R 601, SMPTE 274M 296M S314M(DV 4:1:1), mpeg2 4:2:2"]
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_TOPLEFT: MppFrameChromaLocation = 3;
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_TOP: MppFrameChromaLocation = 4;
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_BOTTOMLEFT: MppFrameChromaLocation = 5;
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_BOTTOM: MppFrameChromaLocation = 6;
#[doc = "< Not part of ABI"]
pub const MppFrameChromaLocation_MPP_CHROMA_LOC_NB: MppFrameChromaLocation = 7;
pub type MppFrameChromaLocation = ::std::os::raw::c_uint;
pub const MppFrameChromaFormat_MPP_CHROMA_UNSPECIFIED: MppFrameChromaFormat = 0;
pub const MppFrameChromaFormat_MPP_CHROMA_400: MppFrameChromaFormat = 1;
pub const MppFrameChromaFormat_MPP_CHROMA_410: MppFrameChromaFormat = 2;
pub const MppFrameChromaFormat_MPP_CHROMA_411: MppFrameChromaFormat = 3;
pub const MppFrameChromaFormat_MPP_CHROMA_420: MppFrameChromaFormat = 4;
pub const MppFrameChromaFormat_MPP_CHROMA_422: MppFrameChromaFormat = 5;
pub const MppFrameChromaFormat_MPP_CHROMA_440: MppFrameChromaFormat = 6;
pub const MppFrameChromaFormat_MPP_CHROMA_444: MppFrameChromaFormat = 7;
pub type MppFrameChromaFormat = ::std::os::raw::c_uint;
pub const MppFrameFormat_MPP_FMT_YUV420SP: MppFrameFormat = 0;
pub const MppFrameFormat_MPP_FMT_YUV420SP_10BIT: MppFrameFormat = 1;
pub const MppFrameFormat_MPP_FMT_YUV422SP: MppFrameFormat = 2;
#[doc = "< Not part of ABI"]
pub const MppFrameFormat_MPP_FMT_YUV422SP_10BIT: MppFrameFormat = 3;
pub const MppFrameFormat_MPP_FMT_YUV420P: MppFrameFormat = 4;
pub const MppFrameFormat_MPP_FMT_YUV420SP_VU: MppFrameFormat = 5;
pub const MppFrameFormat_MPP_FMT_YUV422P: MppFrameFormat = 6;
pub const MppFrameFormat_MPP_FMT_YUV422SP_VU: MppFrameFormat = 7;
pub const MppFrameFormat_MPP_FMT_YUV422_YUYV: MppFrameFormat = 8;
pub const MppFrameFormat_MPP_FMT_YUV422_YVYU: MppFrameFormat = 9;
pub const MppFrameFormat_MPP_FMT_YUV422_UYVY: MppFrameFormat = 10;
pub const MppFrameFormat_MPP_FMT_YUV422_VYUY: MppFrameFormat = 11;
pub const MppFrameFormat_MPP_FMT_YUV400: MppFrameFormat = 12;
pub const MppFrameFormat_MPP_FMT_YUV440SP: MppFrameFormat = 13;
pub const MppFrameFormat_MPP_FMT_YUV411SP: MppFrameFormat = 14;
pub const MppFrameFormat_MPP_FMT_YUV444SP: MppFrameFormat = 15;
pub const MppFrameFormat_MPP_FMT_YUV444P: MppFrameFormat = 16;
pub const MppFrameFormat_MPP_FMT_YUV444SP_10BIT: MppFrameFormat = 17;
pub const MppFrameFormat_MPP_FMT_AYUV2BPP: MppFrameFormat = 18;
pub const MppFrameFormat_MPP_FMT_AYUV1BPP: MppFrameFormat = 19;
pub const MppFrameFormat_MPP_FMT_YUV_BUTT: MppFrameFormat = 20;
pub const MppFrameFormat_MPP_FMT_RGB565: MppFrameFormat = 65536;
pub const MppFrameFormat_MPP_FMT_BGR565: MppFrameFormat = 65537;
pub const MppFrameFormat_MPP_FMT_RGB555: MppFrameFormat = 65538;
pub const MppFrameFormat_MPP_FMT_BGR555: MppFrameFormat = 65539;
pub const MppFrameFormat_MPP_FMT_RGB444: MppFrameFormat = 65540;
pub const MppFrameFormat_MPP_FMT_BGR444: MppFrameFormat = 65541;
pub const MppFrameFormat_MPP_FMT_RGB888: MppFrameFormat = 65542;
pub const MppFrameFormat_MPP_FMT_BGR888: MppFrameFormat = 65543;
pub const MppFrameFormat_MPP_FMT_RGB101010: MppFrameFormat = 65544;
pub const MppFrameFormat_MPP_FMT_BGR101010: MppFrameFormat = 65545;
pub const MppFrameFormat_MPP_FMT_ARGB8888: MppFrameFormat = 65546;
pub const MppFrameFormat_MPP_FMT_ABGR8888: MppFrameFormat = 65547;
pub const MppFrameFormat_MPP_FMT_BGRA8888: MppFrameFormat = 65548;
pub const MppFrameFormat_MPP_FMT_RGBA8888: MppFrameFormat = 65549;
pub const MppFrameFormat_MPP_FMT_ARGB4444: MppFrameFormat = 65550;
pub const MppFrameFormat_MPP_FMT_ARGB1555: MppFrameFormat = 65551;
pub const MppFrameFormat_MPP_FMT_RGB_BUTT: MppFrameFormat = 65552;
pub const MppFrameFormat_MPP_FMT_BUTT: MppFrameFormat = 65553;
pub type MppFrameFormat = ::std::os::raw::c_uint;
#[doc = " Rational number (pair of numerator and denominator)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppFrameRational {
    #[doc = "< Numerator"]
    pub num: RK_S32,
    #[doc = "< Denominator"]
    pub den: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppFrameRational"][::std::mem::size_of::<MppFrameRational>() - 8usize];
    ["Alignment of MppFrameRational"][::std::mem::align_of::<MppFrameRational>() - 4usize];
    ["Offset of field: MppFrameRational::num"]
        [::std::mem::offset_of!(MppFrameRational, num) - 0usize];
    ["Offset of field: MppFrameRational::den"]
        [::std::mem::offset_of!(MppFrameRational, den) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppFrameMasteringDisplayMetadata {
    pub display_primaries: [[RK_U16; 2usize]; 3usize],
    pub white_point: [RK_U16; 2usize],
    pub max_luminance: RK_U32,
    pub min_luminance: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppFrameMasteringDisplayMetadata"]
        [::std::mem::size_of::<MppFrameMasteringDisplayMetadata>() - 24usize];
    ["Alignment of MppFrameMasteringDisplayMetadata"]
        [::std::mem::align_of::<MppFrameMasteringDisplayMetadata>() - 4usize];
    ["Offset of field: MppFrameMasteringDisplayMetadata::display_primaries"]
        [::std::mem::offset_of!(MppFrameMasteringDisplayMetadata, display_primaries) - 0usize];
    ["Offset of field: MppFrameMasteringDisplayMetadata::white_point"]
        [::std::mem::offset_of!(MppFrameMasteringDisplayMetadata, white_point) - 12usize];
    ["Offset of field: MppFrameMasteringDisplayMetadata::max_luminance"]
        [::std::mem::offset_of!(MppFrameMasteringDisplayMetadata, max_luminance) - 16usize];
    ["Offset of field: MppFrameMasteringDisplayMetadata::min_luminance"]
        [::std::mem::offset_of!(MppFrameMasteringDisplayMetadata, min_luminance) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppFrameContentLightMetadata {
    pub MaxCLL: RK_U16,
    pub MaxFALL: RK_U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppFrameContentLightMetadata"]
        [::std::mem::size_of::<MppFrameContentLightMetadata>() - 4usize];
    ["Alignment of MppFrameContentLightMetadata"]
        [::std::mem::align_of::<MppFrameContentLightMetadata>() - 2usize];
    ["Offset of field: MppFrameContentLightMetadata::MaxCLL"]
        [::std::mem::offset_of!(MppFrameContentLightMetadata, MaxCLL) - 0usize];
    ["Offset of field: MppFrameContentLightMetadata::MaxFALL"]
        [::std::mem::offset_of!(MppFrameContentLightMetadata, MaxFALL) - 2usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct MppFrameHdrDynamicMeta {
    pub hdr_fmt: RK_U32,
    pub size: RK_U32,
    pub data: __IncompleteArrayField<RK_U8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppFrameHdrDynamicMeta"][::std::mem::size_of::<MppFrameHdrDynamicMeta>() - 8usize];
    ["Alignment of MppFrameHdrDynamicMeta"]
        [::std::mem::align_of::<MppFrameHdrDynamicMeta>() - 4usize];
    ["Offset of field: MppFrameHdrDynamicMeta::hdr_fmt"]
        [::std::mem::offset_of!(MppFrameHdrDynamicMeta, hdr_fmt) - 0usize];
    ["Offset of field: MppFrameHdrDynamicMeta::size"]
        [::std::mem::offset_of!(MppFrameHdrDynamicMeta, size) - 4usize];
    ["Offset of field: MppFrameHdrDynamicMeta::data"]
        [::std::mem::offset_of!(MppFrameHdrDynamicMeta, data) - 8usize];
};
pub const MppFrameError_MPP_FRAME_ERR_UNKNOW: MppFrameError = 1;
pub const MppFrameError_MPP_FRAME_ERR_UNSUPPORT: MppFrameError = 2;
pub const MppFrameError_MPP_FRAME_ERR_DEC_INVALID: MppFrameError = 16;
pub const MppFrameError_MPP_FRAME_ERR_DEC_HW_ERR: MppFrameError = 256;
pub const MppFrameError_MPP_FRAME_ERR_DEC_MISS_REF: MppFrameError = 512;
pub type MppFrameError = ::std::os::raw::c_uint;
pub const MppFrameThumbnailMode_MPP_FRAME_THUMBNAIL_NONE: MppFrameThumbnailMode = 0;
pub const MppFrameThumbnailMode_MPP_FRAME_THUMBNAIL_MIXED: MppFrameThumbnailMode = 1;
pub const MppFrameThumbnailMode_MPP_FRAME_THUMBNAIL_ONLY: MppFrameThumbnailMode = 2;
pub type MppFrameThumbnailMode = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn mpp_frame_init(frame: *mut MppFrame) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_frame_deinit(frame: *mut MppFrame) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_frame_get_width(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_width(frame: MppFrame, width: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_height(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_height(frame: MppFrame, height: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_hor_stride(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_hor_stride(frame: MppFrame, hor_stride: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_ver_stride(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_ver_stride(frame: MppFrame, ver_stride: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_set_hor_stride_pixel(frame: MppFrame, hor_stride_pixel: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_hor_stride_pixel(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_fbc_hdr_stride(frame: MppFrame, fbc_hdr_stride: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_fbc_hdr_stride(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_get_offset_x(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_offset_x(frame: MppFrame, offset_x: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_offset_y(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_offset_y(frame: MppFrame, offset_y: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_mode(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_mode(frame: MppFrame, mode: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_discard(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_discard(frame: MppFrame, discard: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_viewid(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_viewid(frame: MppFrame, viewid: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_poc(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_poc(frame: MppFrame, poc: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_pts(frame: MppFrame) -> RK_S64;
}
unsafe extern "C" {
    pub fn mpp_frame_set_pts(frame: MppFrame, pts: RK_S64);
}
unsafe extern "C" {
    pub fn mpp_frame_get_dts(frame: MppFrame) -> RK_S64;
}
unsafe extern "C" {
    pub fn mpp_frame_set_dts(frame: MppFrame, dts: RK_S64);
}
unsafe extern "C" {
    pub fn mpp_frame_get_errinfo(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_errinfo(frame: MppFrame, errinfo: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_buf_size(frame: MppFrame) -> usize;
}
unsafe extern "C" {
    pub fn mpp_frame_set_buf_size(frame: MppFrame, buf_size: usize);
}
unsafe extern "C" {
    pub fn mpp_frame_set_thumbnail_en(frame: MppFrame, thumbnail_en: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_thumbnail_en(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_get_eos(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_eos(frame: MppFrame, eos: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_info_change(frame: MppFrame) -> RK_U32;
}
unsafe extern "C" {
    pub fn mpp_frame_set_info_change(frame: MppFrame, info_change: RK_U32);
}
unsafe extern "C" {
    pub fn mpp_frame_get_buffer(frame: MppFrame) -> MppBuffer;
}
unsafe extern "C" {
    pub fn mpp_frame_set_buffer(frame: MppFrame, buffer: MppBuffer);
}
unsafe extern "C" {
    pub fn mpp_frame_has_meta(frame: MppFrame) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_frame_get_meta(frame: MppFrame) -> MppMeta;
}
unsafe extern "C" {
    pub fn mpp_frame_set_meta(frame: MppFrame, meta: MppMeta);
}
unsafe extern "C" {
    pub fn mpp_frame_get_color_range(frame: MppFrame) -> MppFrameColorRange;
}
unsafe extern "C" {
    pub fn mpp_frame_set_color_range(frame: MppFrame, color_range: MppFrameColorRange);
}
unsafe extern "C" {
    pub fn mpp_frame_get_color_primaries(frame: MppFrame) -> MppFrameColorPrimaries;
}
unsafe extern "C" {
    pub fn mpp_frame_set_color_primaries(frame: MppFrame, color_primaries: MppFrameColorPrimaries);
}
unsafe extern "C" {
    pub fn mpp_frame_get_color_trc(frame: MppFrame) -> MppFrameColorTransferCharacteristic;
}
unsafe extern "C" {
    pub fn mpp_frame_set_color_trc(frame: MppFrame, color_trc: MppFrameColorTransferCharacteristic);
}
unsafe extern "C" {
    pub fn mpp_frame_get_colorspace(frame: MppFrame) -> MppFrameColorSpace;
}
unsafe extern "C" {
    pub fn mpp_frame_set_colorspace(frame: MppFrame, colorspace: MppFrameColorSpace);
}
unsafe extern "C" {
    pub fn mpp_frame_get_chroma_location(frame: MppFrame) -> MppFrameChromaLocation;
}
unsafe extern "C" {
    pub fn mpp_frame_set_chroma_location(frame: MppFrame, chroma_location: MppFrameChromaLocation);
}
unsafe extern "C" {
    pub fn mpp_frame_get_fmt(frame: MppFrame) -> MppFrameFormat;
}
unsafe extern "C" {
    pub fn mpp_frame_set_fmt(frame: MppFrame, fmt: MppFrameFormat);
}
unsafe extern "C" {
    pub fn mpp_frame_get_sar(frame: MppFrame) -> MppFrameRational;
}
unsafe extern "C" {
    pub fn mpp_frame_set_sar(frame: MppFrame, sar: MppFrameRational);
}
unsafe extern "C" {
    pub fn mpp_frame_get_mastering_display(frame: MppFrame) -> MppFrameMasteringDisplayMetadata;
}
unsafe extern "C" {
    pub fn mpp_frame_set_mastering_display(
        frame: MppFrame,
        mastering_display: MppFrameMasteringDisplayMetadata,
    );
}
unsafe extern "C" {
    pub fn mpp_frame_get_content_light(frame: MppFrame) -> MppFrameContentLightMetadata;
}
unsafe extern "C" {
    pub fn mpp_frame_set_content_light(
        frame: MppFrame,
        content_light: MppFrameContentLightMetadata,
    );
}
unsafe extern "C" {
    pub fn mpp_frame_get_hdr_dynamic_meta(frame: MppFrame) -> *mut MppFrameHdrDynamicMeta;
}
unsafe extern "C" {
    pub fn mpp_frame_set_hdr_dynamic_meta(frame: MppFrame, vivi_data: *mut MppFrameHdrDynamicMeta);
}
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_VBR: MppEncRcMode_e = 0;
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_CBR: MppEncRcMode_e = 1;
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_FIXQP: MppEncRcMode_e = 2;
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_AVBR: MppEncRcMode_e = 3;
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_SMTRC: MppEncRcMode_e = 4;
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_SE: MppEncRcMode_e = 5;
pub const MppEncRcMode_e_MPP_ENC_RC_MODE_BUTT: MppEncRcMode_e = 6;
pub type MppEncRcMode_e = ::std::os::raw::c_uint;
pub use self::MppEncRcMode_e as MppEncRcMode;
pub const MppEncSeMode_e_MPP_ENC_SE_DISABLE: MppEncSeMode_e = 0;
pub const MppEncSeMode_e_MPP_ENC_SE_MODE_BAL: MppEncSeMode_e = 1;
pub const MppEncSeMode_e_MPP_ENC_SE_MODE_QF: MppEncSeMode_e = 2;
pub const MppEncSeMode_e_MPP_ENC_SE_MODE_BF: MppEncSeMode_e = 3;
pub const MppEncSeMode_e_MPP_ENC_SE_MODE_EXTERNAL: MppEncSeMode_e = 4;
pub const MppEncSeMode_e_MPP_ENC_SE_MODE_BUTT: MppEncSeMode_e = 5;
pub type MppEncSeMode_e = ::std::os::raw::c_uint;
pub use self::MppEncSeMode_e as MppEncSeMode;
pub const MppEncRcPriority_e_MPP_ENC_RC_BY_BITRATE_FIRST: MppEncRcPriority_e = 0;
pub const MppEncRcPriority_e_MPP_ENC_RC_BY_FRM_SIZE_FIRST: MppEncRcPriority_e = 1;
pub const MppEncRcPriority_e_MPP_ENC_RC_PRIORITY_BUTT: MppEncRcPriority_e = 2;
pub type MppEncRcPriority_e = ::std::os::raw::c_uint;
pub use self::MppEncRcPriority_e as MppEncRcPriority;
pub const MppEncRcDropFrmMode_e_MPP_ENC_RC_DROP_FRM_DISABLED: MppEncRcDropFrmMode_e = 0;
pub const MppEncRcDropFrmMode_e_MPP_ENC_RC_DROP_FRM_NORMAL: MppEncRcDropFrmMode_e = 1;
pub const MppEncRcDropFrmMode_e_MPP_ENC_RC_DROP_FRM_PSKIP: MppEncRcDropFrmMode_e = 2;
pub const MppEncRcDropFrmMode_e_MPP_ENC_RC_DROP_FRM_BUTT: MppEncRcDropFrmMode_e = 3;
pub type MppEncRcDropFrmMode_e = ::std::os::raw::c_uint;
pub use self::MppEncRcDropFrmMode_e as MppEncRcDropFrmMode;
pub const MppEncRcSuperFrameMode_t_MPP_ENC_RC_SUPER_FRM_NONE: MppEncRcSuperFrameMode_t = 0;
pub const MppEncRcSuperFrameMode_t_MPP_ENC_RC_SUPER_FRM_DROP: MppEncRcSuperFrameMode_t = 1;
pub const MppEncRcSuperFrameMode_t_MPP_ENC_RC_SUPER_FRM_REENC: MppEncRcSuperFrameMode_t = 2;
pub const MppEncRcSuperFrameMode_t_MPP_ENC_RC_SUPER_FRM_BUTT: MppEncRcSuperFrameMode_t = 3;
pub type MppEncRcSuperFrameMode_t = ::std::os::raw::c_uint;
pub use self::MppEncRcSuperFrameMode_t as MppEncRcSuperFrameMode;
pub const MppEncRcGopMode_e_MPP_ENC_RC_NORMAL_P: MppEncRcGopMode_e = 0;
pub const MppEncRcGopMode_e_MPP_ENC_RC_SMART_P: MppEncRcGopMode_e = 1;
pub const MppEncRcGopMode_e_MPP_ENC_RC_GOP_MODE_BUTT: MppEncRcGopMode_e = 2;
pub type MppEncRcGopMode_e = ::std::os::raw::c_uint;
pub use self::MppEncRcGopMode_e as MppEncRcGopMode;
pub const MppEncRcIntraRefreshMode_e_MPP_ENC_RC_INTRA_REFRESH_ROW: MppEncRcIntraRefreshMode_e = 0;
pub const MppEncRcIntraRefreshMode_e_MPP_ENC_RC_INTRA_REFRESH_COL: MppEncRcIntraRefreshMode_e = 1;
pub const MppEncRcIntraRefreshMode_e_MPP_ENC_RC_INTRA_REFRESH_BUTT: MppEncRcIntraRefreshMode_e = 2;
pub type MppEncRcIntraRefreshMode_e = ::std::os::raw::c_uint;
pub use self::MppEncRcIntraRefreshMode_e as MppEncRcRefreshMode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncQueryCfg_t {
    pub query_flag: RK_U32,
    pub rt_status: RK_U32,
    pub rt_wait: RK_U32,
    pub rt_fps: RK_U32,
    pub rt_bps: RK_U32,
    pub enc_in_frm_cnt: RK_U32,
    pub enc_hw_run_cnt: RK_U32,
    pub enc_out_pkt_cnt: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncQueryCfg_t"][::std::mem::size_of::<MppEncQueryCfg_t>() - 32usize];
    ["Alignment of MppEncQueryCfg_t"][::std::mem::align_of::<MppEncQueryCfg_t>() - 4usize];
    ["Offset of field: MppEncQueryCfg_t::query_flag"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, query_flag) - 0usize];
    ["Offset of field: MppEncQueryCfg_t::rt_status"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, rt_status) - 4usize];
    ["Offset of field: MppEncQueryCfg_t::rt_wait"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, rt_wait) - 8usize];
    ["Offset of field: MppEncQueryCfg_t::rt_fps"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, rt_fps) - 12usize];
    ["Offset of field: MppEncQueryCfg_t::rt_bps"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, rt_bps) - 16usize];
    ["Offset of field: MppEncQueryCfg_t::enc_in_frm_cnt"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, enc_in_frm_cnt) - 20usize];
    ["Offset of field: MppEncQueryCfg_t::enc_hw_run_cnt"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, enc_hw_run_cnt) - 24usize];
    ["Offset of field: MppEncQueryCfg_t::enc_out_pkt_cnt"]
        [::std::mem::offset_of!(MppEncQueryCfg_t, enc_out_pkt_cnt) - 28usize];
};
pub type MppEncQueryCfg = MppEncQueryCfg_t;
pub const MppEncBaseCfgChange_e_MPP_ENC_BASE_CFG_CHANGE_LOW_DELAY: MppEncBaseCfgChange_e = 1;
pub const MppEncBaseCfgChange_e_MPP_ENC_BASE_CFG_CHANGE_ALL: MppEncBaseCfgChange_e = 4294967295;
pub type MppEncBaseCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncBaseCfgChange_e as MppEncBaseCfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncBaseCfg_t {
    pub change: RK_U32,
    pub low_delay: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncBaseCfg_t"][::std::mem::size_of::<MppEncBaseCfg_t>() - 8usize];
    ["Alignment of MppEncBaseCfg_t"][::std::mem::align_of::<MppEncBaseCfg_t>() - 4usize];
    ["Offset of field: MppEncBaseCfg_t::change"]
        [::std::mem::offset_of!(MppEncBaseCfg_t, change) - 0usize];
    ["Offset of field: MppEncBaseCfg_t::low_delay"]
        [::std::mem::offset_of!(MppEncBaseCfg_t, low_delay) - 4usize];
};
pub type MppEncBaseCfg = MppEncBaseCfg_t;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_RC_MODE: MppEncRcCfgChange_e = 1;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QUALITY: MppEncRcCfgChange_e = 2;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_BPS: MppEncRcCfgChange_e = 4;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_FPS_IN: MppEncRcCfgChange_e = 32;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_FPS_OUT: MppEncRcCfgChange_e = 64;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_GOP: MppEncRcCfgChange_e = 128;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_SKIP_CNT: MppEncRcCfgChange_e = 256;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_MAX_REENC: MppEncRcCfgChange_e = 512;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_DROP_FRM: MppEncRcCfgChange_e = 1024;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_MAX_I_PROP: MppEncRcCfgChange_e = 2048;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_MIN_I_PROP: MppEncRcCfgChange_e = 4096;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_INIT_IP_RATIO: MppEncRcCfgChange_e = 8192;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_PRIORITY: MppEncRcCfgChange_e = 16384;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_SUPER_FRM: MppEncRcCfgChange_e = 32768;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_INIT: MppEncRcCfgChange_e = 65536;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_RANGE: MppEncRcCfgChange_e = 131072;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_RANGE_I: MppEncRcCfgChange_e = 262144;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_MAX_STEP: MppEncRcCfgChange_e = 524288;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_IP: MppEncRcCfgChange_e = 1048576;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_VI: MppEncRcCfgChange_e = 2097152;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_ROW: MppEncRcCfgChange_e = 4194304;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_QP_ROW_I: MppEncRcCfgChange_e = 8388608;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_DEBREATH: MppEncRcCfgChange_e = 16777216;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_HIER_QP: MppEncRcCfgChange_e = 33554432;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_ST_TIME: MppEncRcCfgChange_e = 67108864;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_REFRESH: MppEncRcCfgChange_e = 134217728;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_GOP_REF_CFG: MppEncRcCfgChange_e = 268435456;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_FQP: MppEncRcCfgChange_e = 536870912;
pub const MppEncRcCfgChange_e_MPP_ENC_RC_CFG_CHANGE_ALL: MppEncRcCfgChange_e = 4294967295;
pub type MppEncRcCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncRcCfgChange_e as MppEncRcCfgChange;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_WORST: MppEncRcQuality_e = 0;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_WORSE: MppEncRcQuality_e = 1;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_MEDIUM: MppEncRcQuality_e = 2;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_BETTER: MppEncRcQuality_e = 3;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_BEST: MppEncRcQuality_e = 4;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_CQP: MppEncRcQuality_e = 5;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_AQ_ONLY: MppEncRcQuality_e = 6;
pub const MppEncRcQuality_e_MPP_ENC_RC_QUALITY_BUTT: MppEncRcQuality_e = 7;
pub type MppEncRcQuality_e = ::std::os::raw::c_uint;
pub use self::MppEncRcQuality_e as MppEncRcQuality;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncRcCfg_t {
    pub change: RK_U32,
    pub rc_mode: MppEncRcMode,
    pub quality: MppEncRcQuality,
    pub bps_target: RK_S32,
    pub bps_max: RK_S32,
    pub bps_min: RK_S32,
    pub fps_in_flex: RK_S32,
    pub fps_in_num: RK_S32,
    pub fps_in_denom: RK_S32,
    pub fps_out_flex: RK_S32,
    pub fps_out_num: RK_S32,
    pub fps_out_denom: RK_S32,
    pub fps_chg_no_idr: RK_S32,
    pub gop: RK_S32,
    pub ref_cfg: *mut ::std::os::raw::c_void,
    pub skip_cnt: RK_S32,
    pub max_reenc_times: RK_U32,
    pub stats_time: RK_S32,
    pub drop_mode: MppEncRcDropFrmMode,
    pub drop_threshold: RK_U32,
    pub drop_gap: RK_U32,
    pub super_mode: MppEncRcSuperFrameMode,
    pub super_i_thd: RK_U32,
    pub super_p_thd: RK_U32,
    pub rc_priority: MppEncRcPriority,
    pub debreath_en: RK_U32,
    pub debre_strength: RK_U32,
    pub max_i_prop: RK_S32,
    pub min_i_prop: RK_S32,
    pub init_ip_ratio: RK_S32,
    pub qp_init: RK_S32,
    pub qp_max: RK_S32,
    pub qp_max_i: RK_S32,
    pub qp_min: RK_S32,
    pub qp_min_i: RK_S32,
    pub qp_max_step: RK_S32,
    pub qp_delta_ip: RK_S32,
    pub qp_delta_vi: RK_S32,
    pub fqp_min_i: RK_S32,
    pub fqp_min_p: RK_S32,
    pub fqp_max_i: RK_S32,
    pub fqp_max_p: RK_S32,
    pub mt_st_swth_frm_qp: RK_S32,
    pub hier_qp_en: RK_S32,
    pub hier_qp_delta: [RK_S32; 4usize],
    pub hier_frame_num: [RK_S32; 4usize],
    pub refresh_en: RK_U32,
    pub refresh_mode: MppEncRcRefreshMode,
    pub refresh_num: RK_U32,
    pub refresh_length: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncRcCfg_t"][::std::mem::size_of::<MppEncRcCfg_t>() - 232usize];
    ["Alignment of MppEncRcCfg_t"][::std::mem::align_of::<MppEncRcCfg_t>() - 8usize];
    ["Offset of field: MppEncRcCfg_t::change"]
        [::std::mem::offset_of!(MppEncRcCfg_t, change) - 0usize];
    ["Offset of field: MppEncRcCfg_t::rc_mode"]
        [::std::mem::offset_of!(MppEncRcCfg_t, rc_mode) - 4usize];
    ["Offset of field: MppEncRcCfg_t::quality"]
        [::std::mem::offset_of!(MppEncRcCfg_t, quality) - 8usize];
    ["Offset of field: MppEncRcCfg_t::bps_target"]
        [::std::mem::offset_of!(MppEncRcCfg_t, bps_target) - 12usize];
    ["Offset of field: MppEncRcCfg_t::bps_max"]
        [::std::mem::offset_of!(MppEncRcCfg_t, bps_max) - 16usize];
    ["Offset of field: MppEncRcCfg_t::bps_min"]
        [::std::mem::offset_of!(MppEncRcCfg_t, bps_min) - 20usize];
    ["Offset of field: MppEncRcCfg_t::fps_in_flex"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_in_flex) - 24usize];
    ["Offset of field: MppEncRcCfg_t::fps_in_num"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_in_num) - 28usize];
    ["Offset of field: MppEncRcCfg_t::fps_in_denom"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_in_denom) - 32usize];
    ["Offset of field: MppEncRcCfg_t::fps_out_flex"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_out_flex) - 36usize];
    ["Offset of field: MppEncRcCfg_t::fps_out_num"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_out_num) - 40usize];
    ["Offset of field: MppEncRcCfg_t::fps_out_denom"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_out_denom) - 44usize];
    ["Offset of field: MppEncRcCfg_t::fps_chg_no_idr"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fps_chg_no_idr) - 48usize];
    ["Offset of field: MppEncRcCfg_t::gop"][::std::mem::offset_of!(MppEncRcCfg_t, gop) - 52usize];
    ["Offset of field: MppEncRcCfg_t::ref_cfg"]
        [::std::mem::offset_of!(MppEncRcCfg_t, ref_cfg) - 56usize];
    ["Offset of field: MppEncRcCfg_t::skip_cnt"]
        [::std::mem::offset_of!(MppEncRcCfg_t, skip_cnt) - 64usize];
    ["Offset of field: MppEncRcCfg_t::max_reenc_times"]
        [::std::mem::offset_of!(MppEncRcCfg_t, max_reenc_times) - 68usize];
    ["Offset of field: MppEncRcCfg_t::stats_time"]
        [::std::mem::offset_of!(MppEncRcCfg_t, stats_time) - 72usize];
    ["Offset of field: MppEncRcCfg_t::drop_mode"]
        [::std::mem::offset_of!(MppEncRcCfg_t, drop_mode) - 76usize];
    ["Offset of field: MppEncRcCfg_t::drop_threshold"]
        [::std::mem::offset_of!(MppEncRcCfg_t, drop_threshold) - 80usize];
    ["Offset of field: MppEncRcCfg_t::drop_gap"]
        [::std::mem::offset_of!(MppEncRcCfg_t, drop_gap) - 84usize];
    ["Offset of field: MppEncRcCfg_t::super_mode"]
        [::std::mem::offset_of!(MppEncRcCfg_t, super_mode) - 88usize];
    ["Offset of field: MppEncRcCfg_t::super_i_thd"]
        [::std::mem::offset_of!(MppEncRcCfg_t, super_i_thd) - 92usize];
    ["Offset of field: MppEncRcCfg_t::super_p_thd"]
        [::std::mem::offset_of!(MppEncRcCfg_t, super_p_thd) - 96usize];
    ["Offset of field: MppEncRcCfg_t::rc_priority"]
        [::std::mem::offset_of!(MppEncRcCfg_t, rc_priority) - 100usize];
    ["Offset of field: MppEncRcCfg_t::debreath_en"]
        [::std::mem::offset_of!(MppEncRcCfg_t, debreath_en) - 104usize];
    ["Offset of field: MppEncRcCfg_t::debre_strength"]
        [::std::mem::offset_of!(MppEncRcCfg_t, debre_strength) - 108usize];
    ["Offset of field: MppEncRcCfg_t::max_i_prop"]
        [::std::mem::offset_of!(MppEncRcCfg_t, max_i_prop) - 112usize];
    ["Offset of field: MppEncRcCfg_t::min_i_prop"]
        [::std::mem::offset_of!(MppEncRcCfg_t, min_i_prop) - 116usize];
    ["Offset of field: MppEncRcCfg_t::init_ip_ratio"]
        [::std::mem::offset_of!(MppEncRcCfg_t, init_ip_ratio) - 120usize];
    ["Offset of field: MppEncRcCfg_t::qp_init"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_init) - 124usize];
    ["Offset of field: MppEncRcCfg_t::qp_max"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_max) - 128usize];
    ["Offset of field: MppEncRcCfg_t::qp_max_i"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_max_i) - 132usize];
    ["Offset of field: MppEncRcCfg_t::qp_min"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_min) - 136usize];
    ["Offset of field: MppEncRcCfg_t::qp_min_i"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_min_i) - 140usize];
    ["Offset of field: MppEncRcCfg_t::qp_max_step"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_max_step) - 144usize];
    ["Offset of field: MppEncRcCfg_t::qp_delta_ip"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_delta_ip) - 148usize];
    ["Offset of field: MppEncRcCfg_t::qp_delta_vi"]
        [::std::mem::offset_of!(MppEncRcCfg_t, qp_delta_vi) - 152usize];
    ["Offset of field: MppEncRcCfg_t::fqp_min_i"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fqp_min_i) - 156usize];
    ["Offset of field: MppEncRcCfg_t::fqp_min_p"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fqp_min_p) - 160usize];
    ["Offset of field: MppEncRcCfg_t::fqp_max_i"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fqp_max_i) - 164usize];
    ["Offset of field: MppEncRcCfg_t::fqp_max_p"]
        [::std::mem::offset_of!(MppEncRcCfg_t, fqp_max_p) - 168usize];
    ["Offset of field: MppEncRcCfg_t::mt_st_swth_frm_qp"]
        [::std::mem::offset_of!(MppEncRcCfg_t, mt_st_swth_frm_qp) - 172usize];
    ["Offset of field: MppEncRcCfg_t::hier_qp_en"]
        [::std::mem::offset_of!(MppEncRcCfg_t, hier_qp_en) - 176usize];
    ["Offset of field: MppEncRcCfg_t::hier_qp_delta"]
        [::std::mem::offset_of!(MppEncRcCfg_t, hier_qp_delta) - 180usize];
    ["Offset of field: MppEncRcCfg_t::hier_frame_num"]
        [::std::mem::offset_of!(MppEncRcCfg_t, hier_frame_num) - 196usize];
    ["Offset of field: MppEncRcCfg_t::refresh_en"]
        [::std::mem::offset_of!(MppEncRcCfg_t, refresh_en) - 212usize];
    ["Offset of field: MppEncRcCfg_t::refresh_mode"]
        [::std::mem::offset_of!(MppEncRcCfg_t, refresh_mode) - 216usize];
    ["Offset of field: MppEncRcCfg_t::refresh_num"]
        [::std::mem::offset_of!(MppEncRcCfg_t, refresh_num) - 220usize];
    ["Offset of field: MppEncRcCfg_t::refresh_length"]
        [::std::mem::offset_of!(MppEncRcCfg_t, refresh_length) - 224usize];
};
pub type MppEncRcCfg = MppEncRcCfg_t;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_QP_ROW: MppEncHwCfgChange_e = 1;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_QP_ROW_I: MppEncHwCfgChange_e = 2;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_AQ_THRD_I: MppEncHwCfgChange_e = 4;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_AQ_THRD_P: MppEncHwCfgChange_e = 8;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_AQ_STEP_I: MppEncHwCfgChange_e = 16;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_AQ_STEP_P: MppEncHwCfgChange_e = 32;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_MB_RC: MppEncHwCfgChange_e = 64;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_CU_MODE_BIAS: MppEncHwCfgChange_e = 256;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_CU_SKIP_BIAS: MppEncHwCfgChange_e = 512;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_QBIAS_I: MppEncHwCfgChange_e = 1024;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_QBIAS_P: MppEncHwCfgChange_e = 2048;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_QBIAS_EN: MppEncHwCfgChange_e = 4096;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_AQ_RNGE_ARR: MppEncHwCfgChange_e = 8192;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_QBIAS_ARR: MppEncHwCfgChange_e = 16384;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_FLT_STR_I: MppEncHwCfgChange_e = 32768;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_FLT_STR_P: MppEncHwCfgChange_e = 65536;
pub const MppEncHwCfgChange_e_MPP_ENC_HW_CFG_CHANGE_ALL: MppEncHwCfgChange_e = 4294967295;
pub type MppEncHwCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncHwCfgChange_e as MppEncHwCfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncHwCfg_t {
    pub change: RK_U32,
    pub qp_delta_row: RK_S32,
    pub qp_delta_row_i: RK_S32,
    pub qbias_i: RK_S32,
    pub qbias_p: RK_S32,
    pub qbias_en: RK_S32,
    pub flt_str_i: RK_S32,
    pub flt_str_p: RK_S32,
    pub aq_thrd_i: [RK_U32; 16usize],
    pub aq_thrd_p: [RK_U32; 16usize],
    pub aq_step_i: [RK_S32; 16usize],
    pub aq_step_p: [RK_S32; 16usize],
    pub mb_rc_disable: RK_S32,
    pub extra_buf: RK_S32,
    pub mode_bias: [RK_S32; 8usize],
    pub skip_bias_en: RK_S32,
    pub skip_sad: RK_S32,
    pub skip_bias: RK_S32,
    pub qbias_arr: [RK_S32; 18usize],
    pub aq_rnge_arr: [RK_S32; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncHwCfg_t"][::std::mem::size_of::<MppEncHwCfg_t>() - 452usize];
    ["Alignment of MppEncHwCfg_t"][::std::mem::align_of::<MppEncHwCfg_t>() - 4usize];
    ["Offset of field: MppEncHwCfg_t::change"]
        [::std::mem::offset_of!(MppEncHwCfg_t, change) - 0usize];
    ["Offset of field: MppEncHwCfg_t::qp_delta_row"]
        [::std::mem::offset_of!(MppEncHwCfg_t, qp_delta_row) - 4usize];
    ["Offset of field: MppEncHwCfg_t::qp_delta_row_i"]
        [::std::mem::offset_of!(MppEncHwCfg_t, qp_delta_row_i) - 8usize];
    ["Offset of field: MppEncHwCfg_t::qbias_i"]
        [::std::mem::offset_of!(MppEncHwCfg_t, qbias_i) - 12usize];
    ["Offset of field: MppEncHwCfg_t::qbias_p"]
        [::std::mem::offset_of!(MppEncHwCfg_t, qbias_p) - 16usize];
    ["Offset of field: MppEncHwCfg_t::qbias_en"]
        [::std::mem::offset_of!(MppEncHwCfg_t, qbias_en) - 20usize];
    ["Offset of field: MppEncHwCfg_t::flt_str_i"]
        [::std::mem::offset_of!(MppEncHwCfg_t, flt_str_i) - 24usize];
    ["Offset of field: MppEncHwCfg_t::flt_str_p"]
        [::std::mem::offset_of!(MppEncHwCfg_t, flt_str_p) - 28usize];
    ["Offset of field: MppEncHwCfg_t::aq_thrd_i"]
        [::std::mem::offset_of!(MppEncHwCfg_t, aq_thrd_i) - 32usize];
    ["Offset of field: MppEncHwCfg_t::aq_thrd_p"]
        [::std::mem::offset_of!(MppEncHwCfg_t, aq_thrd_p) - 96usize];
    ["Offset of field: MppEncHwCfg_t::aq_step_i"]
        [::std::mem::offset_of!(MppEncHwCfg_t, aq_step_i) - 160usize];
    ["Offset of field: MppEncHwCfg_t::aq_step_p"]
        [::std::mem::offset_of!(MppEncHwCfg_t, aq_step_p) - 224usize];
    ["Offset of field: MppEncHwCfg_t::mb_rc_disable"]
        [::std::mem::offset_of!(MppEncHwCfg_t, mb_rc_disable) - 288usize];
    ["Offset of field: MppEncHwCfg_t::extra_buf"]
        [::std::mem::offset_of!(MppEncHwCfg_t, extra_buf) - 292usize];
    ["Offset of field: MppEncHwCfg_t::mode_bias"]
        [::std::mem::offset_of!(MppEncHwCfg_t, mode_bias) - 296usize];
    ["Offset of field: MppEncHwCfg_t::skip_bias_en"]
        [::std::mem::offset_of!(MppEncHwCfg_t, skip_bias_en) - 328usize];
    ["Offset of field: MppEncHwCfg_t::skip_sad"]
        [::std::mem::offset_of!(MppEncHwCfg_t, skip_sad) - 332usize];
    ["Offset of field: MppEncHwCfg_t::skip_bias"]
        [::std::mem::offset_of!(MppEncHwCfg_t, skip_bias) - 336usize];
    ["Offset of field: MppEncHwCfg_t::qbias_arr"]
        [::std::mem::offset_of!(MppEncHwCfg_t, qbias_arr) - 340usize];
    ["Offset of field: MppEncHwCfg_t::aq_rnge_arr"]
        [::std::mem::offset_of!(MppEncHwCfg_t, aq_rnge_arr) - 412usize];
};
pub type MppEncHwCfg = MppEncHwCfg_t;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_INPUT: MppEncPrepCfgChange_e = 1;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_FORMAT: MppEncPrepCfgChange_e = 4;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_ROTATION: MppEncPrepCfgChange_e = 16;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_MIRRORING: MppEncPrepCfgChange_e = 32;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_FLIP: MppEncPrepCfgChange_e = 64;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_DENOISE: MppEncPrepCfgChange_e = 256;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_SHARPEN: MppEncPrepCfgChange_e = 512;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_COLOR_RANGE: MppEncPrepCfgChange_e = 65536;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_COLOR_SPACE: MppEncPrepCfgChange_e = 131072;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_COLOR_PRIME: MppEncPrepCfgChange_e = 262144;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_COLOR_TRC: MppEncPrepCfgChange_e = 524288;
pub const MppEncPrepCfgChange_e_MPP_ENC_PREP_CFG_CHANGE_ALL: MppEncPrepCfgChange_e = 4294967295;
pub type MppEncPrepCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncPrepCfgChange_e as MppEncPrepCfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncPrepSharpenCfg {
    pub enable_y: RK_U32,
    pub enable_uv: RK_U32,
    pub coef: [RK_S32; 5usize],
    pub div: RK_S32,
    pub threshold: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncPrepSharpenCfg"][::std::mem::size_of::<MppEncPrepSharpenCfg>() - 36usize];
    ["Alignment of MppEncPrepSharpenCfg"][::std::mem::align_of::<MppEncPrepSharpenCfg>() - 4usize];
    ["Offset of field: MppEncPrepSharpenCfg::enable_y"]
        [::std::mem::offset_of!(MppEncPrepSharpenCfg, enable_y) - 0usize];
    ["Offset of field: MppEncPrepSharpenCfg::enable_uv"]
        [::std::mem::offset_of!(MppEncPrepSharpenCfg, enable_uv) - 4usize];
    ["Offset of field: MppEncPrepSharpenCfg::coef"]
        [::std::mem::offset_of!(MppEncPrepSharpenCfg, coef) - 8usize];
    ["Offset of field: MppEncPrepSharpenCfg::div"]
        [::std::mem::offset_of!(MppEncPrepSharpenCfg, div) - 28usize];
    ["Offset of field: MppEncPrepSharpenCfg::threshold"]
        [::std::mem::offset_of!(MppEncPrepSharpenCfg, threshold) - 32usize];
};
pub const MppEncRotationCfg_e_MPP_ENC_ROT_0: MppEncRotationCfg_e = 0;
pub const MppEncRotationCfg_e_MPP_ENC_ROT_90: MppEncRotationCfg_e = 1;
pub const MppEncRotationCfg_e_MPP_ENC_ROT_180: MppEncRotationCfg_e = 2;
pub const MppEncRotationCfg_e_MPP_ENC_ROT_270: MppEncRotationCfg_e = 3;
pub const MppEncRotationCfg_e_MPP_ENC_ROT_BUTT: MppEncRotationCfg_e = 4;
pub type MppEncRotationCfg_e = ::std::os::raw::c_uint;
pub use self::MppEncRotationCfg_e as MppEncRotationCfg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncPrepCfg_t {
    pub change: RK_U32,
    pub width: RK_S32,
    pub height: RK_S32,
    pub hor_stride: RK_S32,
    pub ver_stride: RK_S32,
    pub max_width: RK_S32,
    pub max_height: RK_S32,
    pub format: MppFrameFormat,
    pub color: MppFrameColorSpace,
    pub colorprim: MppFrameColorPrimaries,
    pub colortrc: MppFrameColorTransferCharacteristic,
    pub range: MppFrameColorRange,
    pub format_out: MppFrameChromaFormat,
    pub chroma_ds_mode: MppFrameChromaDownSampleMode,
    pub range_out: MppFrameColorRange,
    pub fix_chroma_en: RK_S32,
    pub fix_chroma_u: RK_S32,
    pub fix_chroma_v: RK_S32,
    pub rotation: MppEncRotationCfg,
    pub rotation_ext: MppEncRotationCfg,
    pub mirroring: RK_S32,
    pub mirroring_ext: RK_S32,
    pub flip: RK_S32,
    pub denoise: RK_S32,
    pub sharpen: MppEncPrepSharpenCfg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncPrepCfg_t"][::std::mem::size_of::<MppEncPrepCfg_t>() - 132usize];
    ["Alignment of MppEncPrepCfg_t"][::std::mem::align_of::<MppEncPrepCfg_t>() - 4usize];
    ["Offset of field: MppEncPrepCfg_t::change"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, change) - 0usize];
    ["Offset of field: MppEncPrepCfg_t::width"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, width) - 4usize];
    ["Offset of field: MppEncPrepCfg_t::height"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, height) - 8usize];
    ["Offset of field: MppEncPrepCfg_t::hor_stride"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, hor_stride) - 12usize];
    ["Offset of field: MppEncPrepCfg_t::ver_stride"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, ver_stride) - 16usize];
    ["Offset of field: MppEncPrepCfg_t::max_width"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, max_width) - 20usize];
    ["Offset of field: MppEncPrepCfg_t::max_height"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, max_height) - 24usize];
    ["Offset of field: MppEncPrepCfg_t::format"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, format) - 28usize];
    ["Offset of field: MppEncPrepCfg_t::color"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, color) - 32usize];
    ["Offset of field: MppEncPrepCfg_t::colorprim"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, colorprim) - 36usize];
    ["Offset of field: MppEncPrepCfg_t::colortrc"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, colortrc) - 40usize];
    ["Offset of field: MppEncPrepCfg_t::range"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, range) - 44usize];
    ["Offset of field: MppEncPrepCfg_t::format_out"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, format_out) - 48usize];
    ["Offset of field: MppEncPrepCfg_t::chroma_ds_mode"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, chroma_ds_mode) - 52usize];
    ["Offset of field: MppEncPrepCfg_t::range_out"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, range_out) - 56usize];
    ["Offset of field: MppEncPrepCfg_t::fix_chroma_en"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, fix_chroma_en) - 60usize];
    ["Offset of field: MppEncPrepCfg_t::fix_chroma_u"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, fix_chroma_u) - 64usize];
    ["Offset of field: MppEncPrepCfg_t::fix_chroma_v"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, fix_chroma_v) - 68usize];
    ["Offset of field: MppEncPrepCfg_t::rotation"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, rotation) - 72usize];
    ["Offset of field: MppEncPrepCfg_t::rotation_ext"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, rotation_ext) - 76usize];
    ["Offset of field: MppEncPrepCfg_t::mirroring"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, mirroring) - 80usize];
    ["Offset of field: MppEncPrepCfg_t::mirroring_ext"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, mirroring_ext) - 84usize];
    ["Offset of field: MppEncPrepCfg_t::flip"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, flip) - 88usize];
    ["Offset of field: MppEncPrepCfg_t::denoise"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, denoise) - 92usize];
    ["Offset of field: MppEncPrepCfg_t::sharpen"]
        [::std::mem::offset_of!(MppEncPrepCfg_t, sharpen) - 96usize];
};
pub type MppEncPrepCfg = MppEncPrepCfg_t;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct MppEncMDBlkInfo_t {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncMDBlkInfo_t"][::std::mem::size_of::<MppEncMDBlkInfo_t>() - 4usize];
    ["Alignment of MppEncMDBlkInfo_t"][::std::mem::align_of::<MppEncMDBlkInfo_t>() - 4usize];
};
impl MppEncMDBlkInfo_t {
    #[inline]
    pub fn sad(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_sad(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sad_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                15u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_sad_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                15u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mvx(&self) -> RK_S32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_mvx(&mut self, val: RK_S32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mvx_raw(this: *const Self) -> RK_S32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mvx_raw(this: *mut Self, val: RK_S32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mvy(&self) -> RK_S32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_mvy(&mut self, val: RK_S32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mvy_raw(this: *const Self) -> RK_S32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mvy_raw(this: *mut Self, val: RK_S32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sad: RK_U32,
        mvx: RK_S32,
        mvy: RK_S32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 15u8, {
            let sad: u32 = unsafe { ::std::mem::transmute(sad) };
            sad as u64
        });
        __bindgen_bitfield_unit.set(15usize, 9u8, {
            let mvx: u32 = unsafe { ::std::mem::transmute(mvx) };
            mvx as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let mvy: u32 = unsafe { ::std::mem::transmute(mvy) };
            mvy as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type MppEncMDBlkInfo = MppEncMDBlkInfo_t;
pub const MppEncHeaderMode_e_MPP_ENC_HEADER_MODE_DEFAULT: MppEncHeaderMode_e = 0;
pub const MppEncHeaderMode_e_MPP_ENC_HEADER_MODE_EACH_IDR: MppEncHeaderMode_e = 1;
pub const MppEncHeaderMode_e_MPP_ENC_HEADER_MODE_BUTT: MppEncHeaderMode_e = 2;
pub type MppEncHeaderMode_e = ::std::os::raw::c_uint;
pub use self::MppEncHeaderMode_e as MppEncHeaderMode;
pub const MppEncSeiMode_e_MPP_ENC_SEI_MODE_DISABLE: MppEncSeiMode_e = 0;
pub const MppEncSeiMode_e_MPP_ENC_SEI_MODE_ONE_SEQ: MppEncSeiMode_e = 1;
pub const MppEncSeiMode_e_MPP_ENC_SEI_MODE_ONE_FRAME: MppEncSeiMode_e = 2;
pub type MppEncSeiMode_e = ::std::os::raw::c_uint;
pub use self::MppEncSeiMode_e as MppEncSeiMode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncVuiCfg_t {
    pub change: RK_U32,
    pub vui_en: RK_S32,
    pub vui_aspect_ratio: RK_S32,
    pub vui_sar_size: RK_S32,
    pub full_range: RK_S32,
    pub time_scale: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncVuiCfg_t"][::std::mem::size_of::<MppEncVuiCfg_t>() - 24usize];
    ["Alignment of MppEncVuiCfg_t"][::std::mem::align_of::<MppEncVuiCfg_t>() - 4usize];
    ["Offset of field: MppEncVuiCfg_t::change"]
        [::std::mem::offset_of!(MppEncVuiCfg_t, change) - 0usize];
    ["Offset of field: MppEncVuiCfg_t::vui_en"]
        [::std::mem::offset_of!(MppEncVuiCfg_t, vui_en) - 4usize];
    ["Offset of field: MppEncVuiCfg_t::vui_aspect_ratio"]
        [::std::mem::offset_of!(MppEncVuiCfg_t, vui_aspect_ratio) - 8usize];
    ["Offset of field: MppEncVuiCfg_t::vui_sar_size"]
        [::std::mem::offset_of!(MppEncVuiCfg_t, vui_sar_size) - 12usize];
    ["Offset of field: MppEncVuiCfg_t::full_range"]
        [::std::mem::offset_of!(MppEncVuiCfg_t, full_range) - 16usize];
    ["Offset of field: MppEncVuiCfg_t::time_scale"]
        [::std::mem::offset_of!(MppEncVuiCfg_t, time_scale) - 20usize];
};
pub type MppEncVuiCfg = MppEncVuiCfg_t;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_STREAM_TYPE: MppEncH264CfgChange_e = 1;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_PROFILE: MppEncH264CfgChange_e = 2;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_ENTROPY: MppEncH264CfgChange_e = 4;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_TRANS_8x8: MppEncH264CfgChange_e = 16;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_CONST_INTRA: MppEncH264CfgChange_e = 32;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_CHROMA_QP: MppEncH264CfgChange_e = 64;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_DEBLOCKING: MppEncH264CfgChange_e = 128;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_LONG_TERM: MppEncH264CfgChange_e = 256;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_SCALING_LIST: MppEncH264CfgChange_e = 512;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_POC_TYPE: MppEncH264CfgChange_e = 1024;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_MAX_POC_LSB: MppEncH264CfgChange_e = 2048;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_MAX_FRM_NUM: MppEncH264CfgChange_e = 4096;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_GAPS_IN_FRM_NUM: MppEncH264CfgChange_e =
    8192;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_QP_LIMIT: MppEncH264CfgChange_e = 65536;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_QP_LIMIT_I: MppEncH264CfgChange_e = 131072;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_MAX_QP_STEP: MppEncH264CfgChange_e = 262144;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_QP_DELTA: MppEncH264CfgChange_e = 524288;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_INTRA_REFRESH: MppEncH264CfgChange_e =
    1048576;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_MAX_LTR: MppEncH264CfgChange_e = 2097152;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_MAX_TID: MppEncH264CfgChange_e = 4194304;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_ADD_PREFIX: MppEncH264CfgChange_e = 8388608;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_BASE_LAYER_PID: MppEncH264CfgChange_e =
    16777216;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_VUI: MppEncH264CfgChange_e = 268435456;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_CONSTRAINT_SET: MppEncH264CfgChange_e =
    536870912;
pub const MppEncH264CfgChange_e_MPP_ENC_H264_CFG_CHANGE_ALL: MppEncH264CfgChange_e = 4294967295;
pub type MppEncH264CfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncH264CfgChange_e as MppEncH264CfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH264HwCfg_t {
    pub hw_poc_type: RK_U32,
    pub hw_log2_max_frame_num_minus4: RK_U32,
    pub hw_split_out: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH264HwCfg_t"][::std::mem::size_of::<MppEncH264HwCfg_t>() - 12usize];
    ["Alignment of MppEncH264HwCfg_t"][::std::mem::align_of::<MppEncH264HwCfg_t>() - 4usize];
    ["Offset of field: MppEncH264HwCfg_t::hw_poc_type"]
        [::std::mem::offset_of!(MppEncH264HwCfg_t, hw_poc_type) - 0usize];
    ["Offset of field: MppEncH264HwCfg_t::hw_log2_max_frame_num_minus4"]
        [::std::mem::offset_of!(MppEncH264HwCfg_t, hw_log2_max_frame_num_minus4) - 4usize];
    ["Offset of field: MppEncH264HwCfg_t::hw_split_out"]
        [::std::mem::offset_of!(MppEncH264HwCfg_t, hw_split_out) - 8usize];
};
pub type MppEncH264HwCfg = MppEncH264HwCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH264Cfg_t {
    pub change: RK_U32,
    pub stream_type: RK_S32,
    pub poc_type: RK_U32,
    pub log2_max_poc_lsb: RK_U32,
    pub log2_max_frame_num: RK_U32,
    pub gaps_not_allowed: RK_U32,
    pub hw_cfg: MppEncH264HwCfg,
    pub profile: RK_S32,
    pub level: RK_S32,
    pub entropy_coding_mode: RK_S32,
    pub entropy_coding_mode_ex: RK_S32,
    pub cabac_init_idc: RK_S32,
    pub cabac_init_idc_ex: RK_S32,
    pub transform8x8_mode: RK_S32,
    pub transform8x8_mode_ex: RK_S32,
    pub constrained_intra_pred_mode: RK_S32,
    pub scaling_list_mode: RK_S32,
    pub chroma_cb_qp_offset: RK_S32,
    pub chroma_cr_qp_offset: RK_S32,
    pub deblock_disable: RK_S32,
    pub deblock_offset_alpha: RK_S32,
    pub deblock_offset_beta: RK_S32,
    pub use_longterm: RK_S32,
    pub qp_init: RK_S32,
    pub qp_max: RK_S16,
    pub qp_max_i: RK_S16,
    pub qp_min: RK_S16,
    pub qp_min_i: RK_S16,
    pub qp_max_step: RK_S16,
    pub qp_delta_ip: RK_S16,
    pub intra_refresh_mode: RK_S32,
    pub intra_refresh_arg: RK_S32,
    pub max_ltr_frames: RK_S32,
    pub max_tid: RK_S32,
    pub prefix_mode: RK_S32,
    pub base_layer_pid: RK_S32,
    pub constraint_set: RK_U32,
    pub vui: MppEncVuiCfg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH264Cfg_t"][::std::mem::size_of::<MppEncH264Cfg_t>() - 168usize];
    ["Alignment of MppEncH264Cfg_t"][::std::mem::align_of::<MppEncH264Cfg_t>() - 4usize];
    ["Offset of field: MppEncH264Cfg_t::change"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, change) - 0usize];
    ["Offset of field: MppEncH264Cfg_t::stream_type"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, stream_type) - 4usize];
    ["Offset of field: MppEncH264Cfg_t::poc_type"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, poc_type) - 8usize];
    ["Offset of field: MppEncH264Cfg_t::log2_max_poc_lsb"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, log2_max_poc_lsb) - 12usize];
    ["Offset of field: MppEncH264Cfg_t::log2_max_frame_num"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, log2_max_frame_num) - 16usize];
    ["Offset of field: MppEncH264Cfg_t::gaps_not_allowed"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, gaps_not_allowed) - 20usize];
    ["Offset of field: MppEncH264Cfg_t::hw_cfg"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, hw_cfg) - 24usize];
    ["Offset of field: MppEncH264Cfg_t::profile"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, profile) - 36usize];
    ["Offset of field: MppEncH264Cfg_t::level"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, level) - 40usize];
    ["Offset of field: MppEncH264Cfg_t::entropy_coding_mode"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, entropy_coding_mode) - 44usize];
    ["Offset of field: MppEncH264Cfg_t::entropy_coding_mode_ex"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, entropy_coding_mode_ex) - 48usize];
    ["Offset of field: MppEncH264Cfg_t::cabac_init_idc"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, cabac_init_idc) - 52usize];
    ["Offset of field: MppEncH264Cfg_t::cabac_init_idc_ex"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, cabac_init_idc_ex) - 56usize];
    ["Offset of field: MppEncH264Cfg_t::transform8x8_mode"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, transform8x8_mode) - 60usize];
    ["Offset of field: MppEncH264Cfg_t::transform8x8_mode_ex"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, transform8x8_mode_ex) - 64usize];
    ["Offset of field: MppEncH264Cfg_t::constrained_intra_pred_mode"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, constrained_intra_pred_mode) - 68usize];
    ["Offset of field: MppEncH264Cfg_t::scaling_list_mode"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, scaling_list_mode) - 72usize];
    ["Offset of field: MppEncH264Cfg_t::chroma_cb_qp_offset"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, chroma_cb_qp_offset) - 76usize];
    ["Offset of field: MppEncH264Cfg_t::chroma_cr_qp_offset"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, chroma_cr_qp_offset) - 80usize];
    ["Offset of field: MppEncH264Cfg_t::deblock_disable"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, deblock_disable) - 84usize];
    ["Offset of field: MppEncH264Cfg_t::deblock_offset_alpha"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, deblock_offset_alpha) - 88usize];
    ["Offset of field: MppEncH264Cfg_t::deblock_offset_beta"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, deblock_offset_beta) - 92usize];
    ["Offset of field: MppEncH264Cfg_t::use_longterm"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, use_longterm) - 96usize];
    ["Offset of field: MppEncH264Cfg_t::qp_init"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_init) - 100usize];
    ["Offset of field: MppEncH264Cfg_t::qp_max"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_max) - 104usize];
    ["Offset of field: MppEncH264Cfg_t::qp_max_i"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_max_i) - 106usize];
    ["Offset of field: MppEncH264Cfg_t::qp_min"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_min) - 108usize];
    ["Offset of field: MppEncH264Cfg_t::qp_min_i"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_min_i) - 110usize];
    ["Offset of field: MppEncH264Cfg_t::qp_max_step"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_max_step) - 112usize];
    ["Offset of field: MppEncH264Cfg_t::qp_delta_ip"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, qp_delta_ip) - 114usize];
    ["Offset of field: MppEncH264Cfg_t::intra_refresh_mode"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, intra_refresh_mode) - 116usize];
    ["Offset of field: MppEncH264Cfg_t::intra_refresh_arg"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, intra_refresh_arg) - 120usize];
    ["Offset of field: MppEncH264Cfg_t::max_ltr_frames"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, max_ltr_frames) - 124usize];
    ["Offset of field: MppEncH264Cfg_t::max_tid"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, max_tid) - 128usize];
    ["Offset of field: MppEncH264Cfg_t::prefix_mode"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, prefix_mode) - 132usize];
    ["Offset of field: MppEncH264Cfg_t::base_layer_pid"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, base_layer_pid) - 136usize];
    ["Offset of field: MppEncH264Cfg_t::constraint_set"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, constraint_set) - 140usize];
    ["Offset of field: MppEncH264Cfg_t::vui"]
        [::std::mem::offset_of!(MppEncH264Cfg_t, vui) - 144usize];
};
pub type MppEncH264Cfg = MppEncH264Cfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct H265eRect_t {
    pub left: RK_S32,
    pub right: RK_S32,
    pub top: RK_S32,
    pub bottom: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of H265eRect_t"][::std::mem::size_of::<H265eRect_t>() - 16usize];
    ["Alignment of H265eRect_t"][::std::mem::align_of::<H265eRect_t>() - 4usize];
    ["Offset of field: H265eRect_t::left"][::std::mem::offset_of!(H265eRect_t, left) - 0usize];
    ["Offset of field: H265eRect_t::right"][::std::mem::offset_of!(H265eRect_t, right) - 4usize];
    ["Offset of field: H265eRect_t::top"][::std::mem::offset_of!(H265eRect_t, top) - 8usize];
    ["Offset of field: H265eRect_t::bottom"][::std::mem::offset_of!(H265eRect_t, bottom) - 12usize];
};
pub type H265eRect = H265eRect_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct H265eRoi_Region_t {
    pub level: RK_U8,
    pub rect: H265eRect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of H265eRoi_Region_t"][::std::mem::size_of::<H265eRoi_Region_t>() - 20usize];
    ["Alignment of H265eRoi_Region_t"][::std::mem::align_of::<H265eRoi_Region_t>() - 4usize];
    ["Offset of field: H265eRoi_Region_t::level"]
        [::std::mem::offset_of!(H265eRoi_Region_t, level) - 0usize];
    ["Offset of field: H265eRoi_Region_t::rect"]
        [::std::mem::offset_of!(H265eRoi_Region_t, rect) - 4usize];
};
pub type H265eRoiRegion = H265eRoi_Region_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265RoiCfg_t {
    pub method: RK_U8,
    pub num: RK_S32,
    pub delta_qp: RK_U32,
    pub region: [H265eRoiRegion; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265RoiCfg_t"][::std::mem::size_of::<MppEncH265RoiCfg_t>() - 1292usize];
    ["Alignment of MppEncH265RoiCfg_t"][::std::mem::align_of::<MppEncH265RoiCfg_t>() - 4usize];
    ["Offset of field: MppEncH265RoiCfg_t::method"]
        [::std::mem::offset_of!(MppEncH265RoiCfg_t, method) - 0usize];
    ["Offset of field: MppEncH265RoiCfg_t::num"]
        [::std::mem::offset_of!(MppEncH265RoiCfg_t, num) - 4usize];
    ["Offset of field: MppEncH265RoiCfg_t::delta_qp"]
        [::std::mem::offset_of!(MppEncH265RoiCfg_t, delta_qp) - 8usize];
    ["Offset of field: MppEncH265RoiCfg_t::region"]
        [::std::mem::offset_of!(MppEncH265RoiCfg_t, region) - 12usize];
};
pub type MppEncH265RoiCfg = MppEncH265RoiCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct H265eCtuQp_t {
    pub qp: RK_U32,
    pub rect: H265eRect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of H265eCtuQp_t"][::std::mem::size_of::<H265eCtuQp_t>() - 20usize];
    ["Alignment of H265eCtuQp_t"][::std::mem::align_of::<H265eCtuQp_t>() - 4usize];
    ["Offset of field: H265eCtuQp_t::qp"][::std::mem::offset_of!(H265eCtuQp_t, qp) - 0usize];
    ["Offset of field: H265eCtuQp_t::rect"][::std::mem::offset_of!(H265eCtuQp_t, rect) - 4usize];
};
pub type H265eCtu = H265eCtuQp_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct H265eCtuRegion_t {
    pub method: RK_U8,
    pub num: RK_S32,
    pub ctu: [H265eCtu; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of H265eCtuRegion_t"][::std::mem::size_of::<H265eCtuRegion_t>() - 1288usize];
    ["Alignment of H265eCtuRegion_t"][::std::mem::align_of::<H265eCtuRegion_t>() - 4usize];
    ["Offset of field: H265eCtuRegion_t::method"]
        [::std::mem::offset_of!(H265eCtuRegion_t, method) - 0usize];
    ["Offset of field: H265eCtuRegion_t::num"]
        [::std::mem::offset_of!(H265eCtuRegion_t, num) - 4usize];
    ["Offset of field: H265eCtuRegion_t::ctu"]
        [::std::mem::offset_of!(H265eCtuRegion_t, ctu) - 8usize];
};
pub type MppEncH265CtuCfg = H265eCtuRegion_t;
pub const H265eCtuMethod_H265E_METHOD_CTU_SIZE: H265eCtuMethod = 0;
pub const H265eCtuMethod_H264E_METHOD_COORDINATE: H265eCtuMethod = 1;
pub type H265eCtuMethod = ::std::os::raw::c_uint;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_PROFILE_LEVEL_TILER_CHANGE: MppEncH265CfgChange_e =
    1;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_INTRA_QP_CHANGE: MppEncH265CfgChange_e = 2;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_FRAME_RATE_CHANGE: MppEncH265CfgChange_e = 4;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_BITRATE_CHANGE: MppEncH265CfgChange_e = 8;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_GOP_SIZE: MppEncH265CfgChange_e = 16;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_RC_QP_CHANGE: MppEncH265CfgChange_e = 32;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_INTRA_REFRESH_CHANGE: MppEncH265CfgChange_e = 64;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_INDEPEND_SLICE_CHANGE: MppEncH265CfgChange_e = 128;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_DEPEND_SLICE_CHANGE: MppEncH265CfgChange_e = 256;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CTU_CHANGE: MppEncH265CfgChange_e = 512;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_ROI_CHANGE: MppEncH265CfgChange_e = 1024;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CU_CHANGE: MppEncH265CfgChange_e = 2048;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_DBLK_CHANGE: MppEncH265CfgChange_e = 4096;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_SAO_CHANGE: MppEncH265CfgChange_e = 8192;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_TRANS_CHANGE: MppEncH265CfgChange_e = 16384;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_SLICE_CHANGE: MppEncH265CfgChange_e = 32768;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_ENTROPY_CHANGE: MppEncH265CfgChange_e = 65536;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_MERGE_CHANGE: MppEncH265CfgChange_e = 131072;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_VUI: MppEncH265CfgChange_e = 262144;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_RC_I_QP_CHANGE: MppEncH265CfgChange_e = 524288;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_RC_MAX_QP_STEP_CHANGE: MppEncH265CfgChange_e =
    2097152;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_RC_IP_DELTA_QP_CHANGE: MppEncH265CfgChange_e =
    1048576;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_TILE_CHANGE: MppEncH265CfgChange_e = 4194304;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_SLICE_LPFACS_CHANGE: MppEncH265CfgChange_e =
    8388608;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_TILE_LPFACS_CHANGE: MppEncH265CfgChange_e =
    16777216;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_CONST_INTRA: MppEncH265CfgChange_e =
    33554432;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_LCU_SIZE: MppEncH265CfgChange_e = 67108864;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_MAX_TID: MppEncH265CfgChange_e = 134217728;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_MAX_LTR: MppEncH265CfgChange_e = 268435456;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_BASE_LAYER_PID: MppEncH265CfgChange_e =
    536870912;
pub const MppEncH265CfgChange_e_MPP_ENC_H265_CFG_CHANGE_ALL: MppEncH265CfgChange_e = 4294967295;
pub type MppEncH265CfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncH265CfgChange_e as MppEncH265CfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265SliceCfg_t {
    pub split_enable: RK_U32,
    pub split_mode: RK_U32,
    pub slice_size: RK_U32,
    pub slice_out: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265SliceCfg_t"][::std::mem::size_of::<MppEncH265SliceCfg_t>() - 16usize];
    ["Alignment of MppEncH265SliceCfg_t"][::std::mem::align_of::<MppEncH265SliceCfg_t>() - 4usize];
    ["Offset of field: MppEncH265SliceCfg_t::split_enable"]
        [::std::mem::offset_of!(MppEncH265SliceCfg_t, split_enable) - 0usize];
    ["Offset of field: MppEncH265SliceCfg_t::split_mode"]
        [::std::mem::offset_of!(MppEncH265SliceCfg_t, split_mode) - 4usize];
    ["Offset of field: MppEncH265SliceCfg_t::slice_size"]
        [::std::mem::offset_of!(MppEncH265SliceCfg_t, slice_size) - 8usize];
    ["Offset of field: MppEncH265SliceCfg_t::slice_out"]
        [::std::mem::offset_of!(MppEncH265SliceCfg_t, slice_out) - 12usize];
};
pub type MppEncH265SliceCfg = MppEncH265SliceCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265CuCfg_t {
    pub cu32x32_en: RK_U32,
    pub cu16x16_en: RK_U32,
    pub cu8x8_en: RK_U32,
    pub cu4x4_en: RK_U32,
    pub constrained_intra_pred_flag: RK_U32,
    pub strong_intra_smoothing_enabled_flag: RK_U32,
    pub pcm_enabled_flag: RK_U32,
    pub pcm_loop_filter_disabled_flag: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265CuCfg_t"][::std::mem::size_of::<MppEncH265CuCfg_t>() - 32usize];
    ["Alignment of MppEncH265CuCfg_t"][::std::mem::align_of::<MppEncH265CuCfg_t>() - 4usize];
    ["Offset of field: MppEncH265CuCfg_t::cu32x32_en"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, cu32x32_en) - 0usize];
    ["Offset of field: MppEncH265CuCfg_t::cu16x16_en"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, cu16x16_en) - 4usize];
    ["Offset of field: MppEncH265CuCfg_t::cu8x8_en"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, cu8x8_en) - 8usize];
    ["Offset of field: MppEncH265CuCfg_t::cu4x4_en"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, cu4x4_en) - 12usize];
    ["Offset of field: MppEncH265CuCfg_t::constrained_intra_pred_flag"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, constrained_intra_pred_flag) - 16usize];
    ["Offset of field: MppEncH265CuCfg_t::strong_intra_smoothing_enabled_flag"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, strong_intra_smoothing_enabled_flag) - 20usize];
    ["Offset of field: MppEncH265CuCfg_t::pcm_enabled_flag"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, pcm_enabled_flag) - 24usize];
    ["Offset of field: MppEncH265CuCfg_t::pcm_loop_filter_disabled_flag"]
        [::std::mem::offset_of!(MppEncH265CuCfg_t, pcm_loop_filter_disabled_flag) - 28usize];
};
pub type MppEncH265CuCfg = MppEncH265CuCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265RefCfg_t {
    pub num_lt_ref_pic: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265RefCfg_t"][::std::mem::size_of::<MppEncH265RefCfg_t>() - 4usize];
    ["Alignment of MppEncH265RefCfg_t"][::std::mem::align_of::<MppEncH265RefCfg_t>() - 4usize];
    ["Offset of field: MppEncH265RefCfg_t::num_lt_ref_pic"]
        [::std::mem::offset_of!(MppEncH265RefCfg_t, num_lt_ref_pic) - 0usize];
};
pub type MppEncH265RefCfg = MppEncH265RefCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265DblkCfg_t {
    pub slice_deblocking_filter_disabled_flag: RK_U32,
    pub slice_beta_offset_div2: RK_S32,
    pub slice_tc_offset_div2: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265DblkCfg_t"][::std::mem::size_of::<MppEncH265DblkCfg_t>() - 12usize];
    ["Alignment of MppEncH265DblkCfg_t"][::std::mem::align_of::<MppEncH265DblkCfg_t>() - 4usize];
    ["Offset of field: MppEncH265DblkCfg_t::slice_deblocking_filter_disabled_flag"][::std::mem::offset_of!(
        MppEncH265DblkCfg_t,
        slice_deblocking_filter_disabled_flag
    ) - 0usize];
    ["Offset of field: MppEncH265DblkCfg_t::slice_beta_offset_div2"]
        [::std::mem::offset_of!(MppEncH265DblkCfg_t, slice_beta_offset_div2) - 4usize];
    ["Offset of field: MppEncH265DblkCfg_t::slice_tc_offset_div2"]
        [::std::mem::offset_of!(MppEncH265DblkCfg_t, slice_tc_offset_div2) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265SaoCfg_t {
    pub slice_sao_luma_disable: RK_U32,
    pub slice_sao_chroma_disable: RK_U32,
    pub sao_bit_ratio: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265SaoCfg_t"][::std::mem::size_of::<MppEncH265SaoCfg_t>() - 12usize];
    ["Alignment of MppEncH265SaoCfg_t"][::std::mem::align_of::<MppEncH265SaoCfg_t>() - 4usize];
    ["Offset of field: MppEncH265SaoCfg_t::slice_sao_luma_disable"]
        [::std::mem::offset_of!(MppEncH265SaoCfg_t, slice_sao_luma_disable) - 0usize];
    ["Offset of field: MppEncH265SaoCfg_t::slice_sao_chroma_disable"]
        [::std::mem::offset_of!(MppEncH265SaoCfg_t, slice_sao_chroma_disable) - 4usize];
    ["Offset of field: MppEncH265SaoCfg_t::sao_bit_ratio"]
        [::std::mem::offset_of!(MppEncH265SaoCfg_t, sao_bit_ratio) - 8usize];
};
pub type MppEncH265SaoCfg = MppEncH265SaoCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265TransCfg_t {
    pub transquant_bypass_enabled_flag: RK_U32,
    pub transform_skip_enabled_flag: RK_U32,
    pub defalut_ScalingList_enable: RK_U32,
    pub cb_qp_offset: RK_S32,
    pub cr_qp_offset: RK_S32,
    pub diff_cu_qp_delta_depth: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265TransCfg_t"][::std::mem::size_of::<MppEncH265TransCfg_t>() - 24usize];
    ["Alignment of MppEncH265TransCfg_t"][::std::mem::align_of::<MppEncH265TransCfg_t>() - 4usize];
    ["Offset of field: MppEncH265TransCfg_t::transquant_bypass_enabled_flag"]
        [::std::mem::offset_of!(MppEncH265TransCfg_t, transquant_bypass_enabled_flag) - 0usize];
    ["Offset of field: MppEncH265TransCfg_t::transform_skip_enabled_flag"]
        [::std::mem::offset_of!(MppEncH265TransCfg_t, transform_skip_enabled_flag) - 4usize];
    ["Offset of field: MppEncH265TransCfg_t::defalut_ScalingList_enable"]
        [::std::mem::offset_of!(MppEncH265TransCfg_t, defalut_ScalingList_enable) - 8usize];
    ["Offset of field: MppEncH265TransCfg_t::cb_qp_offset"]
        [::std::mem::offset_of!(MppEncH265TransCfg_t, cb_qp_offset) - 12usize];
    ["Offset of field: MppEncH265TransCfg_t::cr_qp_offset"]
        [::std::mem::offset_of!(MppEncH265TransCfg_t, cr_qp_offset) - 16usize];
    ["Offset of field: MppEncH265TransCfg_t::diff_cu_qp_delta_depth"]
        [::std::mem::offset_of!(MppEncH265TransCfg_t, diff_cu_qp_delta_depth) - 20usize];
};
pub type MppEncH265TransCfg = MppEncH265TransCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265MergeCfg_t {
    pub max_mrg_cnd: RK_U32,
    pub merge_up_flag: RK_U32,
    pub merge_left_flag: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265MergeCfg_t"][::std::mem::size_of::<MppEncH265MergeCfg_t>() - 12usize];
    ["Alignment of MppEncH265MergeCfg_t"][::std::mem::align_of::<MppEncH265MergeCfg_t>() - 4usize];
    ["Offset of field: MppEncH265MergeCfg_t::max_mrg_cnd"]
        [::std::mem::offset_of!(MppEncH265MergeCfg_t, max_mrg_cnd) - 0usize];
    ["Offset of field: MppEncH265MergeCfg_t::merge_up_flag"]
        [::std::mem::offset_of!(MppEncH265MergeCfg_t, merge_up_flag) - 4usize];
    ["Offset of field: MppEncH265MergeCfg_t::merge_left_flag"]
        [::std::mem::offset_of!(MppEncH265MergeCfg_t, merge_left_flag) - 8usize];
};
pub type MppEncH265MergesCfg = MppEncH265MergeCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265EntropyCfg_t {
    pub cabac_init_flag: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265EntropyCfg_t"][::std::mem::size_of::<MppEncH265EntropyCfg_t>() - 4usize];
    ["Alignment of MppEncH265EntropyCfg_t"]
        [::std::mem::align_of::<MppEncH265EntropyCfg_t>() - 4usize];
    ["Offset of field: MppEncH265EntropyCfg_t::cabac_init_flag"]
        [::std::mem::offset_of!(MppEncH265EntropyCfg_t, cabac_init_flag) - 0usize];
};
pub type MppEncH265EntropyCfg = MppEncH265EntropyCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncH265Cfg_t {
    pub change: RK_U32,
    pub profile: RK_S32,
    pub level: RK_S32,
    pub tier: RK_S32,
    pub const_intra_pred: RK_S32,
    pub ctu_size: RK_S32,
    pub max_cu_size: RK_S32,
    pub tmvp_enable: RK_S32,
    pub amp_enable: RK_S32,
    pub wpp_enable: RK_S32,
    pub merge_range: RK_S32,
    pub sao_enable: RK_S32,
    pub num_ref: RK_U32,
    pub max_qp: RK_S32,
    pub min_qp: RK_S32,
    pub max_i_qp: RK_S32,
    pub min_i_qp: RK_S32,
    pub ip_qp_delta: RK_S32,
    pub max_delta_qp: RK_S32,
    pub intra_qp: RK_S32,
    pub gop_delta_qp: RK_S32,
    pub qp_init: RK_S32,
    pub qp_max_step: RK_S32,
    pub raw_dealt_qp: RK_S32,
    pub qpmax_map: [RK_U8; 8usize],
    pub qpmin_map: [RK_U8; 8usize],
    pub qpmap_mode: RK_S32,
    pub intra_refresh_mode: RK_S32,
    pub intra_refresh_arg: RK_S32,
    pub max_ltr_frames: RK_S32,
    pub max_tid: RK_S32,
    pub base_layer_pid: RK_S32,
    pub independ_slice_mode: RK_S32,
    pub independ_slice_arg: RK_S32,
    pub depend_slice_mode: RK_S32,
    pub depend_slice_arg: RK_S32,
    pub cu_cfg: MppEncH265CuCfg,
    pub slice_cfg: MppEncH265SliceCfg,
    pub entropy_cfg: MppEncH265EntropyCfg,
    pub trans_cfg: MppEncH265TransCfg,
    pub sao_cfg: MppEncH265SaoCfg,
    pub dblk_cfg: MppEncH265DblkCfg_t,
    pub ref_cfg: MppEncH265RefCfg,
    pub merge_cfg: MppEncH265MergesCfg,
    pub auto_tile: RK_S32,
    pub lpf_acs_sli_en: RK_U32,
    pub lpf_acs_tile_disable: RK_U32,
    pub vui: MppEncVuiCfg,
    pub ctu: MppEncH265CtuCfg,
    pub roi: MppEncH265RoiCfg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncH265Cfg_t"][::std::mem::size_of::<MppEncH265Cfg_t>() - 2884usize];
    ["Alignment of MppEncH265Cfg_t"][::std::mem::align_of::<MppEncH265Cfg_t>() - 4usize];
    ["Offset of field: MppEncH265Cfg_t::change"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, change) - 0usize];
    ["Offset of field: MppEncH265Cfg_t::profile"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, profile) - 4usize];
    ["Offset of field: MppEncH265Cfg_t::level"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, level) - 8usize];
    ["Offset of field: MppEncH265Cfg_t::tier"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, tier) - 12usize];
    ["Offset of field: MppEncH265Cfg_t::const_intra_pred"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, const_intra_pred) - 16usize];
    ["Offset of field: MppEncH265Cfg_t::ctu_size"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, ctu_size) - 20usize];
    ["Offset of field: MppEncH265Cfg_t::max_cu_size"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, max_cu_size) - 24usize];
    ["Offset of field: MppEncH265Cfg_t::tmvp_enable"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, tmvp_enable) - 28usize];
    ["Offset of field: MppEncH265Cfg_t::amp_enable"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, amp_enable) - 32usize];
    ["Offset of field: MppEncH265Cfg_t::wpp_enable"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, wpp_enable) - 36usize];
    ["Offset of field: MppEncH265Cfg_t::merge_range"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, merge_range) - 40usize];
    ["Offset of field: MppEncH265Cfg_t::sao_enable"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, sao_enable) - 44usize];
    ["Offset of field: MppEncH265Cfg_t::num_ref"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, num_ref) - 48usize];
    ["Offset of field: MppEncH265Cfg_t::max_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, max_qp) - 52usize];
    ["Offset of field: MppEncH265Cfg_t::min_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, min_qp) - 56usize];
    ["Offset of field: MppEncH265Cfg_t::max_i_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, max_i_qp) - 60usize];
    ["Offset of field: MppEncH265Cfg_t::min_i_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, min_i_qp) - 64usize];
    ["Offset of field: MppEncH265Cfg_t::ip_qp_delta"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, ip_qp_delta) - 68usize];
    ["Offset of field: MppEncH265Cfg_t::max_delta_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, max_delta_qp) - 72usize];
    ["Offset of field: MppEncH265Cfg_t::intra_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, intra_qp) - 76usize];
    ["Offset of field: MppEncH265Cfg_t::gop_delta_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, gop_delta_qp) - 80usize];
    ["Offset of field: MppEncH265Cfg_t::qp_init"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, qp_init) - 84usize];
    ["Offset of field: MppEncH265Cfg_t::qp_max_step"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, qp_max_step) - 88usize];
    ["Offset of field: MppEncH265Cfg_t::raw_dealt_qp"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, raw_dealt_qp) - 92usize];
    ["Offset of field: MppEncH265Cfg_t::qpmax_map"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, qpmax_map) - 96usize];
    ["Offset of field: MppEncH265Cfg_t::qpmin_map"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, qpmin_map) - 104usize];
    ["Offset of field: MppEncH265Cfg_t::qpmap_mode"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, qpmap_mode) - 112usize];
    ["Offset of field: MppEncH265Cfg_t::intra_refresh_mode"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, intra_refresh_mode) - 116usize];
    ["Offset of field: MppEncH265Cfg_t::intra_refresh_arg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, intra_refresh_arg) - 120usize];
    ["Offset of field: MppEncH265Cfg_t::max_ltr_frames"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, max_ltr_frames) - 124usize];
    ["Offset of field: MppEncH265Cfg_t::max_tid"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, max_tid) - 128usize];
    ["Offset of field: MppEncH265Cfg_t::base_layer_pid"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, base_layer_pid) - 132usize];
    ["Offset of field: MppEncH265Cfg_t::independ_slice_mode"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, independ_slice_mode) - 136usize];
    ["Offset of field: MppEncH265Cfg_t::independ_slice_arg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, independ_slice_arg) - 140usize];
    ["Offset of field: MppEncH265Cfg_t::depend_slice_mode"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, depend_slice_mode) - 144usize];
    ["Offset of field: MppEncH265Cfg_t::depend_slice_arg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, depend_slice_arg) - 148usize];
    ["Offset of field: MppEncH265Cfg_t::cu_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, cu_cfg) - 152usize];
    ["Offset of field: MppEncH265Cfg_t::slice_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, slice_cfg) - 184usize];
    ["Offset of field: MppEncH265Cfg_t::entropy_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, entropy_cfg) - 200usize];
    ["Offset of field: MppEncH265Cfg_t::trans_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, trans_cfg) - 204usize];
    ["Offset of field: MppEncH265Cfg_t::sao_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, sao_cfg) - 228usize];
    ["Offset of field: MppEncH265Cfg_t::dblk_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, dblk_cfg) - 240usize];
    ["Offset of field: MppEncH265Cfg_t::ref_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, ref_cfg) - 252usize];
    ["Offset of field: MppEncH265Cfg_t::merge_cfg"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, merge_cfg) - 256usize];
    ["Offset of field: MppEncH265Cfg_t::auto_tile"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, auto_tile) - 268usize];
    ["Offset of field: MppEncH265Cfg_t::lpf_acs_sli_en"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, lpf_acs_sli_en) - 272usize];
    ["Offset of field: MppEncH265Cfg_t::lpf_acs_tile_disable"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, lpf_acs_tile_disable) - 276usize];
    ["Offset of field: MppEncH265Cfg_t::vui"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, vui) - 280usize];
    ["Offset of field: MppEncH265Cfg_t::ctu"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, ctu) - 304usize];
    ["Offset of field: MppEncH265Cfg_t::roi"]
        [::std::mem::offset_of!(MppEncH265Cfg_t, roi) - 1592usize];
};
pub type MppEncH265Cfg = MppEncH265Cfg_t;
pub const MppEncJpegCfgChange_e_MPP_ENC_JPEG_CFG_CHANGE_QP: MppEncJpegCfgChange_e = 1;
pub const MppEncJpegCfgChange_e_MPP_ENC_JPEG_CFG_CHANGE_QTABLE: MppEncJpegCfgChange_e = 2;
pub const MppEncJpegCfgChange_e_MPP_ENC_JPEG_CFG_CHANGE_QFACTOR: MppEncJpegCfgChange_e = 4;
pub const MppEncJpegCfgChange_e_MPP_ENC_JPEG_CFG_CHANGE_ALL: MppEncJpegCfgChange_e = 4294967295;
pub type MppEncJpegCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncJpegCfgChange_e as MppEncJpegCfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncJpegCfg_t {
    pub change: RK_U32,
    pub quant: RK_S32,
    pub q_factor: RK_S32,
    pub qf_max: RK_S32,
    pub qf_min: RK_S32,
    pub qtable_y: *mut RK_U8,
    pub qtable_u: *mut RK_U8,
    pub qtable_v: *mut RK_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncJpegCfg_t"][::std::mem::size_of::<MppEncJpegCfg_t>() - 48usize];
    ["Alignment of MppEncJpegCfg_t"][::std::mem::align_of::<MppEncJpegCfg_t>() - 8usize];
    ["Offset of field: MppEncJpegCfg_t::change"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, change) - 0usize];
    ["Offset of field: MppEncJpegCfg_t::quant"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, quant) - 4usize];
    ["Offset of field: MppEncJpegCfg_t::q_factor"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, q_factor) - 8usize];
    ["Offset of field: MppEncJpegCfg_t::qf_max"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, qf_max) - 12usize];
    ["Offset of field: MppEncJpegCfg_t::qf_min"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, qf_min) - 16usize];
    ["Offset of field: MppEncJpegCfg_t::qtable_y"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, qtable_y) - 24usize];
    ["Offset of field: MppEncJpegCfg_t::qtable_u"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, qtable_u) - 32usize];
    ["Offset of field: MppEncJpegCfg_t::qtable_v"]
        [::std::mem::offset_of!(MppEncJpegCfg_t, qtable_v) - 40usize];
};
pub type MppEncJpegCfg = MppEncJpegCfg_t;
pub const MppEncVP8CfgChange_e_MPP_ENC_VP8_CFG_CHANGE_QP: MppEncVP8CfgChange_e = 1;
pub const MppEncVP8CfgChange_e_MPP_ENC_VP8_CFG_CHANGE_DIS_IVF: MppEncVP8CfgChange_e = 2;
pub const MppEncVP8CfgChange_e_MPP_ENC_VP8_CFG_CHANGE_ALL: MppEncVP8CfgChange_e = 4294967295;
pub type MppEncVP8CfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncVP8CfgChange_e as MppEncVP8CfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncVp8Cfg_t {
    pub change: RK_U32,
    pub quant: RK_S32,
    pub qp_init: RK_S32,
    pub qp_max: RK_S32,
    pub qp_max_i: RK_S32,
    pub qp_min: RK_S32,
    pub qp_min_i: RK_S32,
    pub qp_max_step: RK_S32,
    pub disable_ivf: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncVp8Cfg_t"][::std::mem::size_of::<MppEncVp8Cfg_t>() - 36usize];
    ["Alignment of MppEncVp8Cfg_t"][::std::mem::align_of::<MppEncVp8Cfg_t>() - 4usize];
    ["Offset of field: MppEncVp8Cfg_t::change"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, change) - 0usize];
    ["Offset of field: MppEncVp8Cfg_t::quant"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, quant) - 4usize];
    ["Offset of field: MppEncVp8Cfg_t::qp_init"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, qp_init) - 8usize];
    ["Offset of field: MppEncVp8Cfg_t::qp_max"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, qp_max) - 12usize];
    ["Offset of field: MppEncVp8Cfg_t::qp_max_i"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, qp_max_i) - 16usize];
    ["Offset of field: MppEncVp8Cfg_t::qp_min"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, qp_min) - 20usize];
    ["Offset of field: MppEncVp8Cfg_t::qp_min_i"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, qp_min_i) - 24usize];
    ["Offset of field: MppEncVp8Cfg_t::qp_max_step"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, qp_max_step) - 28usize];
    ["Offset of field: MppEncVp8Cfg_t::disable_ivf"]
        [::std::mem::offset_of!(MppEncVp8Cfg_t, disable_ivf) - 32usize];
};
pub type MppEncVp8Cfg = MppEncVp8Cfg_t;
#[doc = " @ingroup rk_mpi\n @brief MPP encoder codec configuration parameters\n @details The encoder codec configuration parameters are different for each\n          compression codings. For example, H.264 encoder can configure\n          profile, level, qp, etc. while jpeg encoder can configure qp\n          only. The detailed parameters can refer the corresponding data\n          structure such as MppEncH264Cfg and MppEncJpegCfg. This data\n          structure is associated with MPP_ENC_SET_CODEC_CFG command."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MppEncCodecCfg_t {
    pub coding: MppCodingType,
    pub __bindgen_anon_1: MppEncCodecCfg_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union MppEncCodecCfg_t__bindgen_ty_1 {
    pub change: RK_U32,
    pub h264: MppEncH264Cfg,
    pub h265: MppEncH265Cfg,
    pub jpeg: MppEncJpegCfg,
    pub vp8: MppEncVp8Cfg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncCodecCfg_t__bindgen_ty_1"]
        [::std::mem::size_of::<MppEncCodecCfg_t__bindgen_ty_1>() - 2888usize];
    ["Alignment of MppEncCodecCfg_t__bindgen_ty_1"]
        [::std::mem::align_of::<MppEncCodecCfg_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: MppEncCodecCfg_t__bindgen_ty_1::change"]
        [::std::mem::offset_of!(MppEncCodecCfg_t__bindgen_ty_1, change) - 0usize];
    ["Offset of field: MppEncCodecCfg_t__bindgen_ty_1::h264"]
        [::std::mem::offset_of!(MppEncCodecCfg_t__bindgen_ty_1, h264) - 0usize];
    ["Offset of field: MppEncCodecCfg_t__bindgen_ty_1::h265"]
        [::std::mem::offset_of!(MppEncCodecCfg_t__bindgen_ty_1, h265) - 0usize];
    ["Offset of field: MppEncCodecCfg_t__bindgen_ty_1::jpeg"]
        [::std::mem::offset_of!(MppEncCodecCfg_t__bindgen_ty_1, jpeg) - 0usize];
    ["Offset of field: MppEncCodecCfg_t__bindgen_ty_1::vp8"]
        [::std::mem::offset_of!(MppEncCodecCfg_t__bindgen_ty_1, vp8) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncCodecCfg_t"][::std::mem::size_of::<MppEncCodecCfg_t>() - 2896usize];
    ["Alignment of MppEncCodecCfg_t"][::std::mem::align_of::<MppEncCodecCfg_t>() - 8usize];
    ["Offset of field: MppEncCodecCfg_t::coding"]
        [::std::mem::offset_of!(MppEncCodecCfg_t, coding) - 0usize];
};
#[doc = " @ingroup rk_mpi\n @brief MPP encoder codec configuration parameters\n @details The encoder codec configuration parameters are different for each\n          compression codings. For example, H.264 encoder can configure\n          profile, level, qp, etc. while jpeg encoder can configure qp\n          only. The detailed parameters can refer the corresponding data\n          structure such as MppEncH264Cfg and MppEncJpegCfg. This data\n          structure is associated with MPP_ENC_SET_CODEC_CFG command."]
pub type MppEncCodecCfg = MppEncCodecCfg_t;
pub const MppEncSliceSplit_e_MPP_ENC_SPLIT_CFG_CHANGE_MODE: MppEncSliceSplit_e = 1;
pub const MppEncSliceSplit_e_MPP_ENC_SPLIT_CFG_CHANGE_ARG: MppEncSliceSplit_e = 2;
pub const MppEncSliceSplit_e_MPP_ENC_SPLIT_CFG_CHANGE_OUTPUT: MppEncSliceSplit_e = 4;
pub const MppEncSliceSplit_e_MPP_ENC_SPLIT_CFG_CHANGE_ALL: MppEncSliceSplit_e = 4294967295;
pub type MppEncSliceSplit_e = ::std::os::raw::c_uint;
pub use self::MppEncSliceSplit_e as MppEncSliceSplitChange;
pub const MppEncSplitMode_e_MPP_ENC_SPLIT_NONE: MppEncSplitMode_e = 0;
pub const MppEncSplitMode_e_MPP_ENC_SPLIT_BY_BYTE: MppEncSplitMode_e = 1;
pub const MppEncSplitMode_e_MPP_ENC_SPLIT_BY_CTU: MppEncSplitMode_e = 2;
pub type MppEncSplitMode_e = ::std::os::raw::c_uint;
pub use self::MppEncSplitMode_e as MppEncSplitMode;
pub const MppEncSplitOutMode_e_MPP_ENC_SPLIT_OUT_LOWDELAY: MppEncSplitOutMode_e = 1;
pub const MppEncSplitOutMode_e_MPP_ENC_SPLIT_OUT_SEGMENT: MppEncSplitOutMode_e = 2;
pub type MppEncSplitOutMode_e = ::std::os::raw::c_uint;
pub use self::MppEncSplitOutMode_e as MppEncSplitOutMode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncSliceSplit_t {
    pub change: RK_U32,
    pub split_mode: RK_U32,
    pub split_arg: RK_U32,
    pub split_out: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncSliceSplit_t"][::std::mem::size_of::<MppEncSliceSplit_t>() - 16usize];
    ["Alignment of MppEncSliceSplit_t"][::std::mem::align_of::<MppEncSliceSplit_t>() - 4usize];
    ["Offset of field: MppEncSliceSplit_t::change"]
        [::std::mem::offset_of!(MppEncSliceSplit_t, change) - 0usize];
    ["Offset of field: MppEncSliceSplit_t::split_mode"]
        [::std::mem::offset_of!(MppEncSliceSplit_t, split_mode) - 4usize];
    ["Offset of field: MppEncSliceSplit_t::split_arg"]
        [::std::mem::offset_of!(MppEncSliceSplit_t, split_arg) - 8usize];
    ["Offset of field: MppEncSliceSplit_t::split_out"]
        [::std::mem::offset_of!(MppEncSliceSplit_t, split_out) - 12usize];
};
pub type MppEncSliceSplit = MppEncSliceSplit_t;
#[doc = " @brief Mpp ROI parameter\n        Region configure define a rectangle as ROI\n @note  x, y, w, h are calculated in pixels, which had better be 16-pixel aligned.\n        These parameters MUST retain in memory when encoder is running.\n        Both absolute qp and relative qp are supported in vepu541.\n        Only absolute qp is supported in rv1108"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncROIRegion_t {
    #[doc = "< horizontal position of top left corner"]
    pub x: RK_U16,
    #[doc = "< vertical position of top left corner"]
    pub y: RK_U16,
    #[doc = "< width of ROI rectangle"]
    pub w: RK_U16,
    #[doc = "< height of ROI rectangle"]
    pub h: RK_U16,
    #[doc = "< flag of forced intra macroblock"]
    pub intra: RK_U16,
    #[doc = "< absolute / relative qp of macroblock"]
    pub quality: RK_S16,
    #[doc = "< qp min max area select"]
    pub qp_area_idx: RK_U16,
    #[doc = "< enable area map"]
    pub area_map_en: RK_U8,
    #[doc = "< absolute qp enable flag"]
    pub abs_qp_en: RK_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncROIRegion_t"][::std::mem::size_of::<MppEncROIRegion_t>() - 16usize];
    ["Alignment of MppEncROIRegion_t"][::std::mem::align_of::<MppEncROIRegion_t>() - 2usize];
    ["Offset of field: MppEncROIRegion_t::x"]
        [::std::mem::offset_of!(MppEncROIRegion_t, x) - 0usize];
    ["Offset of field: MppEncROIRegion_t::y"]
        [::std::mem::offset_of!(MppEncROIRegion_t, y) - 2usize];
    ["Offset of field: MppEncROIRegion_t::w"]
        [::std::mem::offset_of!(MppEncROIRegion_t, w) - 4usize];
    ["Offset of field: MppEncROIRegion_t::h"]
        [::std::mem::offset_of!(MppEncROIRegion_t, h) - 6usize];
    ["Offset of field: MppEncROIRegion_t::intra"]
        [::std::mem::offset_of!(MppEncROIRegion_t, intra) - 8usize];
    ["Offset of field: MppEncROIRegion_t::quality"]
        [::std::mem::offset_of!(MppEncROIRegion_t, quality) - 10usize];
    ["Offset of field: MppEncROIRegion_t::qp_area_idx"]
        [::std::mem::offset_of!(MppEncROIRegion_t, qp_area_idx) - 12usize];
    ["Offset of field: MppEncROIRegion_t::area_map_en"]
        [::std::mem::offset_of!(MppEncROIRegion_t, area_map_en) - 14usize];
    ["Offset of field: MppEncROIRegion_t::abs_qp_en"]
        [::std::mem::offset_of!(MppEncROIRegion_t, abs_qp_en) - 15usize];
};
#[doc = " @brief Mpp ROI parameter\n        Region configure define a rectangle as ROI\n @note  x, y, w, h are calculated in pixels, which had better be 16-pixel aligned.\n        These parameters MUST retain in memory when encoder is running.\n        Both absolute qp and relative qp are supported in vepu541.\n        Only absolute qp is supported in rv1108"]
pub type MppEncROIRegion = MppEncROIRegion_t;
#[doc = " @brief MPP encoder's ROI configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncROICfg_t {
    #[doc = "< ROI rectangle number"]
    pub number: RK_U32,
    #[doc = "< ROI parameters"]
    pub regions: *mut MppEncROIRegion,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncROICfg_t"][::std::mem::size_of::<MppEncROICfg_t>() - 16usize];
    ["Alignment of MppEncROICfg_t"][::std::mem::align_of::<MppEncROICfg_t>() - 8usize];
    ["Offset of field: MppEncROICfg_t::number"]
        [::std::mem::offset_of!(MppEncROICfg_t, number) - 0usize];
    ["Offset of field: MppEncROICfg_t::regions"]
        [::std::mem::offset_of!(MppEncROICfg_t, regions) - 8usize];
};
#[doc = " @brief MPP encoder's ROI configuration"]
pub type MppEncROICfg = MppEncROICfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncROICfg0_t {
    #[doc = "< change flag"]
    pub change: RK_U32,
    #[doc = "< ROI rectangle number"]
    pub number: RK_U32,
    #[doc = "< ROI parameters"]
    pub regions: [MppEncROIRegion; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncROICfg0_t"][::std::mem::size_of::<MppEncROICfg0_t>() - 136usize];
    ["Alignment of MppEncROICfg0_t"][::std::mem::align_of::<MppEncROICfg0_t>() - 4usize];
    ["Offset of field: MppEncROICfg0_t::change"]
        [::std::mem::offset_of!(MppEncROICfg0_t, change) - 0usize];
    ["Offset of field: MppEncROICfg0_t::number"]
        [::std::mem::offset_of!(MppEncROICfg0_t, number) - 4usize];
    ["Offset of field: MppEncROICfg0_t::regions"]
        [::std::mem::offset_of!(MppEncROICfg0_t, regions) - 8usize];
};
pub type MppEncROICfgLegacy = MppEncROICfg0_t;
#[doc = " @brief Mpp ROI parameter for vepu54x / vepu58x\n @note  These encoders have more complex roi configure structure.\n        User need to generate roi structure data for different soc.\n        And send buffers to encoder through metadata."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncROICfg2_t {
    pub base_cfg_buf: MppBuffer,
    pub qp_cfg_buf: MppBuffer,
    pub amv_cfg_buf: MppBuffer,
    pub mv_cfg_buf: MppBuffer,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub reserve: [RK_U32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncROICfg2_t"][::std::mem::size_of::<MppEncROICfg2_t>() - 48usize];
    ["Alignment of MppEncROICfg2_t"][::std::mem::align_of::<MppEncROICfg2_t>() - 8usize];
    ["Offset of field: MppEncROICfg2_t::base_cfg_buf"]
        [::std::mem::offset_of!(MppEncROICfg2_t, base_cfg_buf) - 0usize];
    ["Offset of field: MppEncROICfg2_t::qp_cfg_buf"]
        [::std::mem::offset_of!(MppEncROICfg2_t, qp_cfg_buf) - 8usize];
    ["Offset of field: MppEncROICfg2_t::amv_cfg_buf"]
        [::std::mem::offset_of!(MppEncROICfg2_t, amv_cfg_buf) - 16usize];
    ["Offset of field: MppEncROICfg2_t::mv_cfg_buf"]
        [::std::mem::offset_of!(MppEncROICfg2_t, mv_cfg_buf) - 24usize];
    ["Offset of field: MppEncROICfg2_t::reserve"]
        [::std::mem::offset_of!(MppEncROICfg2_t, reserve) - 36usize];
};
impl MppEncROICfg2_t {
    #[inline]
    pub fn roi_qp_en(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_qp_en(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn roi_qp_en_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_roi_qp_en_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn roi_amv_en(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_amv_en(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn roi_amv_en_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_roi_amv_en_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn roi_mv_en(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_mv_en(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn roi_mv_en_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_roi_mv_en_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reserve_bits(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_reserve_bits(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserve_bits_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                29u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reserve_bits_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                29u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        roi_qp_en: RK_U32,
        roi_amv_en: RK_U32,
        roi_mv_en: RK_U32,
        reserve_bits: RK_U32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let roi_qp_en: u32 = unsafe { ::std::mem::transmute(roi_qp_en) };
            roi_qp_en as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let roi_amv_en: u32 = unsafe { ::std::mem::transmute(roi_amv_en) };
            roi_amv_en as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let roi_mv_en: u32 = unsafe { ::std::mem::transmute(roi_mv_en) };
            roi_mv_en as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let reserve_bits: u32 = unsafe { ::std::mem::transmute(reserve_bits) };
            reserve_bits as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief Mpp ROI parameter for vepu54x / vepu58x\n @note  These encoders have more complex roi configure structure.\n        User need to generate roi structure data for different soc.\n        And send buffers to encoder through metadata."]
pub type MppEncROICfg2 = MppEncROICfg2_t;
pub const MppEncOSDPltType_e_MPP_ENC_OSD_PLT_TYPE_DEFAULT: MppEncOSDPltType_e = 0;
pub const MppEncOSDPltType_e_MPP_ENC_OSD_PLT_TYPE_USERDEF: MppEncOSDPltType_e = 1;
pub const MppEncOSDPltType_e_MPP_ENC_OSD_PLT_TYPE_BUTT: MppEncOSDPltType_e = 2;
pub type MppEncOSDPltType_e = ::std::os::raw::c_uint;
pub use self::MppEncOSDPltType_e as MppEncOSDPltType;
#[repr(C)]
#[derive(Copy, Clone)]
pub union MppEncOSDPltVal_u {
    pub __bindgen_anon_1: MppEncOSDPltVal_u__bindgen_ty_1,
    pub val: RK_U32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDPltVal_u__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDPltVal_u__bindgen_ty_1"]
        [::std::mem::size_of::<MppEncOSDPltVal_u__bindgen_ty_1>() - 4usize];
    ["Alignment of MppEncOSDPltVal_u__bindgen_ty_1"]
        [::std::mem::align_of::<MppEncOSDPltVal_u__bindgen_ty_1>() - 4usize];
};
impl MppEncOSDPltVal_u__bindgen_ty_1 {
    #[inline]
    pub fn v(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_v(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn v_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_v_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn u(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_u(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn u_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_u_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn y(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_y(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn y_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_y_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn alpha(&self) -> RK_U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_alpha(&mut self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn alpha_raw(this: *const Self) -> RK_U32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_alpha_raw(this: *mut Self, val: RK_U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        v: RK_U32,
        u: RK_U32,
        y: RK_U32,
        alpha: RK_U32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let v: u32 = unsafe { ::std::mem::transmute(v) };
            v as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let u: u32 = unsafe { ::std::mem::transmute(u) };
            u as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let y: u32 = unsafe { ::std::mem::transmute(y) };
            y as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let alpha: u32 = unsafe { ::std::mem::transmute(alpha) };
            alpha as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDPltVal_u"][::std::mem::size_of::<MppEncOSDPltVal_u>() - 4usize];
    ["Alignment of MppEncOSDPltVal_u"][::std::mem::align_of::<MppEncOSDPltVal_u>() - 4usize];
    ["Offset of field: MppEncOSDPltVal_u::val"]
        [::std::mem::offset_of!(MppEncOSDPltVal_u, val) - 0usize];
};
pub type MppEncOSDPltVal = MppEncOSDPltVal_u;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MppEncOSDPlt_t {
    pub data: [MppEncOSDPltVal; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDPlt_t"][::std::mem::size_of::<MppEncOSDPlt_t>() - 1024usize];
    ["Alignment of MppEncOSDPlt_t"][::std::mem::align_of::<MppEncOSDPlt_t>() - 4usize];
    ["Offset of field: MppEncOSDPlt_t::data"]
        [::std::mem::offset_of!(MppEncOSDPlt_t, data) - 0usize];
};
pub type MppEncOSDPlt = MppEncOSDPlt_t;
pub const MppEncOSDPltCfgChange_e_MPP_ENC_OSD_PLT_CFG_CHANGE_MODE: MppEncOSDPltCfgChange_e = 1;
pub const MppEncOSDPltCfgChange_e_MPP_ENC_OSD_PLT_CFG_CHANGE_PLT_VAL: MppEncOSDPltCfgChange_e = 2;
pub const MppEncOSDPltCfgChange_e_MPP_ENC_OSD_PLT_CFG_CHANGE_ALL: MppEncOSDPltCfgChange_e =
    4294967295;
pub type MppEncOSDPltCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncOSDPltCfgChange_e as MppEncOSDPltCfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDPltCfg_t {
    pub change: RK_U32,
    pub type_: MppEncOSDPltType,
    pub plt: *mut MppEncOSDPlt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDPltCfg_t"][::std::mem::size_of::<MppEncOSDPltCfg_t>() - 16usize];
    ["Alignment of MppEncOSDPltCfg_t"][::std::mem::align_of::<MppEncOSDPltCfg_t>() - 8usize];
    ["Offset of field: MppEncOSDPltCfg_t::change"]
        [::std::mem::offset_of!(MppEncOSDPltCfg_t, change) - 0usize];
    ["Offset of field: MppEncOSDPltCfg_t::type_"]
        [::std::mem::offset_of!(MppEncOSDPltCfg_t, type_) - 4usize];
    ["Offset of field: MppEncOSDPltCfg_t::plt"]
        [::std::mem::offset_of!(MppEncOSDPltCfg_t, plt) - 8usize];
};
pub type MppEncOSDPltCfg = MppEncOSDPltCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDRegion_t {
    pub enable: RK_U32,
    pub inverse: RK_U32,
    pub start_mb_x: RK_U32,
    pub start_mb_y: RK_U32,
    pub num_mb_x: RK_U32,
    pub num_mb_y: RK_U32,
    pub buf_offset: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDRegion_t"][::std::mem::size_of::<MppEncOSDRegion_t>() - 28usize];
    ["Alignment of MppEncOSDRegion_t"][::std::mem::align_of::<MppEncOSDRegion_t>() - 4usize];
    ["Offset of field: MppEncOSDRegion_t::enable"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, enable) - 0usize];
    ["Offset of field: MppEncOSDRegion_t::inverse"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, inverse) - 4usize];
    ["Offset of field: MppEncOSDRegion_t::start_mb_x"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, start_mb_x) - 8usize];
    ["Offset of field: MppEncOSDRegion_t::start_mb_y"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, start_mb_y) - 12usize];
    ["Offset of field: MppEncOSDRegion_t::num_mb_x"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, num_mb_x) - 16usize];
    ["Offset of field: MppEncOSDRegion_t::num_mb_y"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, num_mb_y) - 20usize];
    ["Offset of field: MppEncOSDRegion_t::buf_offset"]
        [::std::mem::offset_of!(MppEncOSDRegion_t, buf_offset) - 24usize];
};
pub type MppEncOSDRegion = MppEncOSDRegion_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDData_t {
    pub buf: MppBuffer,
    pub num_region: RK_U32,
    pub region: [MppEncOSDRegion; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDData_t"][::std::mem::size_of::<MppEncOSDData_t>() - 240usize];
    ["Alignment of MppEncOSDData_t"][::std::mem::align_of::<MppEncOSDData_t>() - 8usize];
    ["Offset of field: MppEncOSDData_t::buf"]
        [::std::mem::offset_of!(MppEncOSDData_t, buf) - 0usize];
    ["Offset of field: MppEncOSDData_t::num_region"]
        [::std::mem::offset_of!(MppEncOSDData_t, num_region) - 8usize];
    ["Offset of field: MppEncOSDData_t::region"]
        [::std::mem::offset_of!(MppEncOSDData_t, region) - 12usize];
};
pub type MppEncOSDData = MppEncOSDData_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDRegion2_t {
    pub enable: RK_U32,
    pub inverse: RK_U32,
    pub start_mb_x: RK_U32,
    pub start_mb_y: RK_U32,
    pub num_mb_x: RK_U32,
    pub num_mb_y: RK_U32,
    pub buf_offset: RK_U32,
    pub buf: MppBuffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDRegion2_t"][::std::mem::size_of::<MppEncOSDRegion2_t>() - 40usize];
    ["Alignment of MppEncOSDRegion2_t"][::std::mem::align_of::<MppEncOSDRegion2_t>() - 8usize];
    ["Offset of field: MppEncOSDRegion2_t::enable"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, enable) - 0usize];
    ["Offset of field: MppEncOSDRegion2_t::inverse"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, inverse) - 4usize];
    ["Offset of field: MppEncOSDRegion2_t::start_mb_x"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, start_mb_x) - 8usize];
    ["Offset of field: MppEncOSDRegion2_t::start_mb_y"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, start_mb_y) - 12usize];
    ["Offset of field: MppEncOSDRegion2_t::num_mb_x"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, num_mb_x) - 16usize];
    ["Offset of field: MppEncOSDRegion2_t::num_mb_y"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, num_mb_y) - 20usize];
    ["Offset of field: MppEncOSDRegion2_t::buf_offset"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, buf_offset) - 24usize];
    ["Offset of field: MppEncOSDRegion2_t::buf"]
        [::std::mem::offset_of!(MppEncOSDRegion2_t, buf) - 32usize];
};
pub type MppEncOSDRegion2 = MppEncOSDRegion2_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDData2_t {
    pub num_region: RK_U32,
    pub region: [MppEncOSDRegion2; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDData2_t"][::std::mem::size_of::<MppEncOSDData2_t>() - 328usize];
    ["Alignment of MppEncOSDData2_t"][::std::mem::align_of::<MppEncOSDData2_t>() - 8usize];
    ["Offset of field: MppEncOSDData2_t::num_region"]
        [::std::mem::offset_of!(MppEncOSDData2_t, num_region) - 0usize];
    ["Offset of field: MppEncOSDData2_t::region"]
        [::std::mem::offset_of!(MppEncOSDData2_t, region) - 8usize];
};
pub type MppEncOSDData2 = MppEncOSDData2_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppOsdBuf_t {
    pub fd: RK_S32,
    pub buf: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppOsdBuf_t"][::std::mem::size_of::<MppOsdBuf_t>() - 16usize];
    ["Alignment of MppOsdBuf_t"][::std::mem::align_of::<MppOsdBuf_t>() - 8usize];
    ["Offset of field: MppOsdBuf_t::fd"][::std::mem::offset_of!(MppOsdBuf_t, fd) - 0usize];
    ["Offset of field: MppOsdBuf_t::buf"][::std::mem::offset_of!(MppOsdBuf_t, buf) - 8usize];
};
pub type MppOsdBuf = MppOsdBuf_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EncOSDInvCfg_t {
    pub yg_inv_en: RK_U32,
    pub uvrb_inv_en: RK_U32,
    pub alpha_inv_en: RK_U32,
    pub inv_sel: RK_U32,
    pub uv_sw_inv_en: RK_U32,
    pub inv_size: RK_U32,
    pub inv_stride: RK_U32,
    pub inv_buf: MppOsdBuf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EncOSDInvCfg_t"][::std::mem::size_of::<EncOSDInvCfg_t>() - 48usize];
    ["Alignment of EncOSDInvCfg_t"][::std::mem::align_of::<EncOSDInvCfg_t>() - 8usize];
    ["Offset of field: EncOSDInvCfg_t::yg_inv_en"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, yg_inv_en) - 0usize];
    ["Offset of field: EncOSDInvCfg_t::uvrb_inv_en"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, uvrb_inv_en) - 4usize];
    ["Offset of field: EncOSDInvCfg_t::alpha_inv_en"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, alpha_inv_en) - 8usize];
    ["Offset of field: EncOSDInvCfg_t::inv_sel"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, inv_sel) - 12usize];
    ["Offset of field: EncOSDInvCfg_t::uv_sw_inv_en"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, uv_sw_inv_en) - 16usize];
    ["Offset of field: EncOSDInvCfg_t::inv_size"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, inv_size) - 20usize];
    ["Offset of field: EncOSDInvCfg_t::inv_stride"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, inv_stride) - 24usize];
    ["Offset of field: EncOSDInvCfg_t::inv_buf"]
        [::std::mem::offset_of!(EncOSDInvCfg_t, inv_buf) - 32usize];
};
pub type EncOSDInvCfg = EncOSDInvCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EncOSDAlphaCfg_t {
    pub alpha_swap: RK_U32,
    pub bg_alpha: RK_U32,
    pub fg_alpha: RK_U32,
    pub fg_alpha_sel: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EncOSDAlphaCfg_t"][::std::mem::size_of::<EncOSDAlphaCfg_t>() - 16usize];
    ["Alignment of EncOSDAlphaCfg_t"][::std::mem::align_of::<EncOSDAlphaCfg_t>() - 4usize];
    ["Offset of field: EncOSDAlphaCfg_t::alpha_swap"]
        [::std::mem::offset_of!(EncOSDAlphaCfg_t, alpha_swap) - 0usize];
    ["Offset of field: EncOSDAlphaCfg_t::bg_alpha"]
        [::std::mem::offset_of!(EncOSDAlphaCfg_t, bg_alpha) - 4usize];
    ["Offset of field: EncOSDAlphaCfg_t::fg_alpha"]
        [::std::mem::offset_of!(EncOSDAlphaCfg_t, fg_alpha) - 8usize];
    ["Offset of field: EncOSDAlphaCfg_t::fg_alpha_sel"]
        [::std::mem::offset_of!(EncOSDAlphaCfg_t, fg_alpha_sel) - 12usize];
};
pub type EncOSDAlphaCfg = EncOSDAlphaCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EncOSDQpCfg_t {
    pub qp_adj_en: RK_U32,
    pub qp_adj_sel: RK_U32,
    pub qp: RK_S32,
    pub qp_max: RK_U32,
    pub qp_min: RK_U32,
    pub qp_prj: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EncOSDQpCfg_t"][::std::mem::size_of::<EncOSDQpCfg_t>() - 24usize];
    ["Alignment of EncOSDQpCfg_t"][::std::mem::align_of::<EncOSDQpCfg_t>() - 4usize];
    ["Offset of field: EncOSDQpCfg_t::qp_adj_en"]
        [::std::mem::offset_of!(EncOSDQpCfg_t, qp_adj_en) - 0usize];
    ["Offset of field: EncOSDQpCfg_t::qp_adj_sel"]
        [::std::mem::offset_of!(EncOSDQpCfg_t, qp_adj_sel) - 4usize];
    ["Offset of field: EncOSDQpCfg_t::qp"][::std::mem::offset_of!(EncOSDQpCfg_t, qp) - 8usize];
    ["Offset of field: EncOSDQpCfg_t::qp_max"]
        [::std::mem::offset_of!(EncOSDQpCfg_t, qp_max) - 12usize];
    ["Offset of field: EncOSDQpCfg_t::qp_min"]
        [::std::mem::offset_of!(EncOSDQpCfg_t, qp_min) - 16usize];
    ["Offset of field: EncOSDQpCfg_t::qp_prj"]
        [::std::mem::offset_of!(EncOSDQpCfg_t, qp_prj) - 20usize];
};
pub type EncOSDQpCfg = EncOSDQpCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDRegion3_t {
    pub enable: RK_U32,
    pub range_trns_en: RK_U32,
    pub range_trns_sel: RK_U32,
    pub fmt: RK_U32,
    pub rbuv_swap: RK_U32,
    pub lt_x: RK_U32,
    pub lt_y: RK_U32,
    pub rb_x: RK_U32,
    pub rb_y: RK_U32,
    pub stride: RK_U32,
    pub ch_ds_mode: RK_U32,
    pub osd_endn: RK_U32,
    pub inv_cfg: EncOSDInvCfg,
    pub alpha_cfg: EncOSDAlphaCfg,
    pub qp_cfg: EncOSDQpCfg,
    pub osd_buf: MppOsdBuf,
    pub lut: [RK_U8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDRegion3_t"][::std::mem::size_of::<MppEncOSDRegion3_t>() - 160usize];
    ["Alignment of MppEncOSDRegion3_t"][::std::mem::align_of::<MppEncOSDRegion3_t>() - 8usize];
    ["Offset of field: MppEncOSDRegion3_t::enable"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, enable) - 0usize];
    ["Offset of field: MppEncOSDRegion3_t::range_trns_en"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, range_trns_en) - 4usize];
    ["Offset of field: MppEncOSDRegion3_t::range_trns_sel"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, range_trns_sel) - 8usize];
    ["Offset of field: MppEncOSDRegion3_t::fmt"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, fmt) - 12usize];
    ["Offset of field: MppEncOSDRegion3_t::rbuv_swap"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, rbuv_swap) - 16usize];
    ["Offset of field: MppEncOSDRegion3_t::lt_x"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, lt_x) - 20usize];
    ["Offset of field: MppEncOSDRegion3_t::lt_y"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, lt_y) - 24usize];
    ["Offset of field: MppEncOSDRegion3_t::rb_x"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, rb_x) - 28usize];
    ["Offset of field: MppEncOSDRegion3_t::rb_y"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, rb_y) - 32usize];
    ["Offset of field: MppEncOSDRegion3_t::stride"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, stride) - 36usize];
    ["Offset of field: MppEncOSDRegion3_t::ch_ds_mode"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, ch_ds_mode) - 40usize];
    ["Offset of field: MppEncOSDRegion3_t::osd_endn"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, osd_endn) - 44usize];
    ["Offset of field: MppEncOSDRegion3_t::inv_cfg"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, inv_cfg) - 48usize];
    ["Offset of field: MppEncOSDRegion3_t::alpha_cfg"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, alpha_cfg) - 96usize];
    ["Offset of field: MppEncOSDRegion3_t::qp_cfg"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, qp_cfg) - 112usize];
    ["Offset of field: MppEncOSDRegion3_t::osd_buf"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, osd_buf) - 136usize];
    ["Offset of field: MppEncOSDRegion3_t::lut"]
        [::std::mem::offset_of!(MppEncOSDRegion3_t, lut) - 152usize];
};
pub type MppEncOSDRegion3 = MppEncOSDRegion3_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncOSDData3_t {
    pub change: RK_U32,
    pub num_region: RK_U32,
    pub region: [MppEncOSDRegion3; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncOSDData3_t"][::std::mem::size_of::<MppEncOSDData3_t>() - 1288usize];
    ["Alignment of MppEncOSDData3_t"][::std::mem::align_of::<MppEncOSDData3_t>() - 8usize];
    ["Offset of field: MppEncOSDData3_t::change"]
        [::std::mem::offset_of!(MppEncOSDData3_t, change) - 0usize];
    ["Offset of field: MppEncOSDData3_t::num_region"]
        [::std::mem::offset_of!(MppEncOSDData3_t, num_region) - 4usize];
    ["Offset of field: MppEncOSDData3_t::region"]
        [::std::mem::offset_of!(MppEncOSDData3_t, region) - 8usize];
};
pub type MppEncOSDData3 = MppEncOSDData3_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncUserData_t {
    pub len: RK_U32,
    pub pdata: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncUserData_t"][::std::mem::size_of::<MppEncUserData_t>() - 16usize];
    ["Alignment of MppEncUserData_t"][::std::mem::align_of::<MppEncUserData_t>() - 8usize];
    ["Offset of field: MppEncUserData_t::len"]
        [::std::mem::offset_of!(MppEncUserData_t, len) - 0usize];
    ["Offset of field: MppEncUserData_t::pdata"]
        [::std::mem::offset_of!(MppEncUserData_t, pdata) - 8usize];
};
pub type MppEncUserData = MppEncUserData_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncUserDataFull_t {
    pub len: RK_U32,
    pub uuid: *mut RK_U8,
    pub pdata: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncUserDataFull_t"][::std::mem::size_of::<MppEncUserDataFull_t>() - 24usize];
    ["Alignment of MppEncUserDataFull_t"][::std::mem::align_of::<MppEncUserDataFull_t>() - 8usize];
    ["Offset of field: MppEncUserDataFull_t::len"]
        [::std::mem::offset_of!(MppEncUserDataFull_t, len) - 0usize];
    ["Offset of field: MppEncUserDataFull_t::uuid"]
        [::std::mem::offset_of!(MppEncUserDataFull_t, uuid) - 8usize];
    ["Offset of field: MppEncUserDataFull_t::pdata"]
        [::std::mem::offset_of!(MppEncUserDataFull_t, pdata) - 16usize];
};
pub type MppEncUserDataFull = MppEncUserDataFull_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncUserDataSet_t {
    pub count: RK_U32,
    pub datas: *mut MppEncUserDataFull,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncUserDataSet_t"][::std::mem::size_of::<MppEncUserDataSet_t>() - 16usize];
    ["Alignment of MppEncUserDataSet_t"][::std::mem::align_of::<MppEncUserDataSet_t>() - 8usize];
    ["Offset of field: MppEncUserDataSet_t::count"]
        [::std::mem::offset_of!(MppEncUserDataSet_t, count) - 0usize];
    ["Offset of field: MppEncUserDataSet_t::datas"]
        [::std::mem::offset_of!(MppEncUserDataSet_t, datas) - 8usize];
};
pub type MppEncUserDataSet = MppEncUserDataSet_t;
pub const MppEncSceneMode_e_MPP_ENC_SCENE_MODE_DEFAULT: MppEncSceneMode_e = 0;
pub const MppEncSceneMode_e_MPP_ENC_SCENE_MODE_IPC: MppEncSceneMode_e = 1;
pub const MppEncSceneMode_e_MPP_ENC_SCENE_MODE_IPC_PTZ: MppEncSceneMode_e = 2;
pub const MppEncSceneMode_e_MPP_ENC_SCENE_MODE_BUTT: MppEncSceneMode_e = 3;
pub type MppEncSceneMode_e = ::std::os::raw::c_uint;
pub use self::MppEncSceneMode_e as MppEncSceneMode;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SCENE_MODE: MppEncFineTuneCfgChange_e =
    1;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_DEBLUR_EN: MppEncFineTuneCfgChange_e =
    2;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_DEBLUR_STR: MppEncFineTuneCfgChange_e =
    4;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_ANTI_FLICKER_STR:
    MppEncFineTuneCfgChange_e = 8;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_LAMBDA_IDX_I:
    MppEncFineTuneCfgChange_e = 32;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_LAMBDA_IDX_P:
    MppEncFineTuneCfgChange_e = 64;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_ATR_STR_I: MppEncFineTuneCfgChange_e =
    128;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_ATR_STR_P: MppEncFineTuneCfgChange_e =
    256;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_ATL_STR: MppEncFineTuneCfgChange_e =
    512;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SAO_STR_I: MppEncFineTuneCfgChange_e =
    1024;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SAO_STR_P: MppEncFineTuneCfgChange_e =
    2048;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SE_MODE: MppEncFineTuneCfgChange_e =
    4096;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_RC_CONTAINER:
    MppEncFineTuneCfgChange_e = 8192;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_VMAF_OPT: MppEncFineTuneCfgChange_e =
    16384;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_MOTION_STATIC_SWITCH_ENABLE:
    MppEncFineTuneCfgChange_e = 32768;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_ATF_STR: MppEncFineTuneCfgChange_e =
    65536;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_LGT_CHG_LVL: MppEncFineTuneCfgChange_e =
    131072;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_STATIC_FRM_NUM:
    MppEncFineTuneCfgChange_e = 262144;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_MADP16_TH: MppEncFineTuneCfgChange_e =
    524288;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SKIP16_WGT: MppEncFineTuneCfgChange_e =
    1048576;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SKIP32_WGT: MppEncFineTuneCfgChange_e =
    2097152;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SPEED: MppEncFineTuneCfgChange_e =
    4194304;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_SMART_V3_CFG:
    MppEncFineTuneCfgChange_e = 8388608;
pub const MppEncFineTuneCfgChange_e_MPP_ENC_TUNE_CFG_CHANGE_ALL: MppEncFineTuneCfgChange_e =
    4294967295;
pub type MppEncFineTuneCfgChange_e = ::std::os::raw::c_uint;
pub use self::MppEncFineTuneCfgChange_e as MppEncFineTuneCfgChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncFineTuneCfg_t {
    pub change: RK_U32,
    pub scene_mode: MppEncSceneMode,
    pub se_mode: MppEncSeMode,
    pub deblur_en: RK_S32,
    pub deblur_str: RK_S32,
    pub anti_flicker_str: RK_S32,
    pub lambda_idx_i: RK_S32,
    pub lambda_idx_p: RK_S32,
    pub atr_str_i: RK_S32,
    pub atr_str_p: RK_S32,
    pub atl_str: RK_S32,
    pub sao_str_i: RK_S32,
    pub sao_str_p: RK_S32,
    pub rc_container: RK_S32,
    pub vmaf_opt: RK_S32,
    pub motion_static_switch_enable: RK_S32,
    pub atf_str: RK_S32,
    pub lgt_chg_lvl: RK_S32,
    pub static_frm_num: RK_S32,
    pub madp16_th: RK_S32,
    pub skip16_wgt: RK_S32,
    pub skip32_wgt: RK_S32,
    pub qpmap_en: RK_S32,
    pub speed: RK_S32,
    pub bg_delta_qp_i: RK_S32,
    pub bg_delta_qp_p: RK_S32,
    pub fg_delta_qp_i: RK_S32,
    pub fg_delta_qp_p: RK_S32,
    pub bmap_qpmin_i: RK_S32,
    pub bmap_qpmin_p: RK_S32,
    pub bmap_qpmax_i: RK_S32,
    pub bmap_qpmax_p: RK_S32,
    pub min_bg_fqp: RK_S32,
    pub max_bg_fqp: RK_S32,
    pub min_fg_fqp: RK_S32,
    pub max_fg_fqp: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncFineTuneCfg_t"][::std::mem::size_of::<MppEncFineTuneCfg_t>() - 144usize];
    ["Alignment of MppEncFineTuneCfg_t"][::std::mem::align_of::<MppEncFineTuneCfg_t>() - 4usize];
    ["Offset of field: MppEncFineTuneCfg_t::change"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, change) - 0usize];
    ["Offset of field: MppEncFineTuneCfg_t::scene_mode"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, scene_mode) - 4usize];
    ["Offset of field: MppEncFineTuneCfg_t::se_mode"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, se_mode) - 8usize];
    ["Offset of field: MppEncFineTuneCfg_t::deblur_en"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, deblur_en) - 12usize];
    ["Offset of field: MppEncFineTuneCfg_t::deblur_str"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, deblur_str) - 16usize];
    ["Offset of field: MppEncFineTuneCfg_t::anti_flicker_str"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, anti_flicker_str) - 20usize];
    ["Offset of field: MppEncFineTuneCfg_t::lambda_idx_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, lambda_idx_i) - 24usize];
    ["Offset of field: MppEncFineTuneCfg_t::lambda_idx_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, lambda_idx_p) - 28usize];
    ["Offset of field: MppEncFineTuneCfg_t::atr_str_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, atr_str_i) - 32usize];
    ["Offset of field: MppEncFineTuneCfg_t::atr_str_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, atr_str_p) - 36usize];
    ["Offset of field: MppEncFineTuneCfg_t::atl_str"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, atl_str) - 40usize];
    ["Offset of field: MppEncFineTuneCfg_t::sao_str_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, sao_str_i) - 44usize];
    ["Offset of field: MppEncFineTuneCfg_t::sao_str_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, sao_str_p) - 48usize];
    ["Offset of field: MppEncFineTuneCfg_t::rc_container"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, rc_container) - 52usize];
    ["Offset of field: MppEncFineTuneCfg_t::vmaf_opt"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, vmaf_opt) - 56usize];
    ["Offset of field: MppEncFineTuneCfg_t::motion_static_switch_enable"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, motion_static_switch_enable) - 60usize];
    ["Offset of field: MppEncFineTuneCfg_t::atf_str"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, atf_str) - 64usize];
    ["Offset of field: MppEncFineTuneCfg_t::lgt_chg_lvl"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, lgt_chg_lvl) - 68usize];
    ["Offset of field: MppEncFineTuneCfg_t::static_frm_num"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, static_frm_num) - 72usize];
    ["Offset of field: MppEncFineTuneCfg_t::madp16_th"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, madp16_th) - 76usize];
    ["Offset of field: MppEncFineTuneCfg_t::skip16_wgt"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, skip16_wgt) - 80usize];
    ["Offset of field: MppEncFineTuneCfg_t::skip32_wgt"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, skip32_wgt) - 84usize];
    ["Offset of field: MppEncFineTuneCfg_t::qpmap_en"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, qpmap_en) - 88usize];
    ["Offset of field: MppEncFineTuneCfg_t::speed"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, speed) - 92usize];
    ["Offset of field: MppEncFineTuneCfg_t::bg_delta_qp_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, bg_delta_qp_i) - 96usize];
    ["Offset of field: MppEncFineTuneCfg_t::bg_delta_qp_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, bg_delta_qp_p) - 100usize];
    ["Offset of field: MppEncFineTuneCfg_t::fg_delta_qp_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, fg_delta_qp_i) - 104usize];
    ["Offset of field: MppEncFineTuneCfg_t::fg_delta_qp_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, fg_delta_qp_p) - 108usize];
    ["Offset of field: MppEncFineTuneCfg_t::bmap_qpmin_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, bmap_qpmin_i) - 112usize];
    ["Offset of field: MppEncFineTuneCfg_t::bmap_qpmin_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, bmap_qpmin_p) - 116usize];
    ["Offset of field: MppEncFineTuneCfg_t::bmap_qpmax_i"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, bmap_qpmax_i) - 120usize];
    ["Offset of field: MppEncFineTuneCfg_t::bmap_qpmax_p"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, bmap_qpmax_p) - 124usize];
    ["Offset of field: MppEncFineTuneCfg_t::min_bg_fqp"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, min_bg_fqp) - 128usize];
    ["Offset of field: MppEncFineTuneCfg_t::max_bg_fqp"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, max_bg_fqp) - 132usize];
    ["Offset of field: MppEncFineTuneCfg_t::min_fg_fqp"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, min_fg_fqp) - 136usize];
    ["Offset of field: MppEncFineTuneCfg_t::max_fg_fqp"]
        [::std::mem::offset_of!(MppEncFineTuneCfg_t, max_fg_fqp) - 140usize];
};
pub type MppEncFineTuneCfg = MppEncFineTuneCfg_t;
pub type MppEncCfg = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn mpp_enc_cfg_init(cfg: *mut MppEncCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_deinit(cfg: MppEncCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get(
        cfg: *mut MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut ::std::os::raw::c_void,
    ) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_put(cfg: MppEncCfg) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_set_s32(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_set_u32(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_U32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_set_s64(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_S64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_set_u64(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: RK_U64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_set_ptr(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_set_st(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get_s32(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get_u32(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_U32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get_s64(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_S64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get_u64(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut RK_U64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get_ptr(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_get_st(
        cfg: MppEncCfg,
        name: *const ::std::os::raw::c_char,
        val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_cfg_show();
}
pub const MppEncRefMode_e_REF_MODE_GLOBAL: MppEncRefMode_e = 0;
pub const MppEncRefMode_e_REF_TO_PREV_REF_FRM: MppEncRefMode_e = 0;
pub const MppEncRefMode_e_REF_TO_PREV_ST_REF: MppEncRefMode_e = 1;
pub const MppEncRefMode_e_REF_TO_PREV_LT_REF: MppEncRefMode_e = 2;
pub const MppEncRefMode_e_REF_TO_PREV_INTRA: MppEncRefMode_e = 3;
pub const MppEncRefMode_e_REF_MODE_GLOBAL_WITH_ARG: MppEncRefMode_e = 4;
pub const MppEncRefMode_e_REF_TO_TEMPORAL_LAYER: MppEncRefMode_e = 4;
pub const MppEncRefMode_e_REF_TO_LT_REF_IDX: MppEncRefMode_e = 5;
pub const MppEncRefMode_e_REF_TO_ST_PREV_N_REF: MppEncRefMode_e = 6;
pub const MppEncRefMode_e_REF_MODE_GLOBAL_BUTT: MppEncRefMode_e = 7;
pub const MppEncRefMode_e_REF_MODE_LT: MppEncRefMode_e = 24;
pub const MppEncRefMode_e_REF_TO_ST_REF_SETUP: MppEncRefMode_e = 25;
pub const MppEncRefMode_e_REF_MODE_LT_BUTT: MppEncRefMode_e = 26;
pub const MppEncRefMode_e_REF_MODE_ST: MppEncRefMode_e = 28;
pub const MppEncRefMode_e_REF_TO_LT_REF_SETUP: MppEncRefMode_e = 29;
pub const MppEncRefMode_e_REF_MODE_ST_BUTT: MppEncRefMode_e = 30;
pub type MppEncRefMode_e = ::std::os::raw::c_uint;
pub use self::MppEncRefMode_e as MppEncRefMode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncRefLtFrmCfg_t {
    pub lt_idx: RK_S32,
    pub temporal_id: RK_S32,
    pub ref_mode: MppEncRefMode,
    pub ref_arg: RK_S32,
    pub lt_gap: RK_S32,
    pub lt_delay: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncRefLtFrmCfg_t"][::std::mem::size_of::<MppEncRefLtFrmCfg_t>() - 24usize];
    ["Alignment of MppEncRefLtFrmCfg_t"][::std::mem::align_of::<MppEncRefLtFrmCfg_t>() - 4usize];
    ["Offset of field: MppEncRefLtFrmCfg_t::lt_idx"]
        [::std::mem::offset_of!(MppEncRefLtFrmCfg_t, lt_idx) - 0usize];
    ["Offset of field: MppEncRefLtFrmCfg_t::temporal_id"]
        [::std::mem::offset_of!(MppEncRefLtFrmCfg_t, temporal_id) - 4usize];
    ["Offset of field: MppEncRefLtFrmCfg_t::ref_mode"]
        [::std::mem::offset_of!(MppEncRefLtFrmCfg_t, ref_mode) - 8usize];
    ["Offset of field: MppEncRefLtFrmCfg_t::ref_arg"]
        [::std::mem::offset_of!(MppEncRefLtFrmCfg_t, ref_arg) - 12usize];
    ["Offset of field: MppEncRefLtFrmCfg_t::lt_gap"]
        [::std::mem::offset_of!(MppEncRefLtFrmCfg_t, lt_gap) - 16usize];
    ["Offset of field: MppEncRefLtFrmCfg_t::lt_delay"]
        [::std::mem::offset_of!(MppEncRefLtFrmCfg_t, lt_delay) - 20usize];
};
pub type MppEncRefLtFrmCfg = MppEncRefLtFrmCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncRefStFrmCfg_t {
    pub is_non_ref: RK_S32,
    pub temporal_id: RK_S32,
    pub ref_mode: MppEncRefMode,
    pub ref_arg: RK_S32,
    pub repeat: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncRefStFrmCfg_t"][::std::mem::size_of::<MppEncRefStFrmCfg_t>() - 20usize];
    ["Alignment of MppEncRefStFrmCfg_t"][::std::mem::align_of::<MppEncRefStFrmCfg_t>() - 4usize];
    ["Offset of field: MppEncRefStFrmCfg_t::is_non_ref"]
        [::std::mem::offset_of!(MppEncRefStFrmCfg_t, is_non_ref) - 0usize];
    ["Offset of field: MppEncRefStFrmCfg_t::temporal_id"]
        [::std::mem::offset_of!(MppEncRefStFrmCfg_t, temporal_id) - 4usize];
    ["Offset of field: MppEncRefStFrmCfg_t::ref_mode"]
        [::std::mem::offset_of!(MppEncRefStFrmCfg_t, ref_mode) - 8usize];
    ["Offset of field: MppEncRefStFrmCfg_t::ref_arg"]
        [::std::mem::offset_of!(MppEncRefStFrmCfg_t, ref_arg) - 12usize];
    ["Offset of field: MppEncRefStFrmCfg_t::repeat"]
        [::std::mem::offset_of!(MppEncRefStFrmCfg_t, repeat) - 16usize];
};
pub type MppEncRefStFrmCfg = MppEncRefStFrmCfg_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncRefPreset_t {
    pub name: *const ::std::os::raw::c_char,
    pub max_lt_cnt: RK_S32,
    pub max_st_cnt: RK_S32,
    pub lt_cfg: *mut MppEncRefLtFrmCfg,
    pub st_cfg: *mut MppEncRefStFrmCfg,
    pub lt_cnt: RK_S32,
    pub st_cnt: RK_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncRefPreset_t"][::std::mem::size_of::<MppEncRefPreset_t>() - 40usize];
    ["Alignment of MppEncRefPreset_t"][::std::mem::align_of::<MppEncRefPreset_t>() - 8usize];
    ["Offset of field: MppEncRefPreset_t::name"]
        [::std::mem::offset_of!(MppEncRefPreset_t, name) - 0usize];
    ["Offset of field: MppEncRefPreset_t::max_lt_cnt"]
        [::std::mem::offset_of!(MppEncRefPreset_t, max_lt_cnt) - 8usize];
    ["Offset of field: MppEncRefPreset_t::max_st_cnt"]
        [::std::mem::offset_of!(MppEncRefPreset_t, max_st_cnt) - 12usize];
    ["Offset of field: MppEncRefPreset_t::lt_cfg"]
        [::std::mem::offset_of!(MppEncRefPreset_t, lt_cfg) - 16usize];
    ["Offset of field: MppEncRefPreset_t::st_cfg"]
        [::std::mem::offset_of!(MppEncRefPreset_t, st_cfg) - 24usize];
    ["Offset of field: MppEncRefPreset_t::lt_cnt"]
        [::std::mem::offset_of!(MppEncRefPreset_t, lt_cnt) - 32usize];
    ["Offset of field: MppEncRefPreset_t::st_cnt"]
        [::std::mem::offset_of!(MppEncRefPreset_t, st_cnt) - 36usize];
};
pub type MppEncRefPreset = MppEncRefPreset_t;
pub type MppEncRefCfg = *mut ::std::os::raw::c_void;
pub const MppEncRefCfgMode_e_REF_IPPP: MppEncRefCfgMode_e = 0;
pub const MppEncRefCfgMode_e_REF_TSVC1: MppEncRefCfgMode_e = 1;
pub const MppEncRefCfgMode_e_REF_TSVC2: MppEncRefCfgMode_e = 2;
pub const MppEncRefCfgMode_e_REF_TSVC3: MppEncRefCfgMode_e = 3;
pub const MppEncRefCfgMode_e_REF_VI: MppEncRefCfgMode_e = 4;
pub const MppEncRefCfgMode_e_REF_HIR_SKIP: MppEncRefCfgMode_e = 5;
pub const MppEncRefCfgMode_e_REF_BUTT: MppEncRefCfgMode_e = 6;
pub type MppEncRefCfgMode_e = ::std::os::raw::c_uint;
pub use self::MppEncRefCfgMode_e as MppEncRefCfgMode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppEncRefParam_t {
    pub cfg_mode: MppEncRefCfgMode,
    pub gop_len: RK_S32,
    pub vi_len: RK_S32,
    pub base_N: RK_U32,
    pub enh_M: RK_U32,
    pub pre_en: RK_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppEncRefParam_t"][::std::mem::size_of::<MppEncRefParam_t>() - 24usize];
    ["Alignment of MppEncRefParam_t"][::std::mem::align_of::<MppEncRefParam_t>() - 4usize];
    ["Offset of field: MppEncRefParam_t::cfg_mode"]
        [::std::mem::offset_of!(MppEncRefParam_t, cfg_mode) - 0usize];
    ["Offset of field: MppEncRefParam_t::gop_len"]
        [::std::mem::offset_of!(MppEncRefParam_t, gop_len) - 4usize];
    ["Offset of field: MppEncRefParam_t::vi_len"]
        [::std::mem::offset_of!(MppEncRefParam_t, vi_len) - 8usize];
    ["Offset of field: MppEncRefParam_t::base_N"]
        [::std::mem::offset_of!(MppEncRefParam_t, base_N) - 12usize];
    ["Offset of field: MppEncRefParam_t::enh_M"]
        [::std::mem::offset_of!(MppEncRefParam_t, enh_M) - 16usize];
    ["Offset of field: MppEncRefParam_t::pre_en"]
        [::std::mem::offset_of!(MppEncRefParam_t, pre_en) - 20usize];
};
pub type MppEncRefParam = MppEncRefParam_t;
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_init(ref_: *mut MppEncRefCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_deinit(ref_: *mut MppEncRefCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_reset(ref_: MppEncRefCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_set_cfg_cnt(
        ref_: MppEncRefCfg,
        lt_cnt: RK_S32,
        st_cnt: RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_add_lt_cfg(
        ref_: MppEncRefCfg,
        cnt: RK_S32,
        frm: *mut MppEncRefLtFrmCfg,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_add_st_cfg(
        ref_: MppEncRefCfg,
        cnt: RK_S32,
        frm: *mut MppEncRefStFrmCfg,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_check(ref_: MppEncRefCfg) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_set_keep_cpb(ref_: MppEncRefCfg, keep: RK_S32) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_get_preset(preset: *mut MppEncRefPreset) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_enc_ref_cfg_show(ref_: MppEncRefCfg) -> MPP_RET;
}
pub const MppPortType_MPP_PORT_INPUT: MppPortType = 0;
pub const MppPortType_MPP_PORT_OUTPUT: MppPortType = 1;
pub const MppPortType_MPP_PORT_BUTT: MppPortType = 2;
pub type MppPortType = ::std::os::raw::c_uint;
pub const MppTaskWorkMode_MPP_TASK_ASYNC: MppTaskWorkMode = 0;
pub const MppTaskWorkMode_MPP_TASK_SYNC: MppTaskWorkMode = 1;
pub const MppTaskWorkMode_MPP_TASK_WORK_MODE_BUTT: MppTaskWorkMode = 2;
pub type MppTaskWorkMode = ::std::os::raw::c_uint;
pub const MppPollType_MPP_POLL_BUTT: MppPollType = -2;
pub const MppPollType_MPP_POLL_BLOCK: MppPollType = -1;
pub const MppPollType_MPP_POLL_NON_BLOCK: MppPollType = 0;
pub const MppPollType_MPP_POLL_MAX: MppPollType = 8000;
pub type MppPollType = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn mpp_task_meta_set_s32(task: MppTask, key: MppMetaKey, val: RK_S32) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_set_s64(task: MppTask, key: MppMetaKey, val: RK_S64) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_set_ptr(
        task: MppTask,
        key: MppMetaKey,
        val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_set_frame(task: MppTask, key: MppMetaKey, frame: MppFrame) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_set_packet(task: MppTask, key: MppMetaKey, packet: MppPacket) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_set_buffer(task: MppTask, key: MppMetaKey, buffer: MppBuffer) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_get_s32(
        task: MppTask,
        key: MppMetaKey,
        val: *mut RK_S32,
        default_val: RK_S32,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_get_s64(
        task: MppTask,
        key: MppMetaKey,
        val: *mut RK_S64,
        default_val: RK_S64,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_get_ptr(
        task: MppTask,
        key: MppMetaKey,
        val: *mut *mut ::std::os::raw::c_void,
        default_val: *mut ::std::os::raw::c_void,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_get_frame(task: MppTask, key: MppMetaKey, frame: *mut MppFrame)
    -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_get_packet(
        task: MppTask,
        key: MppMetaKey,
        packet: *mut MppPacket,
    ) -> MPP_RET;
}
unsafe extern "C" {
    pub fn mpp_task_meta_get_buffer(
        task: MppTask,
        key: MppMetaKey,
        buffer: *mut MppBuffer,
    ) -> MPP_RET;
}
#[doc = " @ingroup rk_mpi\n @brief MPP main work function set\n @details all api function are seperated into two sets: data io api set\n          and control api set\n\n (1). the data api set is for data input/output flow including:\n\n (1.1) simple data api set:\n\n decode   : both send video stream packet to decoder and get video frame from\n            decoder at the same time.\n\n encode   : both send video frame to encoder and get encoded video stream from\n            encoder at the same time.\n\n decode_put_packet: send video stream packet to decoder only, async interface\n\n decode_get_frame : get video frame from decoder only, async interface\n\n encode_put_frame : send video frame to encoder only, async interface\n\n encode_get_packet: get encoded video packet from encoder only, async interface\n\n (1.2) advanced task api set:\n\n poll     : poll port for dequeue\n\n dequeue  : pop a task from mpp task queue\n\n enqueue  : push a task to mpp task queue\n\n (2). the control api set is for mpp context control including:\n\n control  : similiar to ioctl in kernel driver, setup or get mpp internal parameter\n\n reset    : clear all data in mpp context, discard all packet and frame,\n            reset all components to initialized status"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MppApi_t {
    #[doc = " @brief size of struct MppApi"]
    pub size: RK_U32,
    #[doc = " @brief mpp api version, generated by Git"]
    pub version: RK_U32,
    #[doc = " @brief both send video stream packet to decoder and get video frame from\n        decoder at the same time\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] packet The input video stream, its usage can refer mpp_packet.h.\n @param[out] frame The output picture, its usage can refer mpp_frame.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, packet: MppPacket, frame: *mut MppFrame) -> MPP_RET,
    >,
    #[doc = " @brief send video stream packet to decoder only, async interface\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] packet The input video stream, its usage can refer mpp_packet.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub decode_put_packet:
        ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx, packet: MppPacket) -> MPP_RET>,
    #[doc = " @brief get video frame from decoder only, async interface\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[out] frame The output picture, its usage can refer mpp_frame.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub decode_get_frame:
        ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx, frame: *mut MppFrame) -> MPP_RET>,
    #[doc = " @brief both send video frame to encoder and get encoded video stream from\n        encoder at the same time\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] frame The input video data, its usage can refer mpp_frame.h.\n @param[out] packet The output compressed data, its usage can refer mpp_packet.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, frame: MppFrame, packet: *mut MppPacket) -> MPP_RET,
    >,
    #[doc = " @brief send video frame to encoder only, async interface\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] frame The input video data, its usage can refer mpp_frame.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub encode_put_frame:
        ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx, frame: MppFrame) -> MPP_RET>,
    #[doc = " @brief get encoded video packet from encoder only, async interface\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[out] packet The output compressed data, its usage can refer mpp_packet.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub encode_get_packet:
        ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx, packet: *mut MppPacket) -> MPP_RET>,
    #[doc = " @brief ISP interface, will be supported in the future."]
    pub isp: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, dst: MppFrame, src: MppFrame) -> MPP_RET,
    >,
    #[doc = " @brief ISP interface, will be supported in the future."]
    pub isp_put_frame:
        ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx, frame: MppFrame) -> MPP_RET>,
    #[doc = " @brief ISP interface, will be supported in the future."]
    pub isp_get_frame:
        ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx, frame: *mut MppFrame) -> MPP_RET>,
    #[doc = " @brief poll port for dequeue\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] type input port or output port which are both for data transaction\n @param[in] timeout mpp poll type, its usage can refer mpp_task.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub poll: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, type_: MppPortType, timeout: MppPollType) -> MPP_RET,
    >,
    #[doc = " @brief dequeue MppTask, pop a task from mpp task queue\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] type input port or output port which are both for data transaction\n @param[out] task MppTask popped from mpp task queue, its usage can refer mpp_task.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub dequeue: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, type_: MppPortType, task: *mut MppTask) -> MPP_RET,
    >,
    #[doc = " @brief enqueue MppTask, push a task to mpp task queue\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] type input port or output port which are both for data transaction\n @param[in] task MppTask which is sent to mpp for process, its usage can refer mpp_task.h.\n @return 0 and positive for success, negative for failure. The return\n         value is an error code. For details, please refer mpp_err.h."]
    pub enqueue: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, type_: MppPortType, task: MppTask) -> MPP_RET,
    >,
    #[doc = " @brief discard all packet and frame, reset all component,\n        for both decoder and encoder\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @return 0 for success, others for failure. The return value is an\n         error code. For details, please refer mpp_err.h."]
    pub reset: ::std::option::Option<unsafe extern "C" fn(ctx: MppCtx) -> MPP_RET>,
    #[doc = " @brief control function for mpp property setting\n @param[in] ctx The context of mpp, created by mpp_create() and initiated\n                by mpp_init().\n @param[in] cmd The mpi command, its definition can refer rk_mpi_cmd.h.\n @param[in,out] param The mpi command parameter\n @return 0 for success, others for failure. The return value is an\n         error code. For details, please refer mpp_err.h."]
    pub control: ::std::option::Option<
        unsafe extern "C" fn(ctx: MppCtx, cmd: MpiCmd, param: MppParam) -> MPP_RET,
    >,
    #[doc = " @brief The reserved segment, may be used in the future"]
    pub reserv: [RK_U32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MppApi_t"][::std::mem::size_of::<MppApi_t>() - 184usize];
    ["Alignment of MppApi_t"][::std::mem::align_of::<MppApi_t>() - 8usize];
    ["Offset of field: MppApi_t::size"][::std::mem::offset_of!(MppApi_t, size) - 0usize];
    ["Offset of field: MppApi_t::version"][::std::mem::offset_of!(MppApi_t, version) - 4usize];
    ["Offset of field: MppApi_t::decode"][::std::mem::offset_of!(MppApi_t, decode) - 8usize];
    ["Offset of field: MppApi_t::decode_put_packet"]
        [::std::mem::offset_of!(MppApi_t, decode_put_packet) - 16usize];
    ["Offset of field: MppApi_t::decode_get_frame"]
        [::std::mem::offset_of!(MppApi_t, decode_get_frame) - 24usize];
    ["Offset of field: MppApi_t::encode"][::std::mem::offset_of!(MppApi_t, encode) - 32usize];
    ["Offset of field: MppApi_t::encode_put_frame"]
        [::std::mem::offset_of!(MppApi_t, encode_put_frame) - 40usize];
    ["Offset of field: MppApi_t::encode_get_packet"]
        [::std::mem::offset_of!(MppApi_t, encode_get_packet) - 48usize];
    ["Offset of field: MppApi_t::isp"][::std::mem::offset_of!(MppApi_t, isp) - 56usize];
    ["Offset of field: MppApi_t::isp_put_frame"]
        [::std::mem::offset_of!(MppApi_t, isp_put_frame) - 64usize];
    ["Offset of field: MppApi_t::isp_get_frame"]
        [::std::mem::offset_of!(MppApi_t, isp_get_frame) - 72usize];
    ["Offset of field: MppApi_t::poll"][::std::mem::offset_of!(MppApi_t, poll) - 80usize];
    ["Offset of field: MppApi_t::dequeue"][::std::mem::offset_of!(MppApi_t, dequeue) - 88usize];
    ["Offset of field: MppApi_t::enqueue"][::std::mem::offset_of!(MppApi_t, enqueue) - 96usize];
    ["Offset of field: MppApi_t::reset"][::std::mem::offset_of!(MppApi_t, reset) - 104usize];
    ["Offset of field: MppApi_t::control"][::std::mem::offset_of!(MppApi_t, control) - 112usize];
    ["Offset of field: MppApi_t::reserv"][::std::mem::offset_of!(MppApi_t, reserv) - 120usize];
};
#[doc = " @ingroup rk_mpi\n @brief MPP main work function set\n @details all api function are seperated into two sets: data io api set\n          and control api set\n\n (1). the data api set is for data input/output flow including:\n\n (1.1) simple data api set:\n\n decode   : both send video stream packet to decoder and get video frame from\n            decoder at the same time.\n\n encode   : both send video frame to encoder and get encoded video stream from\n            encoder at the same time.\n\n decode_put_packet: send video stream packet to decoder only, async interface\n\n decode_get_frame : get video frame from decoder only, async interface\n\n encode_put_frame : send video frame to encoder only, async interface\n\n encode_get_packet: get encoded video packet from encoder only, async interface\n\n (1.2) advanced task api set:\n\n poll     : poll port for dequeue\n\n dequeue  : pop a task from mpp task queue\n\n enqueue  : push a task to mpp task queue\n\n (2). the control api set is for mpp context control including:\n\n control  : similiar to ioctl in kernel driver, setup or get mpp internal parameter\n\n reset    : clear all data in mpp context, discard all packet and frame,\n            reset all components to initialized status"]
pub type MppApi = MppApi_t;
unsafe extern "C" {
    #[doc = " @ingroup rk_mpi\n @brief Create empty context structure and mpi function pointers.\n        Use functions in MppApi to access mpp services.\n @param[in,out] ctx pointer of the mpp context, refer to MpiImpl_t.\n @param[in,out] mpi pointer of mpi function, refer to MppApi.\n @return 0 for success, others for failure. The return value is an\n         error code. For details, please refer mpp_err.h.\n @note This interface creates base flow context, all function calls\n       are based on it."]
    pub fn mpp_create(ctx: *mut MppCtx, mpi: *mut *mut MppApi) -> MPP_RET;
}
unsafe extern "C" {
    #[doc = " @ingroup rk_mpi\n @brief Call after mpp_create to setup mpp type and video format.\n        This function will call internal context init function.\n @param[in] ctx The context of mpp, created by mpp_create().\n @param[in] type specify decoder or encoder, refer to MppCtxType.\n @param[in] coding specify video compression coding, refer to MppCodingType.\n @return 0 for success, others for failure. The return value is an\n         error code. For details, please refer mpp_err.h."]
    pub fn mpp_init(ctx: MppCtx, type_: MppCtxType, coding: MppCodingType) -> MPP_RET;
}
unsafe extern "C" {
    #[doc = " @ingroup rk_mpi\n @brief Destroy mpp context and free both context and mpi structure,\n        it matches with mpp_init().\n @param[in] ctx The context of mpp, created by mpp_create().\n @return 0 for success, others for failure. The return value is an\n         error code. For details, please refer mpp_err.h."]
    pub fn mpp_destroy(ctx: MppCtx) -> MPP_RET;
}
unsafe extern "C" {
    #[doc = " @ingroup rk_mpi\n @brief judge given format is supported or not by MPP.\n @param[in] type specify decoder or encoder, refer to MppCtxType.\n @param[in] coding specify video compression coding, refer to MppCodingType.\n @return 0 for support, -1 for unsupported."]
    pub fn mpp_check_support_format(type_: MppCtxType, coding: MppCodingType) -> MPP_RET;
}
unsafe extern "C" {
    #[doc = " @ingroup rk_mpi\n @brief List all formats supported by MPP\n @param NULL no need to input parameter\n @return No return value. This function just prints format information supported\n         by MPP on standard output."]
    pub fn mpp_show_support_format();
}
unsafe extern "C" {
    pub fn mpp_show_color_format();
}
unsafe extern "C" {
    pub fn mpp_env_get_u32(
        name: *const ::std::os::raw::c_char,
        value: *mut RK_U32,
        default_value: RK_U32,
    ) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_env_get_str(
        name: *const ::std::os::raw::c_char,
        value: *mut *const ::std::os::raw::c_char,
        default_value: *const ::std::os::raw::c_char,
    ) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_env_set_u32(name: *const ::std::os::raw::c_char, value: RK_U32) -> RK_S32;
}
unsafe extern "C" {
    pub fn mpp_env_set_str(
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
    ) -> RK_S32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_int,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __pad1: ::std::os::raw::c_ulong,
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 8usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 8usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 64usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 64usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 48usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 8usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
